iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFTRIM:4;
      uint64_t reservedSpace0:4;
      uint64_t HFTRIM:4;
      uint64_t reservedSpace1:4;
      uint64_t OSCFRQCONFIGCNT:1;
      uint64_t reservedSpace2:7;
      uint64_t BIAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPOMONCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_ECP_PIN:4;
      uint64_t reservedSpace0:4;
      uint64_t CLK_GIO_PIN:4;
      uint64_t reservedSpace1:4;
      uint64_t CLK_TEST_EN:4;
      uint64_t reservedSpace2:4;
      uint64_t RANGEDETENASSEL:4;
      uint64_t RANGEDETCTRL:4;
      uint64_t ALTLIMPCLOCKENABLE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKTEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_MODE_KEY:4;
      uint64_t reservedSpace0:4;
      uint64_t DFTREAD:2;
      uint64_t reservedSpace1:2;
      uint64_t DFTWRITE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFTCTRLREG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_MODE_KEY:4;
      uint64_t IMPDF_270:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFTCTRLREG2;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTPUT_BUFFER_LOW_EMI_MODE:16;
      uint64_t PLL1_RFSLIP_FILTER_KEY:4;
      uint64_t PLL1_FBSLIP_FILTER_COUNT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG1;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATYPE:1;
      uint64_t reservedSpace0:7;
      uint64_t VBUSA:1;
      uint64_t NCBA:1;
      uint64_t EMIFA:1;
      uint64_t reservedSpace1:5;
      uint64_t MASTERID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMPFASTS;

  uint32_t IMPFTADD;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSDATA1:8;
      uint64_t SSKEY1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSIR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSDATA2:8;
      uint64_t SSKEY2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSIR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSDATA3:8;
      uint64_t SSKEY3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSIR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSDATA4:8;
      uint64_t SSKEY4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSIR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WST_DENA0:1;
      uint64_t reservedSpace0:1;
      uint64_t WST_AENA0:1;
      uint64_t reservedSpace1:13;
      uint64_t RAM_DFT_EN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMGCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEMSW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BMMCR1;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPURSTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PENA:1;
      uint64_t reservedSpace1:7;
      uint64_t VCLKR:4;
      uint64_t reservedSpace2:4;
      uint64_t VCLK2R:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCNTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPDIV:16;
      uint64_t ECPINSEL:2;
      uint64_t reservedSpace0:5;
      uint64_t ECPCOS:1;
      uint64_t ECPSSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECPCNTL;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVPARSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t RESET0:1;
      uint64_t RESET1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPMODE:1;
      uint64_t reservedSpace0:2;
      uint64_t EXTRST:1;
      uint64_t SWRST:1;
      uint64_t CPURST:1;
      uint64_t reservedSpace1:7;
      uint64_t WDRST:1;
      uint64_t OSCRST:1;
      uint64_t PORST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE_Abort:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSCFAIL:1;
      uint64_t reservedSpace0:7;
      uint64_t RFSLIP:1;
      uint64_t FBSLIP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLBSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLATFORM:3;
      uint64_t VERSION:5;
      uint64_t RAM:1;
      uint64_t FLASH:2;
      uint64_t Peripheral_parity:1;
      uint64_t IO_VOLTAGE:1;
      uint64_t TECH:4;
      uint64_t UNIQUE:14;
      uint64_t CP15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVID;

};

#define SYS_0 (*(volatile struct SYS_0_tag *) 0xffffff00)

struct SYS2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLMUL2:16;
      uint64_t REFCLKDIV2:6;
      uint64_t reservedSpace0:2;
      uint64_t PLLDIV2:5;
      uint64_t ODPLL2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCTL3;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CLKDIV:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCLKDIV;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCLK3R:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK2CNTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCLKA3S:4;
      uint64_t VCLKA3_DIV_CDDIS:1;
      uint64_t reservedSpace0:3;
      uint64_t VCLKA3R:3;
      uint64_t reservedSpace1:5;
      uint64_t VCLKA4S:4;
      uint64_t VCLKA4_DIV_CDDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t VCLKA4R:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VCLKACON1;

