iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define PCR_0 (*(volatile struct PCR_0_tag *) 0xffffe000)

struct PBIST_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RLS:2;
      uint64_t PLS:4;
      uint64_t SMS:2;
      uint64_t DWR:8;
      uint64_t RDS:8;
      uint64_t RGS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DLR2:1;
      uint64_t reservedSpace1:1;
      uint64_t DLR4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLR;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACT0:1;
      uint64_t PACT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PBIST_bitfield:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVER;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSRF0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSRF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSRF1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSRF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSRC0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSRC1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSRA0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSRA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSRA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSRA1;

  uint32_t FSRDL0;
  uint8_t res2[4];

  uint32_t FSRDL1;
  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALGO0:8;
      uint64_t ALGO1:8;
      uint64_t ALGO2:8;
      uint64_t ALGO3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALGO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RINFOL0:8;
      uint64_t RINFOL1:8;
      uint64_t RINFOL2:8;
      uint64_t RINFOL3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RINFOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RINFOU0:8;
      uint64_t RINFOU1:8;
      uint64_t RINFOU2:8;
      uint64_t RINFOU3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RINFOU;

};

#define PBIST_0 (*(volatile struct PBIST_0_tag *) 0xffffe560)

struct STC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RS_CNT:1;
      uint64_t reservedSpace0:15;
      uint64_t INTCOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCGCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STC_ENA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCGCR1;

  uint32_t STCTPR;
  uint32_t STC_CADDR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t N:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCCICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_DONE:1;
      uint64_t TEST_FAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCGSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPU1_FAIL:1;
      uint64_t CPU2_FAIL:1;
      uint64_t TO_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCFSTAT;

  uint8_t res0[16];

  uint32_t CPU1_CURMISR3;
  uint32_t CPU1_CURMISR2;
  uint32_t CPU1_CURMISR1;
  uint32_t CPU1_CURMISR0;
  uint32_t CPU2_CURMISR3;
  uint32_t CPU2_CURMISR2;
  uint32_t CPU2_CURMISR1;
  uint32_t CPU2_CURMISR0;
};

#define STC_0 (*(volatile struct STC_0_tag *) 0xffffe600)

struct PLL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLMUL:16;
      uint64_t REFCLKDIV:6;
      uint64_t reservedSpace0:2;
      uint64_t PLLDIV:4;
      uint64_t reservedSpace1:1;
      uint64_t ODPLL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCTL3;

  uint8_t res0[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL1_RFSLIP_FILTER_KEY:4;
      uint64_t reservedSpace0:4;
      uint64_t PLL1_RFSLIP_FILTER_COUNT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKSLIP;

  uint8_t res1[7600];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT_COUNTER_EN:1;
      uint64_t TAP_COUNTER_DIS:3;
      uint64_t COUNTER_EN:1;
      uint64_t COUNTER_RESET:1;
      uint64_t COUNTER_READ_READY:1;
      uint64_t reservedSpace0:1;
      uint64_t CAPTURE_WINDOW_INDEX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSWPLL1;

  uint32_t SSWPLL2;
  uint32_t SSWPLL3;
  uint8_t res2[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLMUL:16;
      uint64_t REFCLKDIV:6;
      uint64_t reservedSpace0:1;
      uint64_t ROF:1;
      uint64_t PLLDIV:5;
      uint64_t BPOS:2;
      uint64_t ROS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPR_AMOUNT:9;
      uint64_t ODPLL:3;
      uint64_t MULMOD:9;
      uint64_t reservedSpace0:1;
      uint64_t SPREADINGRATE:9;
      uint64_t FMENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCTL2;

  uint8_t res3[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PLL1_FBSLIP_FILTER_KEY:4;
      uint64_t PLL1_FBSLIP_FILTER_COUNT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG1;

};

#define PLL_0 (*(volatile struct PLL_0_tag *) 0xffffe100)

