iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define EMIF_0 (*(volatile struct EMIF_0_tag *) 0xfcffe800)

struct GIO_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOGCR0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOINTDET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOINTDET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPOL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOENASET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOENASET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOENACLR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOENACLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOLVLSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOLVLSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOLVLCLR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOLVLCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOFLG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOOFFA:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOOFFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOOFFB:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOOFFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOEMUA:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOEMUA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOEMUB:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOEMUB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODINA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODINA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODSETA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODCLRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODINB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODINB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODSETB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODCLRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLB;

};

#define GIO_0 (*(volatile struct GIO_0_tag *) 0xfff7bc00)

struct SCILIN_Serial_Communication_InterfaceLocal_Interconnect_Network_Module_SCILIN_0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIGCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMM:1;
      uint64_t TIMING:1;
      uint64_t PARITY_0:1;
      uint64_t PARITY_1:1;
      uint64_t STOP_0:1;
      uint64_t CLOCK:1;
      uint64_t LIN:1;
      uint64_t SWnRST:1;
      uint64_t SLEEP:1;
      uint64_t ADAPT:1;
      uint64_t MBUF:1;
      uint64_t CTYPE:1;
      uint64_t HGEN:1;
      uint64_t STOP_1:1;
      uint64_t reservedSpace0:2;
      uint64_t LOOP:1;
      uint64_t CONT:1;
      uint64_t reservedSpace1:6;
      uint64_t RXENA:1;
      uint64_t TXENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIGCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWERDOWN:1;
      uint64_t reservedSpace0:7;
      uint64_t GEN:1;
      uint64_t reservedSpace1:7;
      uint64_t SC:1;
      uint64_t CC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIGCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_0:1;
      uint64_t SET_1:1;
      uint64_t reservedSpace0:2;
      uint64_t SET_2:1;
      uint64_t reservedSpace1:1;
      uint64_t SET_3:1;
      uint64_t SET_4:1;
      uint64_t SET_5:1;
      uint64_t SET_6:1;
      uint64_t reservedSpace2:3;
      uint64_t SET_7:1;
      uint64_t reservedSpace3:2;
      uint64_t SET_8:1;
      uint64_t SET_9:1;
      uint64_t SET_10:1;
      uint64_t reservedSpace4:5;
      uint64_t SET_11:1;
      uint64_t SET_12:1;
      uint64_t SET_13:1;
      uint64_t SET_14:1;
      uint64_t SET_15:1;
      uint64_t SET_16:1;
      uint64_t SET_17:1;
      uint64_t SET_18:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCISETINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_0:1;
      uint64_t CLR_1:1;
      uint64_t reservedSpace0:2;
      uint64_t CLR_2:1;
      uint64_t reservedSpace1:1;
      uint64_t CLR_3:1;
      uint64_t CLR_4:1;
      uint64_t CLR_5:1;
      uint64_t CLR_6:1;
      uint64_t reservedSpace2:3;
      uint64_t CLR_7:1;
      uint64_t reservedSpace3:2;
      uint64_t CLR_8:1;
      uint64_t CLR_9:1;
      uint64_t CLR_10:1;
      uint64_t reservedSpace4:5;
      uint64_t CLR_11:1;
      uint64_t CLR_12:1;
      uint64_t CLR_13:1;
      uint64_t CLR_14:1;
      uint64_t CLR_15:1;
      uint64_t CLR_16:1;
      uint64_t CLR_17:1;
      uint64_t CLR_18:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCICLEARINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_0:1;
      uint64_t SET_1:1;
      uint64_t reservedSpace0:2;
      uint64_t SET_2:1;
      uint64_t reservedSpace1:1;
      uint64_t SET_3:1;
      uint64_t SET_4:1;
      uint64_t SET_5:1;
      uint64_t SET_6:1;
      uint64_t reservedSpace2:3;
      uint64_t SET_7:1;
      uint64_t reservedSpace3:4;
      uint64_t SET_8:1;
      uint64_t reservedSpace4:5;
      uint64_t SET_9:1;
      uint64_t SET_10:1;
      uint64_t SET_11:1;
      uint64_t SET_12:1;
      uint64_t SET_13:1;
      uint64_t SET_14:1;
      uint64_t SET_15:1;
      uint64_t SET_16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCISETINTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_0:1;
      uint64_t CLR_1:1;
      uint64_t reservedSpace0:2;
      uint64_t CLR_2:1;
      uint64_t reservedSpace1:1;
      uint64_t CLR_3:1;
      uint64_t CLR_4:1;
      uint64_t CLR_5:1;
      uint64_t CLR_6:1;
      uint64_t reservedSpace2:3;
      uint64_t CLR_7:1;
      uint64_t reservedSpace3:4;
      uint64_t CLR_8:1;
      uint64_t reservedSpace4:5;
      uint64_t CLR_9:1;
      uint64_t CLR_10:1;
      uint64_t CLR_11:1;
      uint64_t CLR_12:1;
      uint64_t CLR_13:1;
      uint64_t CLR_14:1;
      uint64_t CLR_15:1;
      uint64_t CLR_16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCICLEARINTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRKDT:1;
      uint64_t WAKEUP:1;
      uint64_t IDLE:1;
      uint64_t BUSY:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace0:1;
      uint64_t TOAWUS:1;
      uint64_t TOA3WUS:1;
      uint64_t TXRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXWAKE:1;
      uint64_t TX:1;
      uint64_t RXWAKE:1;
      uint64_t ID_0:1;
      uint64_t ID_1:1;
      uint64_t reservedSpace1:9;
      uint64_t PE:1;
      uint64_t OE:1;
      uint64_t FE:1;
      uint64_t NRE:1;
      uint64_t ISFE:1;
      uint64_t CE:1;
      uint64_t PBE:1;
      uint64_t BE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIFLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTVECT0:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVECT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTVECT1:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVECT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHAR:3;
      uint64_t reservedSpace0:13;
      uint64_t LENGTH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIFORMAT;

