iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_127;

};

#define Multi_buffer_RAM_MibSPI1_0 (*(volatile struct Multi_buffer_RAM_MibSPI1_0_tag *) 0xff0e0000)

struct Multi_buffer_RAM_MibSPI3_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_71;

