iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
struct DCAN_DCAN1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Init:1;
      uint64_t IE0:1;
      uint64_t SIE:1;
      uint64_t EIE:1;
      uint64_t reservedSpace0:1;
      uint64_t DAR:1;
      uint64_t CCE:1;
      uint64_t Test:1;
      uint64_t IDS:1;
      uint64_t ABO:1;
      uint64_t PMD:4;
      uint64_t reservedSpace1:1;
      uint64_t SWR:1;
      uint64_t InitDbg:1;
      uint64_t IE1:1;
      uint64_t DE1:1;
      uint64_t DE2:1;
      uint64_t DE3:1;
      uint64_t reservedSpace2:3;
      uint64_t PDR:1;
      uint64_t WUBA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TxOk:1;
      uint64_t RxOk:1;
      uint64_t EPass:1;
      uint64_t EWarn:1;
      uint64_t BOff:1;
      uint64_t PER:1;
      uint64_t WakeUp_Pnd:1;
      uint64_t PDA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_ES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEC:8;
      uint64_t REC:7;
      uint64_t RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_ERRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSeg1:4;
      uint64_t TSeg2:3;
      uint64_t reservedSpace0:1;
      uint64_t BRPE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_BTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntID:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t Silent:1;
      uint64_t LBack:1;
      uint64_t Tx:2;
      uint64_t Rx:1;
      uint64_t EXL:1;
      uint64_t RDA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TEST;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Message_Number:8;
      uint64_t Word_Number:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_PERR;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ABO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_ABOTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqstReg1:2;
      uint64_t TxRqstReg2:2;
      uint64_t TxRqstReg3:2;
      uint64_t TxRqstReg4:2;
      uint64_t TxRqstReg5:2;
      uint64_t TxRqstReg6:2;
      uint64_t TxRqstReg7:2;
      uint64_t TxRqstReg8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqst:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqst:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqst:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqst:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDatReg1:2;
      uint64_t NewDatReg2:2;
      uint64_t NewDatReg3:2;
      uint64_t NewDatReg4:2;
      uint64_t NewDatReg5:2;
      uint64_t NewDatReg6:2;
      uint64_t NewDatReg7:2;
      uint64_t NewDatReg8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPndReg1:2;
      uint64_t IntPndReg2:2;
      uint64_t IntPndReg3:2;
      uint64_t IntPndReg4:2;
      uint64_t IntPndReg5:2;
      uint64_t IntPndReg6:2;
      uint64_t IntPndReg7:2;
      uint64_t IntPndReg8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPnd:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPnd:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPnd:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPnd:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVALReg1:2;
      uint64_t MSGVALReg2:2;
      uint64_t MSGVALReg3:2;
      uint64_t MSGVALReg4:2;
      uint64_t MSGVALReg5:2;
      uint64_t MSGVALReg6:2;
      uint64_t MSGVALReg7:2;
      uint64_t MSGVALReg8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL78;

