iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res1[4];

  uint32_t HETDIR;
  uint32_t HETDIN;
  uint32_t HETDOUT;
  uint32_t HETDSET;
  uint32_t HETDCLR;
  uint32_t HETPDR;
  uint32_t HETPULDIS;
  uint32_t HETPSL;
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY_ENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PAOFF:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETPAR;

  uint32_t HETPPR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRLD:10;
      uint64_t reservedSpace0:6;
      uint64_t CCDIV:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETSFPRLD;

  uint32_t HETSFENA;
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBPSEL:16;
      uint64_t LBPTYPE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETLBPSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBPDIR:16;
      uint64_t IODFTENA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETLBPDIR;

  uint32_t HETPINDIS;
};

#define N2HET_N2HET2_1 (*(volatile struct N2HET_N2HET2_1_tag *) 0xfff7b900)

struct HTU_1_tag
{
  uint32_t HTU_IFADDRA;
  uint32_t HTU_IFADDRB;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t IHADDR:11;
      uint64_t reservedSpace1:3;
      uint64_t TMBB:2;
      uint64_t TMBA:2;
      uint64_t ADDFM:1;
      uint64_t ADDMH:1;
      uint64_t SIZE:1;
      uint64_t DIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_IHADDRCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFTCOUNT:8;
      uint64_t reservedSpace0:8;
      uint64_t IETCOUNT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_ITCOUNT;

  uint8_t res0[240];

  uint32_t HTU_CFADDRA;
  uint32_t HTU_CFADDRB;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFTCTB:8;
      uint64_t reservedSpace0:8;
      uint64_t CFTCTA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_CFCOUNT;

  uint8_t res1[11117300];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTURES:1;
      uint64_t reservedSpace0:7;
      uint64_t DEBM:1;
      uint64_t reservedSpace1:7;
      uint64_t HTUEN:1;
      uint64_t reservedSpace2:7;
      uint64_t VBUSHOLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_GC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_CPENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY1B:1;
      uint64_t reservedSpace0:7;
      uint64_t BUSY1A:1;
      uint64_t reservedSpace1:7;
      uint64_t BUSY0B:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY0A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BUSY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY3B:1;
      uint64_t reservedSpace0:7;
      uint64_t BUSY3A:1;
      uint64_t reservedSpace1:7;
      uint64_t BUSY2B:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY2A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BUSY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY5B:1;
      uint64_t reservedSpace0:7;
      uint64_t BUSY5A:1;
      uint64_t reservedSpace1:7;
      uint64_t BUSY4B:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY4A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BUSY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY7B:1;
      uint64_t reservedSpace0:7;
      uint64_t BUSY7A:1;
      uint64_t reservedSpace1:7;
      uint64_t BUSY6B:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY6A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BUSY3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NACP:4;
      uint64_t reservedSpace0:4;
      uint64_t CETCOUNT:5;
      uint64_t reservedSpace1:1;
      uint64_t BUSBUSY:1;
      uint64_t TIPF:1;
      uint64_t ERRCPN:4;
      uint64_t reservedSpace2:4;
      uint64_t ERRETC:5;
      uint64_t reservedSpace3:2;
      uint64_t ERRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_ACPE;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RLINTENA:1;
      uint64_t reservedSpace0:7;
      uint64_t CORL:1;
      uint64_t reservedSpace1:7;
      uint64_t BERINTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_RLBECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFINTENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BFINTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFINTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BFINTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPINTMAP:16;
      uint64_t MAPSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_INTMAP;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOFF0:4;
      uint64_t reservedSpace0:4;
      uint64_t INTTYPE0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_INTOFF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOFF1:4;
      uint64_t reservedSpace0:4;
      uint64_t INTTYPE1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_INTOFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRLFL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_RLOSTFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFINTFL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BFINTFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BERINTFL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BERINTFL;

  uint32_t HTU_MP1S;
  uint32_t HTU_MP1E;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBREN:1;
      uint64_t reservedSpace0:15;
      uint64_t HTUDBGS:1;
      uint64_t reservedSpace1:7;
      uint64_t CPNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_DCTRL;

  uint32_t HTU_WPR;
  uint32_t HTU_WMR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:8;
      uint64_t TYPE:8;
      uint64_t CLASS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY_ENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
      uint64_t reservedSpace1:7;
      uint64_t COPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_PCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAOFF:9;
      uint64_t reservedSpace0:7;
      uint64_t PEFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_PAR;

