iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res5[4];

  uint32_t RTIDWDCTRL;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DWDPRLD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIDWDPRLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DWD:1;
      uint64_t KEY:1;
      uint64_t START:1;
      uint64_t END:1;
      uint64_t DWWD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIWDSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIWDKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DWDCNTR:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIDWDCNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WWDRXN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIWWDRXNCTRL;

  uint32_t RTIWWDSIZECTRL;
};

#define RTI_1 (*(volatile struct RTI_1_tag *) 0xfffffc00)

struct CRC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_PSA_SWREST:1;
      uint64_t reservedSpace0:7;
      uint64_t CH2_PSA_SWREST:1;
      uint64_t reservedSpace1:7;
      uint64_t CH3_PSA_SWREST:1;
      uint64_t reservedSpace2:7;
      uint64_t CH4_PSA_SWREST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CTRL0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CTRL1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_MODE:1;
      uint64_t reservedSpace0:3;
      uint64_t CH1_TRACEEN:1;
      uint64_t reservedSpace1:3;
      uint64_t CH2_MODE:1;
      uint64_t reservedSpace2:7;
      uint64_t CH3_MODE:1;
      uint64_t reservedSpace3:7;
      uint64_t CH4_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CTRL2;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_CCITENS:1;
      uint64_t CH1_CRCFAILENS:1;
      uint64_t CH1_OVERENS:1;
      uint64_t CH1_UNDERENS:1;
      uint64_t CH1_TIMEOUTENS:1;
      uint64_t reservedSpace0:3;
      uint64_t CH2_CCITENS:1;
      uint64_t CH2_CRCFAILENS:1;
      uint64_t CH2_OVERENS:1;
      uint64_t CH2_UNDERENS:1;
      uint64_t CH2_TIMEOUTENS:1;
      uint64_t reservedSpace1:3;
      uint64_t CH3_CCITENS:1;
      uint64_t CH3_CRCFAILENS:1;
      uint64_t CH3_OVERENS:1;
      uint64_t CH3_UNDERENS:1;
      uint64_t CH3_TIMEOUTENS:1;
      uint64_t reservedSpace2:3;
      uint64_t CH4_CCITENS:1;
      uint64_t CH4_CRCFAILENS:1;
      uint64_t CH4_OVERENS:1;
      uint64_t CH4_UNDERENS:1;
      uint64_t CH4_TIMEOUTENS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_INTS;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_CCITENR:1;
      uint64_t CH1_CRCFAILENR:1;
      uint64_t CH1_OVERENR:1;
      uint64_t CH1_UNDERENR:1;
      uint64_t CH1_TIMEOUTENR:1;
      uint64_t reservedSpace0:3;
      uint64_t CH2_CCITENR:1;
      uint64_t CH2_CRCFAILENR:1;
      uint64_t CH2_OVERENR:1;
      uint64_t CH2_UNDERENR:1;
      uint64_t CH2_TIMEOUTENR:1;
      uint64_t reservedSpace1:3;
      uint64_t CH3_CCITENR:1;
      uint64_t CH3_CRCFAILENR:1;
      uint64_t CH3_OVERENR:1;
      uint64_t CH3_UNDERENR:1;
      uint64_t CH3_TIMEOUTENR:1;
      uint64_t reservedSpace2:3;
      uint64_t CH4_CCITENR:1;
      uint64_t CH4_CRCFAILENR:1;
      uint64_t CH4_OVERENR:1;
      uint64_t CH4_UNDERENR:1;
      uint64_t CH4_TIMEOUTENR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_INTR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_CCIT:1;
      uint64_t CH1_CRCFAIL:1;
      uint64_t CH1_OVER:1;
      uint64_t CH1_UNDER:1;
      uint64_t CH1_TIMEOUT:1;
      uint64_t reservedSpace0:3;
      uint64_t CH2_CCIT:1;
      uint64_t CH2_CRCFAIL:1;
      uint64_t CH2_OVER:1;
      uint64_t CH2_UNDER:1;
      uint64_t CH2_TIMEOUT:1;
      uint64_t reservedSpace1:3;
      uint64_t CH3_CCIT:1;
      uint64_t CH3_CRCFAIL:1;
      uint64_t CH3_OVER:1;
      uint64_t CH3_UNDER:1;
      uint64_t CH3_TIMEOUT:1;
      uint64_t reservedSpace2:3;
      uint64_t CH4_CCIT:1;
      uint64_t CH4_CRCFAIL:1;
      uint64_t CH4_OVER:1;
      uint64_t CH4_UNDER:1;
      uint64_t CH4_TIMEOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_STATUS;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFSTREG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_INT_OFFSET_REG;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_BUSY:1;
      uint64_t reservedSpace0:7;
      uint64_t CH2_BUSY:1;
      uint64_t reservedSpace1:7;
      uint64_t CH3_BUSY:1;
      uint64_t reservedSpace2:7;
      uint64_t CH4_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BUSY;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_PAT_COUNT1:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_PCOUNT_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SEC_COUNT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_SCOUNT_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_CURSEC1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CURSEC_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_WDTOPLD1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_WDTOPLD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_BCTCPLD1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BCTOPLD1;

  uint8_t res8[12];

  uint32_t PSA_SIGREGL1;
  uint32_t PSA_SIGREGH1;
  uint32_t CRC_REGL1;
  uint32_t PSA_REGH1;
  uint32_t PSA_SECSIGREGL1;
  uint32_t PSA_SECSIGREGH1;
  uint32_t RAW_DATAREGL1;
  uint32_t RAW_DATAREGH1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_PAT_COUNT2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_PCOUNT_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SEC_COUNT2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_SCOUNT_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_CURSEC2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CURSEC_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_WDTOPLD2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_WDTOPLD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_BCTCPLD2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BCTOPLD2;

  uint8_t res9[12];

