iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define DMM_1 (*(volatile struct DMM_1_tag *) 0xfffff700)

struct RTP_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ONOFF:4;
      uint64_t INV_RGN:1;
      uint64_t HOVF:1;
      uint64_t CONTCLK:1;
      uint64_t RESET:1;
      uint64_t PW:2;
      uint64_t TM_DDM:1;
      uint64_t DDM_RW:1;
      uint64_t DDM_WIDTH:2;
      uint64_t reservedSpace0:2;
      uint64_t PRESCALER:3;
      uint64_t reservedSpace1:5;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPGLBCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA1:1;
      uint64_t reservedSpace0:7;
      uint64_t ENA2:1;
      uint64_t reservedSpace1:15;
      uint64_t ENA4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPTRENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVF1:1;
      uint64_t OVF2:1;
      uint64_t reservedSpace0:1;
      uint64_t OVFPER:1;
      uint64_t reservedSpace1:4;
      uint64_t EMPTY1:1;
      uint64_t EMPTY2:1;
      uint64_t reservedSpace2:1;
      uint64_t EMPTYPER:1;
      uint64_t EMPTYSER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPGSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:18;
      uint64_t reservedSpace0:6;
      uint64_t BLOCKSIZE:4;
      uint64_t RW:1;
      uint64_t CPU_DMA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPRAM1REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:18;
      uint64_t reservedSpace0:6;
      uint64_t BLOCKSIZE:4;
      uint64_t RW:1;
      uint64_t CPU_DMA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPRAM1REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:18;
      uint64_t reservedSpace0:6;
      uint64_t BLOCKSIZE:4;
      uint64_t RW:1;
      uint64_t CPU_DMA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPRAM2REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:18;
      uint64_t reservedSpace0:6;
      uint64_t BLOCKSIZE:4;
      uint64_t RW:1;
      uint64_t CPU_DMA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPRAM2REG2;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:24;
      uint64_t BLOCKSIZE:4;
      uint64_t RW:1;
      uint64_t CPU_DMA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPERREG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:24;
      uint64_t BLOCKSIZE:4;
      uint64_t RW:1;
      uint64_t CPU_DMA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPERREG2;

  uint32_t RTPDDMW;
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAFUNC:16;
      uint64_t SYNCFUNC:1;
      uint64_t CLKFUNC:1;
      uint64_t ENAFUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATADIR:16;
      uint64_t SYNCDIR:1;
      uint64_t CLKDIR:1;
      uint64_t ENADIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAIN:16;
      uint64_t SYNCIN:1;
      uint64_t CLKIN:1;
      uint64_t ENAIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAOUT:16;
      uint64_t SYNCOUT:1;
      uint64_t CLKOUT:1;
      uint64_t ENAOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATASET:16;
      uint64_t SYNCSET:1;
      uint64_t CLKSET:1;
      uint64_t ENASET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATACLR:16;
      uint64_t SYNCCLR:1;
      uint64_t CLKCLR:1;
      uint64_t ENACLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAPDR:16;
      uint64_t SYNCPDR:1;
      uint64_t CLKPDR:1;
      uint64_t ENAPDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATADIS:16;
      uint64_t SYNCDIS:1;
      uint64_t CLKDIS:1;
      uint64_t ENADIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAPSEL:16;
      uint64_t SYNCPSEL:1;
      uint64_t CLKPSEL:1;
      uint64_t ENAPSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTPPC8;

};

#define RTP_1 (*(volatile struct RTP_1_tag *) 0xfffffa00)

struct SPR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSIZE:11;
      uint64_t CNWAY:8;
      uint64_t CPA:1;
      uint64_t CLA:1;
      uint64_t CREPL:2;
      uint64_t CBSIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t CFIWA:1;
      uint64_t CFAHA:1;
      uint64_t CWPA:1;
      uint64_t CARCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CFG0;

};

#define SPR_0 (*(volatile struct SPR_0_tag *) 0x203)

struct SPR_1_tag
{
  uint32_t BUCSR;
};

#define SPR_1 (*(volatile struct SPR_1_tag *) 0x3f5)

struct SPR_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Process_ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID0;

  uint8_t res0[963];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAVN:2;
      uint64_t NTLBS:2;
      uint64_t reservedSpace0:2;
      uint64_t PIDSIZE:5;
      uint64_t NPIDS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMUCFG0;

};

#define SPR_2 (*(volatile struct SPR_2_tag *) 0x30)

struct Supervisor_Mode_SPRs_SPR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Process_ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID0;

  uint8_t res0[963];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAVN:2;
      uint64_t NTLBS:2;
      uint64_t reservedSpace0:2;
      uint64_t PIDSIZE:5;
      uint64_t NPIDS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMUCFG0;

