iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define Supervisor_Mode_SPRs_SPR_0 (*(volatile struct Supervisor_Mode_SPRs_SPR_0_tag *) 0x30)

struct Supervisor_Mode_SPRs_SPR_1_tag
{
  uint32_t BUCSR;
};

#define Supervisor_Mode_SPRs_SPR_1 (*(volatile struct Supervisor_Mode_SPRs_SPR_1_tag *) 0x3f5)

struct Supervisor_Mode_SPRs_SPR_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSIZE:11;
      uint64_t CNWAY:8;
      uint64_t CPA:1;
      uint64_t CLA:1;
      uint64_t CREPL:2;
      uint64_t CBSIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t CFIWA:1;
      uint64_t CFAHA:1;
      uint64_t CWPA:1;
      uint64_t CARCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CFG0;

};

#define Supervisor_Mode_SPRs_SPR_2 (*(volatile struct Supervisor_Mode_SPRs_SPR_2_tag *) 0x203)

struct Flash_Memory_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHV:1;
      uint64_t ESUS:1;
      uint64_t ERS:1;
      uint64_t PSUS:1;
      uint64_t PGM:1;
      uint64_t reservedSpace0:4;
      uint64_t PEG:1;
      uint64_t DONE:1;
      uint64_t PEAS:1;
      uint64_t reservedSpace1:2;
      uint64_t RWE:1;
      uint64_t EER:1;
      uint64_t MAS:1;
      uint64_t reservedSpace2:3;
      uint64_t LAS:3;
      uint64_t reservedSpace3:1;
      uint64_t SIZE:3;
      uint64_t reservedSpace4:4;
      uint64_t EDC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH0_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LLK:16;
      uint64_t MLK:2;
      uint64_t reservedSpace0:2;
      uint64_t TSLK:1;
      uint64_t reservedSpace1:10;
      uint64_t LME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH0_LML;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HLK:12;
      uint64_t reservedSpace0:19;
      uint64_t HBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH0_HBL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLK:16;
      uint64_t SMK:2;
      uint64_t reservedSpace0:2;
      uint64_t STSLK:1;
      uint64_t reservedSpace1:10;
      uint64_t SLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH0_SLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSL:16;
      uint64_t MSL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH0_LMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH0_HBS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDR:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH0_ADR;

  uint32_t CFLASH0_BIU0;
  uint32_t CFLASH0_BIU1;
  uint32_t CFLASH0_BIU2;
  uint32_t CFLASH0_BIU3;
  uint32_t CFLASH0_BIU4;
  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AID:1;
      uint64_t AIE:1;
      uint64_t AIS:1;
      uint64_t EIE:1;
      uint64_t MRV:1;
      uint64_t MRE:1;
      uint64_t reservedSpace0:10;
      uint64_t DSI:8;
      uint64_t reservedSpace1:7;
      uint64_t UTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH0_UT0;

  uint32_t CFLASH0_UT1;
  uint32_t CFLASH0_UT2;
  uint32_t CFLASH0_UMISR0;
  uint32_t CFLASH0_UMISR1;
  uint32_t CFLASH0_UMISR2;
  uint32_t CFLASH0_UMISR3;
  uint32_t CFLASH0_UMISR4;
  uint8_t res1[16292];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHV:1;
      uint64_t ESUS:1;
      uint64_t ERS:1;
      uint64_t PSUS:1;
      uint64_t PGM:1;
      uint64_t reservedSpace0:4;
      uint64_t PEG:1;
      uint64_t DONE:1;
      uint64_t PEAS:1;
      uint64_t reservedSpace1:2;
      uint64_t RWE:1;
      uint64_t EER:1;
      uint64_t MAS:1;
      uint64_t reservedSpace2:3;
      uint64_t LAS:3;
      uint64_t reservedSpace3:1;
      uint64_t SIZE:3;
      uint64_t reservedSpace4:4;
      uint64_t EDC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFLASH0_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LLK:16;
      uint64_t MLK:2;
      uint64_t reservedSpace0:2;
      uint64_t TSLK:1;
      uint64_t reservedSpace1:10;
      uint64_t LME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFLASH0_LML;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HLK:12;
      uint64_t reservedSpace0:19;
      uint64_t HBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFLASH0_HBL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLK:16;
      uint64_t SMK:2;
      uint64_t reservedSpace0:2;
      uint64_t STSLK:1;
      uint64_t reservedSpace1:10;
      uint64_t SLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFLASH0_SLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSL:16;
      uint64_t MSL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFLASH0_LMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFLASH0_HBS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDR:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFLASH0_ADR;

  uint32_t DFLASH0_BIU0;
  uint32_t DFLASH0_BIU1;
  uint32_t DFLASH0_BIU2;
  uint32_t DFLASH0_BIU3;
  uint32_t DFLASH0_BIU4;
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AID:1;
      uint64_t AIE:1;
      uint64_t AIS:1;
      uint64_t EIE:1;
      uint64_t MRV:1;
      uint64_t MRE:1;
      uint64_t reservedSpace0:10;
      uint64_t DSI:8;
      uint64_t reservedSpace1:7;
      uint64_t UTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFLASH0_UT0;

  uint32_t DFLASH0_UT1;
  uint32_t DFLASH0_UT2;
  uint32_t DFLASH0_UMISR0;
  uint32_t DFLASH0_UMISR1;
  uint32_t DFLASH0_UMISR2;
  uint32_t DFLASH0_UMISR3;
  uint32_t DFLASH0_UMISR4;
  uint8_t res3[147364];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHV:1;
      uint64_t ESUS:1;
      uint64_t ERS:1;
      uint64_t PSUS:1;
      uint64_t PGM:1;
      uint64_t reservedSpace0:4;
      uint64_t PEG:1;
      uint64_t DONE:1;
      uint64_t PEAS:1;
      uint64_t reservedSpace1:2;
      uint64_t RWE:1;
      uint64_t EER:1;
      uint64_t MAS:1;
      uint64_t reservedSpace2:3;
      uint64_t LAS:2;
      uint64_t reservedSpace3:2;
      uint64_t SIZE:3;
      uint64_t reservedSpace4:4;
      uint64_t EDC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH1_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LLK:16;
      uint64_t MLK:2;
      uint64_t reservedSpace0:2;
      uint64_t TSLK:1;
      uint64_t reservedSpace1:10;
      uint64_t LME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH1_LML;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HLK:1;
      uint64_t reservedSpace0:30;
      uint64_t HBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH1_HBL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLK:1;
      uint64_t reservedSpace0:15;
      uint64_t SMK:2;
      uint64_t reservedSpace1:2;
      uint64_t STSLK:1;
      uint64_t reservedSpace2:10;
      uint64_t SLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH1_SLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MSL:2;
      uint64_t reservedSpace1:4;
      uint64_t LSL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH1_LMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH1_HBS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDR:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH1_ADR;

  uint32_t CFLASH1_BIU0;
  uint32_t CFLASH1_BIU1;
  uint32_t CFLASH1_BIU2;
  uint32_t CFLASH1_BIU3;
  uint32_t CFLASH1_BIU4;
  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AID:1;
      uint64_t AIE:1;
      uint64_t AIS:1;
      uint64_t EIE:1;
      uint64_t MRV:1;
      uint64_t MRE:1;
      uint64_t reservedSpace0:10;
      uint64_t DSI:8;
      uint64_t reservedSpace1:7;
      uint64_t UTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFLASH1_UT0;

