iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint32_t CFLASH1_UT1;
  uint32_t CFLASH1_UT2;
  uint32_t CFLASH1_UM0;
  uint32_t CFLASH1_UM1;
  uint32_t CFLASH1_UM2;
  uint32_t CFLASH1_UM3;
  uint32_t CFLASH1_UM4;
};

#define Flash_Memory_0 (*(volatile struct Flash_Memory_0_tag *) 0xc3f88000)

struct Platform_Flash_Controller_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_P0_BFE:1;
      uint64_t B0_P0_PFLM:2;
      uint64_t B0_P0_IPFE:1;
      uint64_t B0_P0_DPFE:1;
      uint64_t B0_P0_BCFG:2;
      uint64_t B0_RWWC:1;
      uint64_t B0_P1_BFE:1;
      uint64_t B0_P1_PFLM:2;
      uint64_t B0_P1_IPFE:1;
      uint64_t B0_P1_DPFE:1;
      uint64_t B0_P1_BCFG:2;
      uint64_t BK0_RWWC:2;
      uint64_t BK0_RWSC:5;
      uint64_t BK0_WWSC:5;
      uint64_t BK0_APC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B1_P0_BFE:1;
      uint64_t reservedSpace0:6;
      uint64_t BK1_RWWC_0:1;
      uint64_t B1_P1_BFE:1;
      uint64_t reservedSpace1:6;
      uint64_t BK1_RWWC_1:2;
      uint64_t BK1_RWSC:5;
      uint64_t BK1_WWSC:5;
      uint64_t BK1_APC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0AP:2;
      uint64_t M1AP:2;
      uint64_t M2AP:2;
      uint64_t M3AP:2;
      uint64_t M4AP:2;
      uint64_t M5AP:2;
      uint64_t M6AP:2;
      uint64_t M7AP:2;
      uint64_t MPFD:8;
      uint64_t ARBM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFAPR;

};

#define Platform_Flash_Controller_0 (*(volatile struct Platform_Flash_Controller_0_tag *) 0xffe8801c)

struct RGM_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t F_JTAG:1;
      uint64_t F_CORE:1;
      uint64_t F_SOFT:1;
      uint64_t F_CHKSTOP:1;
      uint64_t F_FMPLL:1;
      uint64_t F_CMU_OLR:1;
      uint64_t F_CMU_FHL:1;
      uint64_t F_LVD45:1;
      uint64_t F_FLASH:1;
      uint64_t reservedSpace0:6;
      uint64_t F_EXR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_FES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t F_LVD12_PD0:1;
      uint64_t F_LVD12_PD1:1;
      uint64_t F_SWT:1;
      uint64_t F_LVD27:1;
      uint64_t F_LVD27_VREG:1;
      uint64_t reservedSpace0:10;
      uint64_t F_POR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_DES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t D_JTAG:1;
      uint64_t D_CORE:1;
      uint64_t D_SOFT:1;
      uint64_t D_CHKSTOP:1;
      uint64_t D_FMPLL:1;
      uint64_t D_CMU_OLR:1;
      uint64_t D_CMU_FHL:1;
      uint64_t D_LVD45:1;
      uint64_t D_FLASH:1;
      uint64_t reservedSpace0:6;
      uint64_t D_EXR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_FERD;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t D_LVD12_PD0:1;
      uint64_t D_LVD12_PD1:1;
      uint64_t D_SWT:1;
      uint64_t D_LVD27:1;
      uint64_t D_LVD27_VREG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_DERD;

  uint8_t res0[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AR_JTAG:1;
      uint64_t AR_CORE:1;
      uint64_t AR_SOFT:1;
      uint64_t AR_CHKSTOP:1;
      uint64_t AR_FMPLL:1;
      uint64_t AR_CMU_OLR:1;
      uint64_t AR_CMU_FHL:1;
      uint64_t AR_LVD45:1;
      uint64_t AR_FLASH:1;
      uint64_t reservedSpace0:6;
      uint64_t AR_EXR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_FEAR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AR_LVD12_PD0:1;
      uint64_t AR_LVD12_PD1:1;
      uint64_t AR_SWT:1;
      uint64_t AR_LVD27:1;
      uint64_t AR_LVD27_VREG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_DEAR;

  uint8_t res1[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SS_JTAG:1;
      uint64_t SS_CORE:1;
      uint64_t SS_SOFT:1;
      uint64_t SS_CHKSTOP:1;
      uint64_t SS_FMPLL:1;
      uint64_t SS_CMU_OLR:1;
      uint64_t SS_CMU_FHL:1;
      uint64_t SS_LVD45:1;
      uint64_t SS_FLASH:1;
      uint64_t reservedSpace0:6;
      uint64_t SS_EXR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_FESS;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t BOOT_FROM_BKP_RAM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_STDBY;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BE_JTAG:1;
      uint64_t BE_CORE:1;
      uint64_t BE_SOFT:1;
      uint64_t BE_CHKSTOP:1;
      uint64_t BE_FMPLL:1;
      uint64_t BE_CMU_OLR:1;
      uint64_t BE_CMU_FHL:1;
      uint64_t BE_LVD45:1;
      uint64_t BE_FLASH:1;
      uint64_t reservedSpace0:6;
      uint64_t BE_EXR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RGM_FBRE;

};

#define RGM_0 (*(volatile struct RGM_0_tag *) 0xc3fe4000)

struct CGM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGM_OC_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
      uint64_t SELDIV:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGM_OCDS_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGM_SC_SS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIV0:4;
      uint64_t reservedSpace0:3;
      uint64_t DE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CGM_SC_DC0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIV1:4;
      uint64_t reservedSpace0:3;
      uint64_t DE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CGM_SC_DC1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIV2:4;
      uint64_t reservedSpace0:3;
      uint64_t DE2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CGM_SC_DC2;

