iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR54;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR55;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR56;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR57;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR58;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR59;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR60;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR61;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR62;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR63;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR64;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR65;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR66;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR67;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR68;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR69;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR70;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR71;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR72;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR73;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR74;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR75;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR76;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR77;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR78;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR79;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR80;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR81;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR82;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR83;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR84;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR85;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR86;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR87;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR88;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR89;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR90;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR91;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR92;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR93;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR94;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR95;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR96;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR97;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR98;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR99;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR100;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR101;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR102;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR103;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR104;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR105;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR106;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR107;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR108;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR109;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR110;

