iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI83:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI82:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI81:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI80:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI80_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI87:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI86:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI85:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI84:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI84_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI91:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI90:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI89:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI88:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI88_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI95:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI94:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI93:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI92:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI92_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI99:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI98:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI97:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI96:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI96_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI103:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI102:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI101:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI100:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI100_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI107:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI106:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI105:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI104:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI104_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI111:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI110:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI109:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI108:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI108_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI115:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI114:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI113:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI112:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI112_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI119:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI118:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI117:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI116:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI116_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI123:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI122:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI121:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI120:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI120_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI127:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI126:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI125:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI124:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI124_127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI131:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI130:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI129:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI128:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI128_131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI135:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI134:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI133:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI132:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI132_135;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI139:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI138:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI137:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI136:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI136_139;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI143:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI142:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI141:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI140:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI140_143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI147:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI146:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI145:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI144:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI144_147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI151:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI150:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI149:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI148:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI148_151;

  uint8_t res6[872];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDO1:16;
      uint64_t PPDO0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDO3:16;
      uint64_t PPDO2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDO5:16;
      uint64_t PPDO4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDO7:16;
      uint64_t PPDO6:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDO9:16;
      uint64_t PPDO8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDO4;

  uint8_t res7[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDI1:16;
      uint64_t PPDI0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDI3:16;
      uint64_t PPDI2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDI5:16;
      uint64_t PPDI4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDI2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDI7:16;
      uint64_t PPDI6:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDI3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPDI9:16;
      uint64_t PPDI8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGPDI4;

  uint8_t res8[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:16;
      uint64_t MASK0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO1:16;
      uint64_t MASK1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO2:16;
      uint64_t MASK2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO3:16;
      uint64_t MASK3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO4:16;
      uint64_t MASK4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO5:16;
      uint64_t MASK5:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO6:16;
      uint64_t MASK6:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO7:16;
      uint64_t MASK7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO8:16;
      uint64_t MASK8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO9:16;
      uint64_t MASK9:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO9;

  uint8_t res9[856];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT5:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT6:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT8:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT9:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT10:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT11:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT12:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT13:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT14:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT16:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT17:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT18:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT19:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT20:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT21:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT22:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT23:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMC23;

