iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint32_t ADC0_PSR0;
  uint32_t ADC0_PSR1;
  uint32_t ADC0_PSR2;
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
      uint64_t reservedSpace0:1;
      uint64_t INPCMP:2;
      uint64_t reservedSpace1:1;
      uint64_t OFFSHIFT:2;
      uint64_t reservedSpace2:1;
      uint64_t INPLATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
      uint64_t reservedSpace0:1;
      uint64_t INPCMP:2;
      uint64_t reservedSpace1:1;
      uint64_t OFFSHIFT:2;
      uint64_t reservedSpace2:1;
      uint64_t INPLATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
      uint64_t reservedSpace0:1;
      uint64_t INPCMP:2;
      uint64_t reservedSpace1:1;
      uint64_t OFFSHIFT:2;
      uint64_t reservedSpace2:1;
      uint64_t INPLATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CTR2;

  uint8_t res5[4];

  uint32_t ADC0_NCMR0;
  uint32_t ADC0_NCMR1;
  uint32_t ADC0_NCMR2;
  uint8_t res6[4];

  uint32_t ADC0_JCMR0;
  uint32_t ADC0_JCMR1;
  uint32_t ADC0_JCMR2;
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_DSDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_PDEDR;

  uint8_t res8[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR15;

  uint8_t res9[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR59;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:10;
      uint64_t CDATA:16;
      uint64_t CDATA_R:10;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CDR95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:10;
      uint64_t reservedSpace0:6;
      uint64_t THRH:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_THRHLR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:10;
      uint64_t reservedSpace0:6;
      uint64_t THRH:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_THRHLR5;

  uint8_t res11[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH0:4;
      uint64_t WSEL_CH1:4;
      uint64_t WSEL_CH2:4;
      uint64_t WSEL_CH3:4;
      uint64_t WSEL_CH4:4;
      uint64_t WSEL_CH5:4;
      uint64_t WSEL_CH6:4;
      uint64_t WSEL_CH7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CWSELR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH0:4;
      uint64_t WSEL_CH1:4;
      uint64_t WSEL_CH2:4;
      uint64_t WSEL_CH3:4;
      uint64_t WSEL_CH4:4;
      uint64_t WSEL_CH5:4;
      uint64_t WSEL_CH6:4;
      uint64_t WSEL_CH7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CWSELR1;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH0:4;
      uint64_t WSEL_CH1:4;
      uint64_t WSEL_CH2:4;
      uint64_t WSEL_CH3:4;
      uint64_t WSEL_CH4:4;
      uint64_t WSEL_CH5:4;
      uint64_t WSEL_CH6:4;
      uint64_t WSEL_CH7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CWSELR4;

