iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint32_t ADC1_NCMR0;
  uint32_t ADC1_NCMR1;
  uint8_t res23[8];

  uint32_t ADC1_JCMR0;
  uint32_t ADC1_JCMR1;
  uint8_t res24[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_PDEDR;

  uint8_t res25[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR15;

  uint8_t res26[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA_L:12;
      uint64_t CDATA:16;
      uint64_t CDATA_R:12;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CDR39;

