iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI5_RXFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI5_RXFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI5_RXFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI5_RXFR3;

};

#define DSPI_DSPI_5 (*(volatile struct DSPI_DSPI_5_tag *) 0xfffa4000)

struct CANS_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAN_SMPLR_EN:1;
      uint64_t BRP:5;
      uint64_t CAN_RX_SEL:3;
      uint64_t Mode:1;
      uint64_t reservedSpace0:3;
      uint64_t Active_CK:1;
      uint64_t BUSY:1;
      uint64_t RX_COMPLETE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CANS_CR;

  uint32_t CAN_SR0;
  uint32_t CAN_SR1;
  uint32_t CAN_SR2;
  uint32_t CAN_SR3;
  uint32_t CAN_SR4;
  uint32_t CAN_SR5;
  uint32_t CAN_SR6;
  uint32_t CAN_SR7;
  uint32_t CAN_SR8;
  uint32_t CAN_SR9;
  uint32_t CAN_SR10;
  uint32_t CAN_SR11;
};

#define CANS_0 (*(volatile struct CANS_0_tag *) 0xffe70000)

struct I2C_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBAD;

  uint8_t IBFD;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t IBDOZE:1;
      uint64_t DMEAN:1;
      uint64_t RSTA:1;
      uint64_t NOACK:1;
      uint64_t TxRx:1;
      uint64_t MSSL:1;
      uint64_t IBIE:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXAK:1;
      uint64_t IBIF:1;
      uint64_t SRW:1;
      uint64_t reservedSpace0:1;
      uint64_t IBAL:1;
      uint64_t IBB:1;
      uint64_t IAAS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBSR;

  uint8_t IBDR;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t BIIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBIC;

};

#define I2C_0 (*(volatile struct I2C_0_tag *) 0xffe30000)

struct PIT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PITMCR;

  uint8_t res0[252];

  uint32_t LDVAL0;
  uint32_t CVAL0;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG0;

  uint32_t LDVAL1;
  uint32_t CVAL1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG1;

  uint32_t LDVAL2;
  uint32_t CVAL2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG2;

  uint32_t LDVAL3;
  uint32_t CVAL3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG3;

  uint32_t LDVAL4;
  uint32_t CVAL4;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG4;

  uint32_t LDVAL5;
  uint32_t CVAL5;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG5;

  uint32_t LDVAL6;
  uint32_t CVAL6;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG6;

  uint32_t LDVAL7;
  uint32_t CVAL7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG7;

};

#define PIT_0 (*(volatile struct PIT_0_tag *) 0xc3ff0000)

struct CTU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t TRGI:1;
      uint64_t TRGIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_CSR;

  uint8_t res0[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR60;

