iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL:1;
      uint64_t reservedSpace1:5;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTU_EVTCFGR63;

};

#define CTU_0 (*(volatile struct CTU_0_tag *) 0xffe64000)

struct LINFlex_LINFlex_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t SLEEP:1;
      uint64_t RBLM:1;
      uint64_t SBDT:1;
      uint64_t MME:1;
      uint64_t LBKM:1;
      uint64_t SFTM:1;
      uint64_t BF:1;
      uint64_t MBL:4;
      uint64_t AWUM:1;
      uint64_t LASE:1;
      uint64_t CFD:1;
      uint64_t CCD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRIE:1;
      uint64_t DTIE:1;
      uint64_t DRIE:1;
      uint64_t DBEIE:1;
      uint64_t DBFIE:1;
      uint64_t WUIE:1;
      uint64_t LSIE:1;
      uint64_t BOIE:1;
      uint64_t FEIE:1;
      uint64_t reservedSpace0:2;
      uint64_t HEIE:1;
      uint64_t CEIE:1;
      uint64_t BEIE:1;
      uint64_t OCIE:1;
      uint64_t SZIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRF:1;
      uint64_t DTF:1;
      uint64_t DRF:1;
      uint64_t DBEF:1;
      uint64_t DBFF:1;
      uint64_t WUF:1;
      uint64_t RPS:1;
      uint64_t RBSY:1;
      uint64_t reservedSpace0:1;
      uint64_t RMB:1;
      uint64_t reservedSpace1:2;
      uint64_t LINS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NF:1;
      uint64_t reservedSpace0:6;
      uint64_t BOF:1;
      uint64_t FEF:1;
      uint64_t IDPEF:1;
      uint64_t BDEF:1;
      uint64_t SFEF:1;
      uint64_t CEF:1;
      uint64_t BEF:1;
      uint64_t OCF:1;
      uint64_t SZF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART:1;
      uint64_t WL:1;
      uint64_t PCE:1;
      uint64_t OP:1;
      uint64_t TXEN:1;
      uint64_t RXEN:1;
      uint64_t reservedSpace0:4;
      uint64_t RDFL:2;
      uint64_t reservedSpace1:1;
      uint64_t TDFL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_UARTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NF:1;
      uint64_t DTF:1;
      uint64_t DRF:1;
      uint64_t reservedSpace0:2;
      uint64_t WUF:1;
      uint64_t RPS:1;
      uint64_t BOF:1;
      uint64_t FEF:1;
      uint64_t RMB:1;
      uint64_t PE:4;
      uint64_t OCF:1;
      uint64_t SZF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_UARTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:8;
      uint64_t TOCE:1;
      uint64_t IOT:1;
      uint64_t LTOM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINTCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OC1:8;
      uint64_t OC2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTO:7;
      uint64_t reservedSpace0:1;
      uint64_t RTO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINTOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_F:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINFBRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_M:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINIBRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HTRQ:1;
      uint64_t ABRQ:1;
      uint64_t DTRQ:1;
      uint64_t DDRQ:1;
      uint64_t WURQ:1;
      uint64_t IOPE:1;
      uint64_t IOBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_LINCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_BIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:8;
      uint64_t DATA1:8;
      uint64_t DATA2:8;
      uint64_t DATA3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_BDRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA4:8;
      uint64_t DATA5:8;
      uint64_t DATA6:8;
      uint64_t DATA7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_BDRM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FACT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFMI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFMI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex2_IFCR15;

