iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDACEN:4;
      uint64_t EZCV:1;
      uint64_t EOCV:1;
      uint64_t reservedSpace0:2;
      uint64_t EPEN:1;
      uint64_t EZFEN:1;
      uint64_t reservedSpace1:6;
      uint64_t EDACMODE:3;
      uint64_t reservedSpace2:5;
      uint64_t SUSP_IGNR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEDACCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_THRESHOLD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEDACCTRL2;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t UNC_ERR_ADD:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FUNC_ERR_ADD;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROTL1DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BSE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBSE;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VREADST:8;
      uint64_t BAGP:8;
      uint64_t OTPPROTDIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANKPWR0:2;
      uint64_t BANKPWR1:2;
      uint64_t BANKPWR2:2;
      uint64_t BANKPWR3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBFALLBACK;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PUMPPWR:1;
      uint64_t reservedSpace0:15;
      uint64_t PSLEEP:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPAC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAGP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPAC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANK:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOCK:1;
      uint64_t PSUSP:1;
      uint64_t ESUSP:1;
      uint64_t VOLTSTAT:1;
      uint64_t CSTAT:1;
      uint64_t INVDAT:1;
      uint64_t PGM:1;
      uint64_t ERS:1;
      uint64_t BUSY:1;
      uint64_t CV:1;
      uint64_t EV:1;
      uint64_t PCV:1;
      uint64_t PGV:1;
      uint64_t DBT:1;
      uint64_t ILA:1;
      uint64_t RVF:1;
      uint64_t RVDER:1;
      uint64_t RVSUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSTAT;

  uint8_t res5[560];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WR_ENA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_WR_ENA;

  uint8_t res6[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTOSTART_GRACE:8;
      uint64_t AUTOSUSP_EN:3;
      uint64_t reservedSpace0:5;
      uint64_t EWAIT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEPROM_CONFIG;

};

#define Flash_Module (*(volatile struct Flash_Module_tag *) 0xfff87000)

struct EMIF_tag
{
  uint32_t MIDR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_EXT_WAIT:8;
      uint64_t reservedSpace0:8;
      uint64_t CS2_WAIT:2;
      uint64_t CS3_WAIT:2;
      uint64_t CS4_WAIT:2;
      uint64_t CS5_WAIT:2;
      uint64_t reservedSpace1:4;
      uint64_t WP0:1;
      uint64_t WP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAGESIZE:3;
      uint64_t reservedSpace0:1;
      uint64_t IBANK:3;
      uint64_t reservedSpace1:1;
      uint64_t BIT11_9LOCK:1;
      uint64_t CL:3;
      uint64_t reservedSpace2:2;
      uint64_t NM:1;
      uint64_t reservedSpace3:14;
      uint64_t PDWR:1;
      uint64_t PD:1;
      uint64_t SR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASIZE:2;
      uint64_t TA:2;
      uint64_t R_HOLD:3;
      uint64_t R_STROBE:6;
      uint64_t R_SETUP:4;
      uint64_t W_HOLD:3;
      uint64_t W_STROBE:6;
      uint64_t W_SETUP:4;
      uint64_t reservedSpace0:1;
      uint64_t SS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CE2CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASIZE:2;
      uint64_t TA:2;
      uint64_t R_HOLD:3;
      uint64_t R_STROBE:6;
      uint64_t R_SETUP:4;
      uint64_t W_HOLD:3;
      uint64_t W_STROBE:6;
      uint64_t W_SETUP:4;
      uint64_t reservedSpace0:1;
      uint64_t SS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CE3CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASIZE:2;
      uint64_t TA:2;
      uint64_t R_HOLD:3;
      uint64_t R_STROBE:6;
      uint64_t R_SETUP:4;
      uint64_t W_HOLD:3;
      uint64_t W_STROBE:6;
      uint64_t W_SETUP:4;
      uint64_t reservedSpace0:1;
      uint64_t SS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CE4CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASIZE:2;
      uint64_t TA:2;
      uint64_t R_HOLD:3;
      uint64_t R_STROBE:6;
      uint64_t R_SETUP:4;
      uint64_t W_HOLD:3;
      uint64_t W_STROBE:6;
      uint64_t W_SETUP:4;
      uint64_t reservedSpace0:1;
      uint64_t SS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CE5CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t T_RRD:3;
      uint64_t reservedSpace1:1;
      uint64_t T_RC:4;
      uint64_t T_RAS:4;
      uint64_t T_WR:3;
      uint64_t reservedSpace2:1;
      uint64_t T_RCD:3;
      uint64_t reservedSpace3:1;
      uint64_t T_RP:3;
      uint64_t T_RFC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDTIMR;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_XS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDSRETR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AT:1;
      uint64_t LT:1;
      uint64_t WR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AT_MASKED:1;
      uint64_t LT_MASKED:1;
      uint64_t WR_MASKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AT_MASK_SET:1;
      uint64_t LT_MASK_SET:1;
      uint64_t WR_MASK_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMSKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AT_MASK_CLR:1;
      uint64_t LT_MASK_CLR:1;
      uint64_t WR_MASK_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMSKCLR;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS2_PG_MD_EN:1;
      uint64_t CS2_PG_SIZE:1;
      uint64_t CS2_PG_DEL:6;
      uint64_t CS3_PG_MD_EN:1;
      uint64_t CS3_PG_SIZE:1;
      uint64_t CS3_PG_DEL:6;
      uint64_t CS4_PG_MD_EN:1;
      uint64_t CS4_PG_SIZE:1;
      uint64_t CS4_PG_DEL:6;
      uint64_t CS5_PG_MD_EN:1;
      uint64_t CS5_PG_SIZE:1;
      uint64_t CS5_PG_DEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMCR;

