iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAST_CONV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER7;

  uint32_t ADEVEMUBUFFER;
  uint32_t ADG1EMUBUFFER;
  uint32_t ADG2EMUBUFFER;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_DIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_PDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_PDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTPDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_PSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTPSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_SAMP_DIS_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t EV_SAMP_DIS_CYC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSAMPDISEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_SAMP_DIS_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t G1_SAMP_DIS_CYC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SAMPDISEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_SAMP_DIS_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t G2_SAMP_DIS_CYC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SAMPDISEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_CHID:5;
      uint64_t reservedSpace0:3;
      uint64_t COMP_CHID:5;
      uint64_t reservedSpace1:1;
      uint64_t CMP_GELT:1;
      uint64_t CHNTHR_COMP:1;
      uint64_t MAG_THR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINT0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAG0MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_CHID:5;
      uint64_t reservedSpace0:3;
      uint64_t COMP_CHID:5;
      uint64_t reservedSpace1:1;
      uint64_t CMP_GELT:1;
      uint64_t CHNTHR_COMP:1;
      uint64_t MAG_THR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINT1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG1_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAG1MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_CHID:5;
      uint64_t reservedSpace0:3;
      uint64_t COMP_CHID:5;
      uint64_t reservedSpace1:1;
      uint64_t CMP_GELT:1;
      uint64_t CHNTHR_COMP:1;
      uint64_t MAG_THR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINT2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG2_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAG2MASK;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_INT_ENA_SET:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINTENASET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_INT_ENA_CLR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINTENACLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_INT_FLG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_INT_OFF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINTOFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_FIFO_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVFIFORESETCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_FIFO_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1FIFORESETCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_FIFO_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2FIFORESETCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_RAM_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVRAMWRADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_RAM_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1RAMWRADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_RAM_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2RAMWRADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY_ENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPARCR;

  uint32_t ADPARADDR;
};

#define ADC_ADC0 (*(volatile struct ADC_ADC0_tag *) 0xfff7c000)

struct DCAN_DCAN1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Init:1;
      uint64_t IE0:1;
      uint64_t SIE:1;
      uint64_t EIE:1;
      uint64_t reservedSpace0:1;
      uint64_t DAR:1;
      uint64_t CCE:1;
      uint64_t Test:1;
      uint64_t IDS:1;
      uint64_t ABO:1;
      uint64_t PMD:4;
      uint64_t reservedSpace1:1;
      uint64_t SWR:1;
      uint64_t InitDbg:1;
      uint64_t IE1:1;
      uint64_t DE1:1;
      uint64_t DE2:1;
      uint64_t DE3:1;
      uint64_t reservedSpace2:3;
      uint64_t PDR:1;
      uint64_t WUBA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TxOk:1;
      uint64_t RxOk:1;
      uint64_t EPass:1;
      uint64_t EWarn:1;
      uint64_t BOff:1;
      uint64_t PER:1;
      uint64_t WakeUp_Pnd:1;
      uint64_t PDA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_ES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEC:8;
      uint64_t REC:7;
      uint64_t RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_ERRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSeg1:4;
      uint64_t TSeg2:3;
      uint64_t reservedSpace0:1;
      uint64_t BRPE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_BTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntID:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t Silent:1;
      uint64_t LBack:1;
      uint64_t Tx:2;
      uint64_t Rx:1;
      uint64_t EXL:1;
      uint64_t RDA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TEST;

