iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res1[4];

  uint32_t HETDIR;
  uint32_t HETDIN;
  uint32_t HETDOUT;
  uint32_t HETDSET;
  uint32_t HETDCLR;
  uint32_t HETPDR;
  uint32_t HETPULDIS;
  uint32_t HETPSL;
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY_ENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PAOFF:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETPAR;

  uint32_t HETPPR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRLD:10;
      uint64_t reservedSpace0:6;
      uint64_t CCDIV:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETSFPRLD;

  uint32_t HETSFENA;
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBPSEL:16;
      uint64_t LBPTYPE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETLBPSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBPDIR:16;
      uint64_t IODFTENA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETLBPDIR;

  uint32_t HETPINDIS;
};

#define N2HET_N2HET1 (*(volatile struct N2HET_N2HET1_tag *) 0xfff7b800)

struct N2HET_N2HET2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:1;
      uint64_t reservedSpace0:15;
      uint64_t CMS:1;
      uint64_t IS:1;
      uint64_t PPF:1;
      uint64_t reservedSpace1:2;
      uint64_t MP:2;
      uint64_t reservedSpace2:1;
      uint64_t HET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETGCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRPFC:6;
      uint64_t reservedSpace0:2;
      uint64_t LRPFC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETPFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HETADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Offset1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETOFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Offset2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETOFF2;

  uint32_t HETINTENAS;
  uint32_t HETINTENAC;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Prgm_Ovrfl_Pry:1;
      uint64_t APCNT_0:1;
      uint64_t APCNT_1:1;
      uint64_t reservedSpace0:5;
      uint64_t Prgm_Ovrfl_Ena:1;
      uint64_t reservedSpace1:7;
      uint64_t APCNT_2:1;
      uint64_t reservedSpace2:7;
      uint64_t APCNT_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETEXC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Prgm_Ovrfl_Flag:1;
      uint64_t APCNT_0:1;
      uint64_t APCNT_1:1;
      uint64_t reservedSpace0:5;
      uint64_t Debug_Status_Flag:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETEXC2;

  uint32_t HETPRY;
  uint32_t HETFLG;
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETHRSH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETXOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQENA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETREQENS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQDIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETREQENC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDS:8;
      uint64_t reservedSpace0:8;
      uint64_t TDBS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETREQDS;

  uint8_t res1[4];

  uint32_t HETDIR;
  uint32_t HETDIN;
  uint32_t HETDOUT;
  uint32_t HETDSET;
  uint32_t HETDCLR;
  uint32_t HETPDR;
  uint32_t HETPULDIS;
  uint32_t HETPSL;
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY_ENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PAOFF:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETPAR;

  uint32_t HETPPR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRLD:10;
      uint64_t reservedSpace0:6;
      uint64_t CCDIV:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETSFPRLD;

  uint32_t HETSFENA;
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBPSEL:16;
      uint64_t LBPTYPE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETLBPSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBPDIR:16;
      uint64_t IODFTENA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETLBPDIR;

  uint32_t HETPINDIS;
};

#define N2HET_N2HET2 (*(volatile struct N2HET_N2HET2_tag *) 0xfff7b900)

struct HTU_tag
{
  uint32_t HTU_IFADDRA;
  uint32_t HTU_IFADDRB;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t IHADDR:11;
      uint64_t reservedSpace1:3;
      uint64_t TMBB:2;
      uint64_t TMBA:2;
      uint64_t ADDFM:1;
      uint64_t ADDMH:1;
      uint64_t SIZE:1;
      uint64_t DIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_IHADDRCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFTCOUNT:8;
      uint64_t reservedSpace0:8;
      uint64_t IETCOUNT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_ITCOUNT;

  uint8_t res0[240];

  uint32_t HTU_CFADDRA;
  uint32_t HTU_CFADDRB;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFTCTB:8;
      uint64_t reservedSpace0:8;
      uint64_t CFTCTA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_CFCOUNT;

