iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define MPU_1 (*(volatile struct MPU_1_tag *) 0xfff10000)

struct INTC_1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HVEN:1;
      uint64_t reservedSpace0:4;
      uint64_t VTES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_CPR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INTVEC:9;
      uint64_t VTBA:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_IACKR;

  uint8_t res2[4];

  uint32_t INTC_EOIR;
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR3:1;
      uint64_t SET3:1;
      uint64_t reservedSpace0:6;
      uint64_t CLR2:1;
      uint64_t SET2:1;
      uint64_t reservedSpace1:6;
      uint64_t CLR1:1;
      uint64_t SET1:1;
      uint64_t reservedSpace2:6;
      uint64_t CLR0:1;
      uint64_t SET0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_SSCIR0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR7:1;
      uint64_t SET7:1;
      uint64_t reservedSpace0:6;
      uint64_t CLR6:1;
      uint64_t SET6:1;
      uint64_t reservedSpace1:6;
      uint64_t CLR5:1;
      uint64_t SET5:1;
      uint64_t reservedSpace2:6;
      uint64_t CLR4:1;
      uint64_t SET4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_SSCIR4_7;

  uint8_t res4[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI3:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI2:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI1:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI7:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI6:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI5:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR4_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI11:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI10:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI9:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI8:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR8_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI15:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI14:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI13:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI12:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR12_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI19:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI18:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI17:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI16:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR16_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI23:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI22:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI21:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI20:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR20_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI27:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI26:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI25:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI24:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR24_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI31:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI30:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI29:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI28:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR28_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI35:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI34:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI33:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI32:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR32_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI39:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI38:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI37:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI36:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR36_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI43:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI42:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI41:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI40:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR40_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI47:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI46:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI45:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI44:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR44_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI51:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI50:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI49:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI48:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR48_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI55:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI54:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI53:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI52:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR52_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI59:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI58:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI57:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI56:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR56_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI63:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI62:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI61:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI60:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR60_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI67:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI66:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI65:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI64:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR64_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI71:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI70:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI69:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI68:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR68_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI75:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI74:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI73:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI72:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR72_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI79:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI78:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI77:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI76:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR76_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI83:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI82:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI81:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI80:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR80_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI87:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI86:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI85:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI84:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR84_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI91:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI90:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI89:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI88:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR88_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI95:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI94:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI93:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI92:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR92_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI99:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI98:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI97:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI96:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR96_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI103:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI102:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI101:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI100:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR100_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI107:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI106:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI105:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI104:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR104_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI111:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI110:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI109:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI108:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR108_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI115:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI114:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI113:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI112:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR112_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI119:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI118:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI117:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI116:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR116_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI123:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI122:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI121:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI120:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR120_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI127:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI126:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI125:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI124:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR124_127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI131:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI130:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI129:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI128:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR128_131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI135:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI134:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI133:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI132:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR132_135;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI139:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI138:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI137:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI136:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR136_139;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI143:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI142:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI141:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI140:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR140_143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI147:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI146:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI145:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI144:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR144_147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI151:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI150:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI149:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI148:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR148_151;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI155:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI154:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI153:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI152:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR152_155;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI159:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI158:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI157:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI156:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR156_159;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI163:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI162:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI161:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI160:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR160_163;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI167:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI166:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI165:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI164:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR164_167;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI171:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI170:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI169:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI168:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR168_171;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI175:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI174:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI173:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI172:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR172_175;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI179:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI178:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI177:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI176:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR176_179;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI183:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI182:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI181:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI180:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR180_183;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI187:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI186:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI185:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI184:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR184_187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI191:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI190:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI189:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI188:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR188_191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI195:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI194:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI193:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI192:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR192_195;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI199:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI198:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI197:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI196:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR196_199;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI203:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI202:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI201:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI200:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR200_203;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI207:4;
      uint64_t reservedSpace0:4;
      uint64_t PRI206:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI205:4;
      uint64_t reservedSpace2:4;
      uint64_t PRI204:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR204_207;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PRI209:4;
      uint64_t reservedSpace1:4;
      uint64_t PRI208:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_PSR208_209;

