iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res3[918];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL3:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL2:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL1:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL7:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL6:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL5:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI4_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL11:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL10:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL9:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL8:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI8_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL15:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL14:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL13:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL12:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI12_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL19:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL18:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL17:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL16:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI16_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL23:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL22:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL21:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL20:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI20_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL27:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL26:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL25:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL24:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI24_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL31:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL30:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL29:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL28:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI28_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL35:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL34:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL33:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL32:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI32_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL39:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL38:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL37:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL36:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI36_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL43:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL42:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL41:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL40:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI40_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL47:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL46:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL45:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL44:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI44_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL51:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL50:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL49:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL48:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI48_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL55:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL54:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL53:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL52:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI52_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL59:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL58:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL57:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL56:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI56_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADSEL63:4;
      uint64_t reservedSpace0:4;
      uint64_t PADSEL62:4;
      uint64_t reservedSpace1:4;
      uint64_t PADSEL61:4;
      uint64_t reservedSpace2:4;
      uint64_t PADSEL60:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMI60_63;

  uint8_t res4[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO3:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO2:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO1:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO7:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO6:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO5:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO4_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO11:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO10:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO9:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO8_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO15:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO14:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO13:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO12_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO19:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO18:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO17:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO16_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO23:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO22:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO21:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO20:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO20_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO27:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO26:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO25:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO24:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO24_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO31:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO30:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO29:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO28:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO28_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO35:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO34:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO33:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO32_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO39:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO38:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO37:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO36:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO36_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO43:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO42:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO41:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO40:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO40_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO47:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO46:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO45:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO44:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO44_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO51:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO50:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO49:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO48:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO48_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO55:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO54:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO53:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO52:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO52_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO59:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO58:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO57:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO56:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO56_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO63:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO62:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO61:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO60:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO60_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO67:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO66:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO65:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO64:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO64_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO71:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO70:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO69:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO68:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO68_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO75:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO74:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO73:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO72:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO72_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO79:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO78:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO77:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO76:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO76_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO83:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO82:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO81:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO80:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO80_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO87:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO86:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO85:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO84:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO84_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO91:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO90:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO89:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO88:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO88_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO95:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO94:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO93:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO92:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO92_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO99:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO98:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO97:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO96:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO96_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO103:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO102:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO101:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO100:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO100_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO107:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO106:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO105:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO104:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO104_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO111:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO110:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO109:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO108:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO108_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO115:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO114:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO113:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO112:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO112_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO119:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO118:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO117:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO116:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO116_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO123:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO122:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO121:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO120:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO120_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO127:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO126:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO125:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO124:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO124_127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO131:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO130:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO129:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO128:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO128_131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO135:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO134:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO133:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO132:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO132_135;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO139:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO138:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO137:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO136:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO136_139;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO143:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO142:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO141:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO140:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO140_143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO147:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO146:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO145:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO144:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO144_147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO151:1;
      uint64_t reservedSpace0:7;
      uint64_t PDO150:1;
      uint64_t reservedSpace1:7;
      uint64_t PDO149:1;
      uint64_t reservedSpace2:7;
      uint64_t PDO148:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDO148_151;

  uint8_t res5[360];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI3:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI2:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI1:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI7:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI6:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI5:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI4_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI11:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI10:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI9:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI8_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI15:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI14:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI13:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI12_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI19:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI18:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI17:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI16_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI23:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI22:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI21:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI20:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI20_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI27:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI26:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI25:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI24:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI24_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI31:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI30:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI29:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI28:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI28_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI35:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI34:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI33:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI32_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI39:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI38:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI37:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI36:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI36_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI43:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI42:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI41:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI40:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI40_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI47:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI46:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI45:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI44:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI44_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI51:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI50:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI49:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI48:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI48_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI55:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI54:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI53:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI52:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI52_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI59:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI58:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI57:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI56:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI56_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI63:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI62:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI61:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI60:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI60_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI67:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI66:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI65:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI64:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI64_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI71:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI70:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI69:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI68:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI68_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI75:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI74:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI73:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI72:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI72_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI79:1;
      uint64_t reservedSpace0:7;
      uint64_t PDI78:1;
      uint64_t reservedSpace1:7;
      uint64_t PDI77:1;
      uint64_t reservedSpace2:7;
      uint64_t PDI76:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPDI76_79;

