iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res10[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFCP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCPR;

};

#define SIUL_1 (*(volatile struct SIUL_1_tag *) 0xc3f90004)

struct ECSM_1_tag
{
  uint16_t PCT;
  uint16_t REV;
  uint8_t res0[4];

  uint32_t IMC;
  uint8_t res1[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRILVL:4;
      uint64_t reservedSpace0:3;
      uint64_t ENBWCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MWCR;

  uint8_t res2[11];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t FB1SI:1;
      uint64_t FB1AI:1;
      uint64_t FB0SI:1;
      uint64_t FB0AI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MIR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUDCR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUDCR;

  uint8_t res4[27];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EFNCR:1;
      uint64_t ERNCR:1;
      uint64_t reservedSpace0:2;
      uint64_t EF1BR:1;
      uint64_t ER1BR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ECR;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FNCE:1;
      uint64_t RNCE:1;
      uint64_t reservedSpace0:2;
      uint64_t F1BC:1;
      uint64_t R1BC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ESR;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ERRBIT:7;
      uint64_t reservedSpace0:1;
      uint64_t FR1NCI:1;
      uint64_t FRCNCI:1;
      uint64_t reservedSpace1:2;
      uint64_t FR11BI:1;
      uint64_t FRC1BI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EEGR;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEAR;

  uint8_t res8[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FEMR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FEMR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROTECTION:4;
      uint64_t SIZE:3;
      uint64_t WRITE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FEAT;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REAR;

  uint8_t res10[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RESR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t REMR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) REMR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROTECTION:4;
      uint64_t SIZE:3;
      uint64_t WRITE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) REAT;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REDR;

};

#define ECSM_1 (*(volatile struct ECSM_1_tag *) 0xfff40000)

struct STM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FRZ:1;
      uint64_t reservedSpace0:6;
      uint64_t CPS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CR;

  uint32_t STM_CNT;
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CIR0;

  uint32_t STM_CMP0;
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CIR1;

  uint32_t STM_CMP1;
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CIR2;

  uint32_t STM_CMP2;
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STM_CIR3;

  uint32_t STM_CMP3;
};

#define STM_1 (*(volatile struct STM_1_tag *) 0xfff3c000)

struct RTC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t SUPV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCSUPV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APIVAL_90:10;
      uint64_t DIV32EN:1;
      uint64_t DIV512EN:1;
      uint64_t CLKSEL_10:2;
      uint64_t APIIE:1;
      uint64_t APIEN:1;
      uint64_t RTCVAL_110:12;
      uint64_t ROVREN:1;
      uint64_t FRZEN:1;
      uint64_t RTCIE:1;
      uint64_t CNTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t ROVRF:1;
      uint64_t reservedSpace1:2;
      uint64_t APIF:1;
      uint64_t reservedSpace2:15;
      uint64_t RTCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCS;

  uint32_t RTCCNT;
};

#define RTC_1 (*(volatile struct RTC_1_tag *) 0xc3fec000)

struct eMIOS_eMIOS0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t GPRE:8;
      uint64_t reservedSpace1:10;
      uint64_t GPREN:1;
      uint64_t reservedSpace2:1;
      uint64_t GTBE:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_MCR;

  uint32_t EMIOS0_GFLAG;
  uint32_t EMIOS0_OUDIS;
  uint32_t EMIOS0_UCDIS;
  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC0_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC0_B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC0_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t reservedSpace3:3;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC0_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAGFLAGC:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFLOVFLC:1;
      uint64_t reservedSpace1:15;
      uint64_t OVROVRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC0_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC0_ALTA;

