iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC1_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC1_B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC1_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t reservedSpace3:3;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC1_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAGFLAGC:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFLOVFLC:1;
      uint64_t reservedSpace1:15;
      uint64_t OVROVRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC1_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC1_ALTA;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC2_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC2_B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC2_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t reservedSpace3:3;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC2_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAGFLAGC:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFLOVFLC:1;
      uint64_t reservedSpace1:15;
      uint64_t OVROVRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC2_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC2_ALTA;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC3_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC3_B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC3_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t reservedSpace3:3;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC3_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAGFLAGC:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFLOVFLC:1;
      uint64_t reservedSpace1:15;
      uint64_t OVROVRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC3_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC3_ALTA;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC4_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC4_B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC4_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t reservedSpace3:3;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC4_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAGFLAGC:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFLOVFLC:1;
      uint64_t reservedSpace1:15;
      uint64_t OVROVRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC4_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMIOS0_UC4_ALTA;

