iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define LINFlexD_LINFlex1_1 (*(volatile struct LINFlexD_LINFlex1_1_tag *) 0xffe44000)

struct PCU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN:4;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PCONF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN:4;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PCONF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN:4;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PCONF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN:4;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PCONF3;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PSTAT;

  uint8_t res1[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V_LVD_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREG_CTL;

};

#define PCU_1 (*(volatile struct PCU_1_tag *) 0xc3fe8000)

struct SPR_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRMC:2;
      uint64_t FOVFE:1;
      uint64_t FUNFE:1;
      uint64_t FDBZE:1;
      uint64_t FINVE:1;
      uint64_t FINXE:1;
      uint64_t reservedSpace0:1;
      uint64_t FOVF:1;
      uint64_t FUNF:1;
      uint64_t FDBZ:1;
      uint64_t FINV:1;
      uint64_t FX:1;
      uint64_t FG:1;
      uint64_t OV:1;
      uint64_t SOV:1;
      uint64_t MODE:1;
      uint64_t FOVFS:1;
      uint64_t FUNFS:1;
      uint64_t FDBZS:1;
      uint64_t FINVS:1;
      uint64_t FINXS:1;
      uint64_t reservedSpace1:2;
      uint64_t FOVFH:1;
      uint64_t FUNFH:1;
      uint64_t FDBZH:1;
      uint64_t FINVH:1;
      uint64_t FXH:1;
      uint64_t FGH:1;
      uint64_t OVH:1;
      uint64_t SOVH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPEFSCR;

};

#define SPR_3 (*(volatile struct SPR_3_tag *) 0x200)

struct BODY_CTU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t TRGI:1;
      uint64_t TRGIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  uint8_t res0[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE:7;
      uint64_t reservedSpace0:7;
      uint64_t CLR_FLAG:1;
      uint64_t TM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTCFGR63;

