iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIDM:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XIDAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIDX:6;
      uint64_t MSI:2;
      uint64_t FIDX:7;
      uint64_t FLST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ND0:1;
      uint64_t ND1:1;
      uint64_t ND2:1;
      uint64_t ND3:1;
      uint64_t ND4:1;
      uint64_t ND5:1;
      uint64_t ND6:1;
      uint64_t ND7:1;
      uint64_t ND8:1;
      uint64_t ND9:1;
      uint64_t ND10:1;
      uint64_t ND11:1;
      uint64_t ND12:1;
      uint64_t ND13:1;
      uint64_t ND14:1;
      uint64_t ND15:1;
      uint64_t ND16:1;
      uint64_t ND17:1;
      uint64_t ND18:1;
      uint64_t ND19:1;
      uint64_t ND20:1;
      uint64_t ND21:1;
      uint64_t ND22:1;
      uint64_t ND23:1;
      uint64_t ND24:1;
      uint64_t ND25:1;
      uint64_t ND26:1;
      uint64_t ND27:1;
      uint64_t ND28:1;
      uint64_t ND29:1;
      uint64_t ND30:1;
      uint64_t ND31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NDAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ND32:1;
      uint64_t ND33:1;
      uint64_t ND34:1;
      uint64_t ND35:1;
      uint64_t ND36:1;
      uint64_t ND37:1;
      uint64_t ND38:1;
      uint64_t ND39:1;
      uint64_t ND40:1;
      uint64_t ND41:1;
      uint64_t ND42:1;
      uint64_t ND43:1;
      uint64_t ND44:1;
      uint64_t ND45:1;
      uint64_t ND46:1;
      uint64_t ND47:1;
      uint64_t ND48:1;
      uint64_t ND49:1;
      uint64_t ND50:1;
      uint64_t ND51:1;
      uint64_t ND52:1;
      uint64_t ND53:1;
      uint64_t ND54:1;
      uint64_t ND55:1;
      uint64_t ND56:1;
      uint64_t ND57:1;
      uint64_t ND58:1;
      uint64_t ND59:1;
      uint64_t ND60:1;
      uint64_t ND61:1;
      uint64_t ND62:1;
      uint64_t ND63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NDAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t F0SA:14;
      uint64_t F0S:7;
      uint64_t reservedSpace1:1;
      uint64_t F0WM:7;
      uint64_t F0OM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F0GI:6;
      uint64_t reservedSpace1:2;
      uint64_t F0PI:6;
      uint64_t reservedSpace2:2;
      uint64_t F0F:1;
      uint64_t RF0L:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0AI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RBSA:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t F1SA:14;
      uint64_t F1S:7;
      uint64_t reservedSpace1:1;
      uint64_t F1WM:7;
      uint64_t F1OM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F1GI:6;
      uint64_t reservedSpace1:2;
      uint64_t F1PI:6;
      uint64_t reservedSpace2:2;
      uint64_t F1F:1;
      uint64_t RF1L:1;
      uint64_t reservedSpace3:4;
      uint64_t DMS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1AI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0DS:3;
      uint64_t reservedSpace0:1;
      uint64_t F1DS:3;
      uint64_t reservedSpace1:1;
      uint64_t RBDS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TBSA:14;
      uint64_t NDTB:6;
      uint64_t reservedSpace1:2;
      uint64_t TFQS:6;
      uint64_t TFQM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t TFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t TFQPI:5;
      uint64_t TFQF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFQS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBDS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRP0:1;
      uint64_t TRP1:1;
      uint64_t TRP2:1;
      uint64_t TRP3:1;
      uint64_t TRP4:1;
      uint64_t TRP5:1;
      uint64_t TRP6:1;
      uint64_t TRP7:1;
      uint64_t TRP8:1;
      uint64_t TRP9:1;
      uint64_t TRP10:1;
      uint64_t TRP11:1;
      uint64_t TRP12:1;
      uint64_t TRP13:1;
      uint64_t TRP14:1;
      uint64_t TRP15:1;
      uint64_t TRP16:1;
      uint64_t TRP17:1;
      uint64_t TRP18:1;
      uint64_t TRP19:1;
      uint64_t TRP20:1;
      uint64_t TRP21:1;
      uint64_t TRP22:1;
      uint64_t TRP23:1;
      uint64_t TRP24:1;
      uint64_t TRP25:1;
      uint64_t TRP26:1;
      uint64_t TRP27:1;
      uint64_t TRP28:1;
      uint64_t TRP29:1;
      uint64_t TRP30:1;
      uint64_t TRP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR0:1;
      uint64_t AR1:1;
      uint64_t AR2:1;
      uint64_t AR3:1;
      uint64_t AR4:1;
      uint64_t AR5:1;
      uint64_t AR6:1;
      uint64_t AR7:1;
      uint64_t AR8:1;
      uint64_t AR9:1;
      uint64_t AR10:1;
      uint64_t AR11:1;
      uint64_t AR12:1;
      uint64_t AR13:1;
      uint64_t AR14:1;
      uint64_t AR15:1;
      uint64_t AR16:1;
      uint64_t AR17:1;
      uint64_t AR18:1;
      uint64_t AR19:1;
      uint64_t AR20:1;
      uint64_t AR21:1;
      uint64_t AR22:1;
      uint64_t AR23:1;
      uint64_t AR24:1;
      uint64_t AR25:1;
      uint64_t AR26:1;
      uint64_t AR27:1;
      uint64_t AR28:1;
      uint64_t AR29:1;
      uint64_t AR30:1;
      uint64_t AR31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR0:1;
      uint64_t CR1:1;
      uint64_t CR2:1;
      uint64_t CR3:1;
      uint64_t CR4:1;
      uint64_t CR5:1;
      uint64_t CR6:1;
      uint64_t CR7:1;
      uint64_t CR8:1;
      uint64_t CR9:1;
      uint64_t CR10:1;
      uint64_t CR11:1;
      uint64_t CR12:1;
      uint64_t CR13:1;
      uint64_t CR14:1;
      uint64_t CR15:1;
      uint64_t CR16:1;
      uint64_t CR17:1;
      uint64_t CR18:1;
      uint64_t CR19:1;
      uint64_t CR20:1;
      uint64_t CR21:1;
      uint64_t CR22:1;
      uint64_t CR23:1;
      uint64_t CR24:1;
      uint64_t CR25:1;
      uint64_t CR26:1;
      uint64_t CR27:1;
      uint64_t CR28:1;
      uint64_t CR29:1;
      uint64_t CR30:1;
      uint64_t CR31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO0:1;
      uint64_t TO1:1;
      uint64_t TO2:1;
      uint64_t TO3:1;
      uint64_t TO4:1;
      uint64_t TO5:1;
      uint64_t TO6:1;
      uint64_t TO7:1;
      uint64_t TO8:1;
      uint64_t TO9:1;
      uint64_t TO10:1;
      uint64_t TO11:1;
      uint64_t TO12:1;
      uint64_t TO13:1;
      uint64_t TO14:1;
      uint64_t TO15:1;
      uint64_t TO16:1;
      uint64_t TO17:1;
      uint64_t TO18:1;
      uint64_t TO19:1;
      uint64_t TO20:1;
      uint64_t TO21:1;
      uint64_t TO22:1;
      uint64_t TO23:1;
      uint64_t TO24:1;
      uint64_t TO25:1;
      uint64_t TO26:1;
      uint64_t TO27:1;
      uint64_t TO28:1;
      uint64_t TO29:1;
      uint64_t TO30:1;
      uint64_t TO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF0:1;
      uint64_t CF1:1;
      uint64_t CF2:1;
      uint64_t CF3:1;
      uint64_t CF4:1;
      uint64_t CF5:1;
      uint64_t CF6:1;
      uint64_t CF7:1;
      uint64_t CF8:1;
      uint64_t CF9:1;
      uint64_t CF10:1;
      uint64_t CF11:1;
      uint64_t CF12:1;
      uint64_t CF13:1;
      uint64_t CF14:1;
      uint64_t CF15:1;
      uint64_t CF16:1;
      uint64_t CF17:1;
      uint64_t CF18:1;
      uint64_t CF19:1;
      uint64_t CF20:1;
      uint64_t CF21:1;
      uint64_t CF22:1;
      uint64_t CF23:1;
      uint64_t CF24:1;
      uint64_t CF25:1;
      uint64_t CF26:1;
      uint64_t CF27:1;
      uint64_t CF28:1;
      uint64_t CF29:1;
      uint64_t CF30:1;
      uint64_t CF31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE0:1;
      uint64_t TIE1:1;
      uint64_t TIE2:1;
      uint64_t TIE3:1;
      uint64_t TIE4:1;
      uint64_t TIE5:1;
      uint64_t TIE6:1;
      uint64_t TIE7:1;
      uint64_t TIE8:1;
      uint64_t TIE9:1;
      uint64_t TIE10:1;
      uint64_t TIE11:1;
      uint64_t TIE12:1;
      uint64_t TIE13:1;
      uint64_t TIE14:1;
      uint64_t TIE15:1;
      uint64_t TIE16:1;
      uint64_t TIE17:1;
      uint64_t TIE18:1;
      uint64_t TIE19:1;
      uint64_t TIE20:1;
      uint64_t TIE21:1;
      uint64_t TIE22:1;
      uint64_t TIE23:1;
      uint64_t TIE24:1;
      uint64_t TIE25:1;
      uint64_t TIE26:1;
      uint64_t TIE27:1;
      uint64_t TIE28:1;
      uint64_t TIE29:1;
      uint64_t TIE30:1;
      uint64_t TIE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBTIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFIE0:1;
      uint64_t CFIE1:1;
      uint64_t CFIE2:1;
      uint64_t CFIE3:1;
      uint64_t CFIE4:1;
      uint64_t CFIE5:1;
      uint64_t CFIE6:1;
      uint64_t CFIE7:1;
      uint64_t CFIE8:1;
      uint64_t CFIE9:1;
      uint64_t CFIE10:1;
      uint64_t CFIE11:1;
      uint64_t CFIE12:1;
      uint64_t CFIE13:1;
      uint64_t CFIE14:1;
      uint64_t CFIE15:1;
      uint64_t CFIE16:1;
      uint64_t CFIE17:1;
      uint64_t CFIE18:1;
      uint64_t CFIE19:1;
      uint64_t CFIE20:1;
      uint64_t CFIE21:1;
      uint64_t CFIE22:1;
      uint64_t CFIE23:1;
      uint64_t CFIE24:1;
      uint64_t CFIE25:1;
      uint64_t CFIE26:1;
      uint64_t CFIE27:1;
      uint64_t CFIE28:1;
      uint64_t CFIE29:1;
      uint64_t CFIE30:1;
      uint64_t CFIE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCIE;

