iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EFSA:14;
      uint64_t EFS:6;
      uint64_t reservedSpace1:2;
      uint64_t EFWM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t EFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t EFPI:5;
      uint64_t reservedSpace2:3;
      uint64_t EFF:1;
      uint64_t TEFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFAI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFA;

};

#define CAN_SUB_M_CAN_CAN_SUB_1_M_CAN_3 (*(volatile struct CAN_SUB_M_CAN_CAN_SUB_1_M_CAN_3_tag *) 0xfbeec000)

struct CCCU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAY:8;
      uint64_t MON:8;
      uint64_t YEAR:4;
      uint64_t SUBSTEP:4;
      uint64_t STEP:4;
      uint64_t REL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TQBT:5;
      uint64_t reservedSpace0:1;
      uint64_t BCC:1;
      uint64_t CFL:1;
      uint64_t OCPM:8;
      uint64_t CDIV:4;
      uint64_t reservedSpace1:11;
      uint64_t SWR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCPC:18;
      uint64_t TQC:11;
      uint64_t reservedSpace0:1;
      uint64_t CALS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDC:16;
      uint64_t WDV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWE:1;
      uint64_t CSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CUIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWEE:1;
      uint64_t CSCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CUIE;

};

#define CCCU_0 (*(volatile struct CCCU_0_tag *) 0xf7f04000)

struct CMU_CMU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
      uint64_t FLCI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_0 (*(volatile struct CMU_CMU_0_tag *) 0xf7fb0200)

struct CMU_CMU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
      uint64_t FLCI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_1 (*(volatile struct CMU_CMU_1_tag *) 0xfbfb0200)

struct CMU_CMU_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
      uint64_t FLCI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_2 (*(volatile struct CMU_CMU_2_tag *) 0xfbfb0240)

struct CMU_CMU_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
      uint64_t FLCI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

