iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
struct CRC_CRC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t SWAP:1;
      uint64_t POLYG:2;
      uint64_t SWAP_BITWISE:1;
      uint64_t SWAP_BYTEWISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG0;

  uint32_t INP0;
  uint32_t CSTAT0;
  uint32_t OUTP0;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t SWAP:1;
      uint64_t POLYG:2;
      uint64_t SWAP_BITWISE:1;
      uint64_t SWAP_BYTEWISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  uint32_t INP1;
  uint32_t CSTAT1;
  uint32_t OUTP1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t SWAP:1;
      uint64_t POLYG:2;
      uint64_t SWAP_BITWISE:1;
      uint64_t SWAP_BYTEWISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  uint32_t INP2;
  uint32_t CSTAT2;
  uint32_t OUTP2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t SWAP:1;
      uint64_t POLYG:2;
      uint64_t SWAP_BITWISE:1;
      uint64_t SWAP_BYTEWISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG3;

  uint32_t INP3;
  uint32_t CSTAT3;
  uint32_t OUTP3;
};

#define CRC_CRC_1 (*(volatile struct CRC_CRC_1_tag *) 0xfbf64000)

struct DMAMUX_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG15;

};

#define DMAMUX_0 (*(volatile struct DMAMUX_0_tag *) 0xf7f6c000)

struct DSPI_DSPI_0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HALT:1;
      uint64_t PES:1;
      uint64_t FCPCS:1;
      uint64_t XSPI:1;
      uint64_t reservedSpace0:4;
      uint64_t SMPL_PT:2;
      uint64_t CLR_RXF:1;
      uint64_t CLR_TXF:1;
      uint64_t DIS_RXF:1;
      uint64_t DIS_TXF:1;
      uint64_t MDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t PCSIS0:1;
      uint64_t PCSIS1:1;
      uint64_t PCSIS2:1;
      uint64_t PCSIS3:1;
      uint64_t PCSIS4:1;
      uint64_t PCSIS5:1;
      uint64_t PCSIS6:1;
      uint64_t PCSIS7:1;
      uint64_t ROOE:1;
      uint64_t PCSSE:1;
      uint64_t MTFE:1;
      uint64_t FRZ:1;
      uint64_t DCONF:2;
      uint64_t CONT_SCKE:1;
      uint64_t MSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t ITSB_EN:1;
      uint64_t TSB_EN:1;
      uint64_t SLV_MODE:1;
      uint64_t MSTR_MODE:1;
      uint64_t CMDFR:4;
      uint64_t RXFR:4;
      uint64_t TXFR:4;
      uint64_t CTAR:3;
      uint64_t XSPI:1;
      uint64_t PISR_EX:1;
      uint64_t DSI64:1;
      uint64_t PISR:1;
      uint64_t DSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SPI_TCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t FMSZ5:1;
      uint64_t PP:1;
      uint64_t LSBFE:1;
      uint64_t PE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ_0:4;
      uint64_t FMSZ_1:5;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t FMSZ5:1;
      uint64_t PP:1;
      uint64_t LSBFE:1;
      uint64_t PE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ_0:4;
      uint64_t FMSZ_1:5;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTAR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTAR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTAR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTAR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTAR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POPNXTPTR:4;
      uint64_t RXCTR:4;
      uint64_t TXNXTPTR:4;
      uint64_t TXCTR:4;
      uint64_t CMDFFF:1;
      uint64_t RFDF:1;
      uint64_t TFIWF:1;
      uint64_t RFOF:1;
      uint64_t reservedSpace0:1;
      uint64_t SPEF:1;
      uint64_t reservedSpace1:1;
      uint64_t CMDTCF:1;
      uint64_t BSYF:1;
      uint64_t TFFF:1;
      uint64_t reservedSpace2:1;
      uint64_t TFUF:1;
      uint64_t EOQF:1;
      uint64_t reservedSpace3:1;
      uint64_t TXRXS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t CMDFFF_DIRS:1;
      uint64_t RFDF_DIRS:1;
      uint64_t RFDF_RE:1;
      uint64_t TFIWF_RE:1;
      uint64_t RFOF_RE:1;
      uint64_t reservedSpace1:1;
      uint64_t SPEF_RE:1;
      uint64_t reservedSpace2:1;
      uint64_t CMDTCF_RE:1;
      uint64_t TFFF_DIRS:1;
      uint64_t TFFF_RE:1;
      uint64_t reservedSpace3:1;
      uint64_t TFUF_RE:1;
      uint64_t EOQF_RE:1;
      uint64_t SPITCF_RE:1;
      uint64_t CMDFFF_RE:1;
      uint64_t TCF_RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t PCS:8;
      uint64_t PP_MCSC:1;
      uint64_t PE_MASC:1;
      uint64_t CTCNT:1;
      uint64_t EOQ:1;
      uint64_t CTAS:3;
      uint64_t CONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUSHR;

  uint32_t POPR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXCMD_TXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXCMD_TXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXCMD_TXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXCMD_TXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFR3;

  uint8_t res0[48];

  uint32_t RXFR0;
  uint32_t RXFR1;
  uint32_t RXFR2;
  uint32_t RXFR3;
  uint8_t res1[144];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCP:11;
      uint64_t reservedSpace0:5;
      uint64_t FMSZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTARE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCP:11;
      uint64_t reservedSpace0:5;
      uint64_t FMSZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTARE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCP:11;
      uint64_t reservedSpace0:5;
      uint64_t FMSZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTARE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCP:11;
      uint64_t reservedSpace0:5;
      uint64_t FMSZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTARE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCP:11;
      uint64_t reservedSpace0:5;
      uint64_t FMSZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTARE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCP:11;
      uint64_t reservedSpace0:5;
      uint64_t FMSZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTARE5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCP:11;
      uint64_t reservedSpace0:5;
      uint64_t FMSZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTARE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCP:11;
      uint64_t reservedSpace0:5;
      uint64_t FMSZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTARE7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDNXTPTR:4;
      uint64_t CMDCTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SREX;

