iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define DSPI_DSPI_3_1 (*(volatile struct DSPI_DSPI_3_1_tag *) 0xfbe74000)

struct DTS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTS_EN:1;
      uint64_t DTS_EN_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENABLE;

  uint32_t STARTUP;
  uint32_t SEMAPHORE;
  uint32_t SEMAPHORE_B;
};

#define DTS (*(volatile struct DTS_tag *) 0xf7f38000)

struct EDMA_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EDBG:1;
      uint64_t ERCA:1;
      uint64_t ERGA:1;
      uint64_t HOE:1;
      uint64_t HALT:1;
      uint64_t CLM:1;
      uint64_t EMLM:1;
      uint64_t GRP0PRI:2;
      uint64_t reservedSpace1:6;
      uint64_t ECX:1;
      uint64_t CX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBE:1;
      uint64_t SBE:1;
      uint64_t SGE:1;
      uint64_t NCE:1;
      uint64_t DOE:1;
      uint64_t DAE:1;
      uint64_t SOE:1;
      uint64_t SAE:1;
      uint64_t ERRCHN:6;
      uint64_t CPE:1;
      uint64_t reservedSpace0:1;
      uint64_t ECX:1;
      uint64_t UCE:1;
      uint64_t reservedSpace1:13;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ES;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERQ0:1;
      uint64_t ERQ1:1;
      uint64_t ERQ2:1;
      uint64_t ERQ3:1;
      uint64_t ERQ4:1;
      uint64_t ERQ5:1;
      uint64_t ERQ6:1;
      uint64_t ERQ7:1;
      uint64_t ERQ8:1;
      uint64_t ERQ9:1;
      uint64_t ERQ10:1;
      uint64_t ERQ11:1;
      uint64_t ERQ12:1;
      uint64_t ERQ13:1;
      uint64_t ERQ14:1;
      uint64_t ERQ15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERQL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEI0:1;
      uint64_t EEI1:1;
      uint64_t EEI2:1;
      uint64_t EEI3:1;
      uint64_t EEI4:1;
      uint64_t EEI5:1;
      uint64_t EEI6:1;
      uint64_t EEI7:1;
      uint64_t EEI8:1;
      uint64_t EEI9:1;
      uint64_t EEI10:1;
      uint64_t EEI11:1;
      uint64_t EEI12:1;
      uint64_t EEI13:1;
      uint64_t EEI14:1;
      uint64_t EEI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEIL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SERQ:6;
      uint64_t SAER:1;
      uint64_t NOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERQ;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CERQ:6;
      uint64_t CAER:1;
      uint64_t NOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CERQ;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SEEI:6;
      uint64_t SAEE:1;
      uint64_t NOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SEEI;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CEEI:6;
      uint64_t CAEE:1;
      uint64_t NOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CEEI;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CINT:6;
      uint64_t CAIR:1;
      uint64_t NOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CINT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CERR:6;
      uint64_t CAEI:1;
      uint64_t NOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CERR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSRT:6;
      uint64_t SAST:1;
      uint64_t NOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSRT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CDNE:6;
      uint64_t CADN:1;
      uint64_t NOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CDNE;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT0:1;
      uint64_t INT1:1;
      uint64_t INT2:1;
      uint64_t INT3:1;
      uint64_t INT4:1;
      uint64_t INT5:1;
      uint64_t INT6:1;
      uint64_t INT7:1;
      uint64_t INT8:1;
      uint64_t INT9:1;
      uint64_t INT10:1;
      uint64_t INT11:1;
      uint64_t INT12:1;
      uint64_t INT13:1;
      uint64_t INT14:1;
      uint64_t INT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTL;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t ERR8:1;
      uint64_t ERR9:1;
      uint64_t ERR10:1;
      uint64_t ERR11:1;
      uint64_t ERR12:1;
      uint64_t ERR13:1;
      uint64_t ERR14:1;
      uint64_t ERR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRL;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRS0:1;
      uint64_t HRS1:1;
      uint64_t HRS2:1;
      uint64_t HRS3:1;
      uint64_t HRS4:1;
      uint64_t HRS5:1;
      uint64_t HRS6:1;
      uint64_t HRS7:1;
      uint64_t HRS8:1;
      uint64_t HRS9:1;
      uint64_t HRS10:1;
      uint64_t HRS11:1;
      uint64_t HRS12:1;
      uint64_t HRS13:1;
      uint64_t HRS14:1;
      uint64_t HRS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRSL;

  uint8_t res5[200];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHPRI:4;
      uint64_t GRPPRI:2;
      uint64_t DPA:1;
      uint64_t ECP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHPRI15;

  uint8_t res6[48];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MID:4;
      uint64_t reservedSpace0:2;
      uint64_t PAL:1;
      uint64_t EMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DCHMID15;

  uint8_t res7[3760];

  uint32_t TCD0_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD0_ATTR;

  uint16_t TCD0_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD0_NBYTES_MLNO;

  uint32_t TCD0_SLAST;
  uint32_t TCD0_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD0_CITER_ELINKYES;

  uint16_t TCD0_DOFF;
  uint32_t TCD0_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD0_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD0_CSR;

  uint32_t TCD1_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD1_ATTR;

  uint16_t TCD1_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD1_NBYTES_MLNO;

  uint32_t TCD1_SLAST;
  uint32_t TCD1_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD1_CITER_ELINKYES;

  uint16_t TCD1_DOFF;
  uint32_t TCD1_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD1_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD1_CSR;

  uint32_t TCD2_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD2_ATTR;

