iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint16_t TCD2_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD2_NBYTES_MLNO;

  uint32_t TCD2_SLAST;
  uint32_t TCD2_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD2_CITER_ELINKYES;

  uint16_t TCD2_DOFF;
  uint32_t TCD2_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD2_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD2_CSR;

  uint32_t TCD3_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD3_ATTR;

  uint16_t TCD3_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD3_NBYTES_MLNO;

  uint32_t TCD3_SLAST;
  uint32_t TCD3_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD3_CITER_ELINKYES;

  uint16_t TCD3_DOFF;
  uint32_t TCD3_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD3_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD3_CSR;

  uint32_t TCD4_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD4_ATTR;

  uint16_t TCD4_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD4_NBYTES_MLNO;

  uint32_t TCD4_SLAST;
  uint32_t TCD4_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD4_CITER_ELINKYES;

  uint16_t TCD4_DOFF;
  uint32_t TCD4_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD4_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD4_CSR;

  uint32_t TCD5_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD5_ATTR;

  uint16_t TCD5_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD5_NBYTES_MLNO;

  uint32_t TCD5_SLAST;
  uint32_t TCD5_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD5_CITER_ELINKYES;

  uint16_t TCD5_DOFF;
  uint32_t TCD5_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD5_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD5_CSR;

  uint32_t TCD6_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD6_ATTR;

  uint16_t TCD6_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD6_NBYTES_MLNO;

