iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint32_t TCD6_SLAST;
  uint32_t TCD6_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD6_CITER_ELINKYES;

  uint16_t TCD6_DOFF;
  uint32_t TCD6_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD6_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD6_CSR;

  uint32_t TCD7_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD7_ATTR;

  uint16_t TCD7_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD7_NBYTES_MLNO;

  uint32_t TCD7_SLAST;
  uint32_t TCD7_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD7_CITER_ELINKYES;

  uint16_t TCD7_DOFF;
  uint32_t TCD7_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD7_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD7_CSR;

  uint32_t TCD8_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD8_ATTR;

  uint16_t TCD8_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD8_NBYTES_MLNO;

  uint32_t TCD8_SLAST;
  uint32_t TCD8_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD8_CITER_ELINKYES;

  uint16_t TCD8_DOFF;
  uint32_t TCD8_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD8_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD8_CSR;

  uint32_t TCD9_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD9_ATTR;

  uint16_t TCD9_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD9_NBYTES_MLNO;

  uint32_t TCD9_SLAST;
  uint32_t TCD9_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD9_CITER_ELINKYES;

  uint16_t TCD9_DOFF;
  uint32_t TCD9_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD9_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD9_CSR;

  uint32_t TCD10_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD10_ATTR;

  uint16_t TCD10_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD10_NBYTES_MLNO;

  uint32_t TCD10_SLAST;
  uint32_t TCD10_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD10_CITER_ELINKYES;

