iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint16_t TCD10_DOFF;
  uint32_t TCD10_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD10_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD10_CSR;

  uint32_t TCD11_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD11_ATTR;

  uint16_t TCD11_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD11_NBYTES_MLNO;

  uint32_t TCD11_SLAST;
  uint32_t TCD11_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD11_CITER_ELINKYES;

  uint16_t TCD11_DOFF;
  uint32_t TCD11_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD11_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD11_CSR;

  uint32_t TCD12_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD12_ATTR;

  uint16_t TCD12_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD12_NBYTES_MLNO;

  uint32_t TCD12_SLAST;
  uint32_t TCD12_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD12_CITER_ELINKYES;

  uint16_t TCD12_DOFF;
  uint32_t TCD12_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD12_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD12_CSR;

  uint32_t TCD13_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD13_ATTR;

  uint16_t TCD13_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD13_NBYTES_MLNO;

  uint32_t TCD13_SLAST;
  uint32_t TCD13_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD13_CITER_ELINKYES;

  uint16_t TCD13_DOFF;
  uint32_t TCD13_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD13_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD13_CSR;

  uint32_t TCD14_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD14_ATTR;

  uint16_t TCD14_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD14_NBYTES_MLNO;

  uint32_t TCD14_SLAST;
  uint32_t TCD14_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD14_CITER_ELINKYES;

  uint16_t TCD14_DOFF;
  uint32_t TCD14_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD14_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD14_CSR;

