iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint32_t TCD15_SADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DSIZE:3;
      uint64_t DMOD:5;
      uint64_t SSIZE:3;
      uint64_t SMOD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD15_ATTR;

  uint16_t TCD15_SOFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBYTES_0:30;
      uint64_t NBYTES_1:10;
      uint64_t MLOFF:20;
      uint64_t DMLOE:1;
      uint64_t SMLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCD15_NBYTES_MLNO;

  uint32_t TCD15_SLAST;
  uint32_t TCD15_DADDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CITER_0:9;
      uint64_t CITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD15_CITER_ELINKYES;

  uint16_t TCD15_DOFF;
  uint32_t TCD15_DLASTSGA;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BITER_0:9;
      uint64_t BITER_1:15;
      uint64_t LINKCH:6;
      uint64_t ELINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD15_BITER_ELINKYES;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTMAJOR:1;
      uint64_t INTHALF:1;
      uint64_t DREQ:1;
      uint64_t ESG:1;
      uint64_t MAJORELINK:1;
      uint64_t ACTIVE:1;
      uint64_t DONE:1;
      uint64_t MAJORLINKCH:6;
      uint64_t BWC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCD15_CSR;

};

#define EDMA_1 (*(volatile struct EDMA_1_tag *) 0xf40a4000)

struct EMIOS_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t GPRE:8;
      uint64_t reservedSpace1:10;
      uint64_t GPREN:1;
      uint64_t reservedSpace2:1;
      uint64_t GTBE:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0:1;
      uint64_t F1:1;
      uint64_t F2:1;
      uint64_t F3:1;
      uint64_t F4:1;
      uint64_t F5:1;
      uint64_t F6:1;
      uint64_t F7:1;
      uint64_t F8:1;
      uint64_t F9:1;
      uint64_t F10:1;
      uint64_t F11:1;
      uint64_t F12:1;
      uint64_t F13:1;
      uint64_t F14:1;
      uint64_t F15:1;
      uint64_t F16:1;
      uint64_t F17:1;
      uint64_t F18:1;
      uint64_t F19:1;
      uint64_t F20:1;
      uint64_t F21:1;
      uint64_t F22:1;
      uint64_t F23:1;
      uint64_t F24:1;
      uint64_t F25:1;
      uint64_t F26:1;
      uint64_t F27:1;
      uint64_t F28:1;
      uint64_t F29:1;
      uint64_t F30:1;
      uint64_t F31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OU0:1;
      uint64_t OU1:1;
      uint64_t OU2:1;
      uint64_t OU3:1;
      uint64_t OU4:1;
      uint64_t OU5:1;
      uint64_t OU6:1;
      uint64_t OU7:1;
      uint64_t OU8:1;
      uint64_t OU9:1;
      uint64_t OU10:1;
      uint64_t OU11:1;
      uint64_t OU12:1;
      uint64_t OU13:1;
      uint64_t OU14:1;
      uint64_t OU15:1;
      uint64_t OU16:1;
      uint64_t OU17:1;
      uint64_t OU18:1;
      uint64_t OU19:1;
      uint64_t OU20:1;
      uint64_t OU21:1;
      uint64_t OU22:1;
      uint64_t OU23:1;
      uint64_t OU24:1;
      uint64_t OU25:1;
      uint64_t OU26:1;
      uint64_t OU27:1;
      uint64_t OU28:1;
      uint64_t OU29:1;
      uint64_t OU30:1;
      uint64_t OU31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHDIS0:1;
      uint64_t CHDIS1:1;
      uint64_t CHDIS2:1;
      uint64_t CHDIS3:1;
      uint64_t CHDIS4:1;
      uint64_t CHDIS5:1;
      uint64_t CHDIS6:1;
      uint64_t CHDIS7:1;
      uint64_t CHDIS8:1;
      uint64_t CHDIS9:1;
      uint64_t CHDIS10:1;
      uint64_t CHDIS11:1;
      uint64_t CHDIS12:1;
      uint64_t CHDIS13:1;
      uint64_t CHDIS14:1;
      uint64_t CHDIS15:1;
      uint64_t CHDIS16:1;
      uint64_t CHDIS17:1;
      uint64_t CHDIS18:1;
      uint64_t CHDIS19:1;
      uint64_t CHDIS20:1;
      uint64_t CHDIS21:1;
      uint64_t CHDIS22:1;
      uint64_t CHDIS23:1;
      uint64_t CHDIS24:1;
      uint64_t CHDIS25:1;
      uint64_t CHDIS26:1;
      uint64_t CHDIS27:1;
      uint64_t CHDIS28:1;
      uint64_t CHDIS29:1;
      uint64_t CHDIS30:1;
      uint64_t CHDIS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UCDIS;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA0;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA1;

