iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res28[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA28;

  uint8_t res29[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA29;

  uint8_t res30[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA30;

  uint8_t res31[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA_bitfield:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA31;

};

#define EMIOS_0 (*(volatile struct EMIOS_0_tag *) 0xf7c38000)

struct FCCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPR:5;
      uint64_t reservedSpace0:1;
      uint64_t OPS:2;
      uint64_t reservedSpace1:1;
      uint64_t DEBUG:1;
      uint64_t reservedSpace2:19;
      uint64_t FILTER_WIDTH:2;
      uint64_t FILTER_BYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint32_t CTRLK;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t FOM:3;
      uint64_t PS:1;
      uint64_t SM:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
      uint64_t reservedSpace2:9;
      uint64_t FCCU_SET_CLEAR:2;
      uint64_t FCCU_SET_AFTER_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFC0:1;
      uint64_t RFC1:1;
      uint64_t RFC2:1;
      uint64_t RFC3:1;
      uint64_t RFC4:1;
      uint64_t RFC5:1;
      uint64_t RFC6:1;
      uint64_t RFC7:1;
      uint64_t RFC8:1;
      uint64_t RFC9:1;
      uint64_t RFC10:1;
      uint64_t RFC11:1;
      uint64_t RFC12:1;
      uint64_t RFC13:1;
      uint64_t RFC14:1;
      uint64_t RFC15:1;
      uint64_t RFC16:1;
      uint64_t RFC17:1;
      uint64_t RFC18:1;
      uint64_t RFC19:1;
      uint64_t RFC20:1;
      uint64_t RFC21:1;
      uint64_t RFC22:1;
      uint64_t RFC23:1;
      uint64_t RFC24:1;
      uint64_t RFC25:1;
      uint64_t RFC26:1;
      uint64_t RFC27:1;
      uint64_t RFC28:1;
      uint64_t RFC29:1;
      uint64_t RFC30:1;
      uint64_t RFC31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFC0:1;
      uint64_t RFC1:1;
      uint64_t RFC2:1;
      uint64_t RFC3:1;
      uint64_t RFC4:1;
      uint64_t RFC5:1;
      uint64_t RFC6:1;
      uint64_t RFC7:1;
      uint64_t RFC8:1;
      uint64_t RFC9:1;
      uint64_t RFC10:1;
      uint64_t RFC11:1;
      uint64_t RFC12:1;
      uint64_t RFC13:1;
      uint64_t RFC14:1;
      uint64_t RFC15:1;
      uint64_t RFC16:1;
      uint64_t RFC17:1;
      uint64_t RFC18:1;
      uint64_t RFC19:1;
      uint64_t RFC20:1;
      uint64_t RFC21:1;
      uint64_t RFC22:1;
      uint64_t RFC23:1;
      uint64_t RFC24:1;
      uint64_t RFC25:1;
      uint64_t RFC26:1;
      uint64_t RFC27:1;
      uint64_t RFC28:1;
      uint64_t RFC29:1;
      uint64_t RFC30:1;
      uint64_t RFC31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFC0:1;
      uint64_t RFC1:1;
      uint64_t RFC2:1;
      uint64_t RFC3:1;
      uint64_t RFC4:1;
      uint64_t RFC5:1;
      uint64_t RFC6:1;
      uint64_t RFC7:1;
      uint64_t RFC8:1;
      uint64_t RFC9:1;
      uint64_t RFC10:1;
      uint64_t RFC11:1;
      uint64_t RFC12:1;
      uint64_t RFC13:1;
      uint64_t RFC14:1;
      uint64_t RFC15:1;
      uint64_t RFC16:1;
      uint64_t RFC17:1;
      uint64_t RFC18:1;
      uint64_t RFC19:1;
      uint64_t RFC20:1;
      uint64_t RFC21:1;
      uint64_t RFC22:1;
      uint64_t RFC23:1;
      uint64_t RFC24:1;
      uint64_t RFC25:1;
      uint64_t RFC26:1;
      uint64_t RFC27:1;
      uint64_t RFC28:1;
      uint64_t RFC29:1;
      uint64_t RFC30:1;
      uint64_t RFC31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFC0:1;
      uint64_t RFC1:1;
      uint64_t RFC2:1;
      uint64_t RFC3:1;
      uint64_t RFC4:1;
      uint64_t RFC5:1;
      uint64_t RFC6:1;
      uint64_t RFC7:1;
      uint64_t RFC8:1;
      uint64_t RFC9:1;
      uint64_t RFC10:1;
      uint64_t RFC11:1;
      uint64_t RFC12:1;
      uint64_t RFC13:1;
      uint64_t RFC14:1;
      uint64_t RFC15:1;
      uint64_t RFC16:1;
      uint64_t RFC17:1;
      uint64_t RFC18:1;
      uint64_t RFC19:1;
      uint64_t RFC20:1;
      uint64_t RFC21:1;
      uint64_t RFC22:1;
      uint64_t RFC23:1;
      uint64_t RFC24:1;
      uint64_t RFC25:1;
      uint64_t RFC26:1;
      uint64_t RFC27:1;
      uint64_t RFC28:1;
      uint64_t RFC29:1;
      uint64_t RFC30:1;
      uint64_t RFC31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CFG3;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFSC0:2;
      uint64_t RFSC1:2;
      uint64_t RFSC2:2;
      uint64_t RFSC3:2;
      uint64_t RFSC4:2;
      uint64_t RFSC5:2;
      uint64_t RFSC6:2;
      uint64_t RFSC7:2;
      uint64_t RFSC8:2;
      uint64_t RFSC9:2;
      uint64_t RFSC10:2;
      uint64_t RFSC11:2;
      uint64_t RFSC12:2;
      uint64_t RFSC13:2;
      uint64_t RFSC14:2;
      uint64_t RFSC15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFS_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFSC0:2;
      uint64_t RFSC1:2;
      uint64_t RFSC2:2;
      uint64_t RFSC3:2;
      uint64_t RFSC4:2;
      uint64_t RFSC5:2;
      uint64_t RFSC6:2;
      uint64_t RFSC7:2;
      uint64_t RFSC8:2;
      uint64_t RFSC9:2;
      uint64_t RFSC10:2;
      uint64_t RFSC11:2;
      uint64_t RFSC12:2;
      uint64_t RFSC13:2;
      uint64_t RFSC14:2;
      uint64_t RFSC15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFS_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFSC0:2;
      uint64_t RFSC1:2;
      uint64_t RFSC2:2;
      uint64_t RFSC3:2;
      uint64_t RFSC4:2;
      uint64_t RFSC5:2;
      uint64_t RFSC6:2;
      uint64_t RFSC7:2;
      uint64_t RFSC8:2;
      uint64_t RFSC9:2;
      uint64_t RFSC10:2;
      uint64_t RFSC11:2;
      uint64_t RFSC12:2;
      uint64_t RFSC13:2;
      uint64_t RFSC14:2;
      uint64_t RFSC15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFS_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFSC0:2;
      uint64_t RFSC1:2;
      uint64_t RFSC2:2;
      uint64_t RFSC3:2;
      uint64_t RFSC4:2;
      uint64_t RFSC5:2;
      uint64_t RFSC6:2;
      uint64_t RFSC7:2;
      uint64_t RFSC8:2;
      uint64_t RFSC9:2;
      uint64_t RFSC10:2;
      uint64_t RFSC11:2;
      uint64_t RFSC12:2;
      uint64_t RFSC13:2;
      uint64_t RFSC14:2;
      uint64_t RFSC15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFS_CFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFSC0:2;
      uint64_t RFSC1:2;
      uint64_t RFSC2:2;
      uint64_t RFSC3:2;
      uint64_t RFSC4:2;
      uint64_t RFSC5:2;
      uint64_t RFSC6:2;
      uint64_t RFSC7:2;
      uint64_t RFSC8:2;
      uint64_t RFSC9:2;
      uint64_t RFSC10:2;
      uint64_t RFSC11:2;
      uint64_t RFSC12:2;
      uint64_t RFSC13:2;
      uint64_t RFSC14:2;
      uint64_t RFSC15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFS_CFG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFSC0:2;
      uint64_t RFSC1:2;
      uint64_t RFSC2:2;
      uint64_t RFSC3:2;
      uint64_t RFSC4:2;
      uint64_t RFSC5:2;
      uint64_t RFSC6:2;
      uint64_t RFSC7:2;
      uint64_t RFSC8:2;
      uint64_t RFSC9:2;
      uint64_t RFSC10:2;
      uint64_t RFSC11:2;
      uint64_t RFSC12:2;
      uint64_t RFSC13:2;
      uint64_t RFSC14:2;
      uint64_t RFSC15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFS_CFG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFSC0:2;
      uint64_t RFSC1:2;
      uint64_t RFSC2:2;
      uint64_t RFSC3:2;
      uint64_t RFSC4:2;
      uint64_t RFSC5:2;
      uint64_t RFSC6:2;
      uint64_t RFSC7:2;
      uint64_t RFSC8:2;
      uint64_t RFSC9:2;
      uint64_t RFSC10:2;
      uint64_t RFSC11:2;
      uint64_t RFSC12:2;
      uint64_t RFSC13:2;
      uint64_t RFSC14:2;
      uint64_t RFSC15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFS_CFG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFSC0:2;
      uint64_t RFSC1:2;
      uint64_t RFSC2:2;
      uint64_t RFSC3:2;
      uint64_t RFSC4:2;
      uint64_t RFSC5:2;
      uint64_t RFSC6:2;
      uint64_t RFSC7:2;
      uint64_t RFSC8:2;
      uint64_t RFSC9:2;
      uint64_t RFSC10:2;
      uint64_t RFSC11:2;
      uint64_t RFSC12:2;
      uint64_t RFSC13:2;
      uint64_t RFSC14:2;
      uint64_t RFSC15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFS_CFG7;

