iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFS0:1;
      uint64_t RFS1:1;
      uint64_t RFS2:1;
      uint64_t RFS3:1;
      uint64_t RFS4:1;
      uint64_t RFS5:1;
      uint64_t RFS6:1;
      uint64_t RFS7:1;
      uint64_t RFS8:1;
      uint64_t RFS9:1;
      uint64_t RFS10:1;
      uint64_t RFS11:1;
      uint64_t RFS12:1;
      uint64_t RFS13:1;
      uint64_t RFS14:1;
      uint64_t RFS15:1;
      uint64_t RFS16:1;
      uint64_t RFS17:1;
      uint64_t RFS18:1;
      uint64_t RFS19:1;
      uint64_t RFS20:1;
      uint64_t RFS21:1;
      uint64_t RFS22:1;
      uint64_t RFS23:1;
      uint64_t RFS24:1;
      uint64_t RFS25:1;
      uint64_t RFS26:1;
      uint64_t RFS27:1;
      uint64_t RFS28:1;
      uint64_t RFS29:1;
      uint64_t RFS30:1;
      uint64_t RFS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_S0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFS0:1;
      uint64_t RFS1:1;
      uint64_t RFS2:1;
      uint64_t RFS3:1;
      uint64_t RFS4:1;
      uint64_t RFS5:1;
      uint64_t RFS6:1;
      uint64_t RFS7:1;
      uint64_t RFS8:1;
      uint64_t RFS9:1;
      uint64_t RFS10:1;
      uint64_t RFS11:1;
      uint64_t RFS12:1;
      uint64_t RFS13:1;
      uint64_t RFS14:1;
      uint64_t RFS15:1;
      uint64_t RFS16:1;
      uint64_t RFS17:1;
      uint64_t RFS18:1;
      uint64_t RFS19:1;
      uint64_t RFS20:1;
      uint64_t RFS21:1;
      uint64_t RFS22:1;
      uint64_t RFS23:1;
      uint64_t RFS24:1;
      uint64_t RFS25:1;
      uint64_t RFS26:1;
      uint64_t RFS27:1;
      uint64_t RFS28:1;
      uint64_t RFS29:1;
      uint64_t RFS30:1;
      uint64_t RFS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_S1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFS0:1;
      uint64_t RFS1:1;
      uint64_t RFS2:1;
      uint64_t RFS3:1;
      uint64_t RFS4:1;
      uint64_t RFS5:1;
      uint64_t RFS6:1;
      uint64_t RFS7:1;
      uint64_t RFS8:1;
      uint64_t RFS9:1;
      uint64_t RFS10:1;
      uint64_t RFS11:1;
      uint64_t RFS12:1;
      uint64_t RFS13:1;
      uint64_t RFS14:1;
      uint64_t RFS15:1;
      uint64_t RFS16:1;
      uint64_t RFS17:1;
      uint64_t RFS18:1;
      uint64_t RFS19:1;
      uint64_t RFS20:1;
      uint64_t RFS21:1;
      uint64_t RFS22:1;
      uint64_t RFS23:1;
      uint64_t RFS24:1;
      uint64_t RFS25:1;
      uint64_t RFS26:1;
      uint64_t RFS27:1;
      uint64_t RFS28:1;
      uint64_t RFS29:1;
      uint64_t RFS30:1;
      uint64_t RFS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_S2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFS0:1;
      uint64_t RFS1:1;
      uint64_t RFS2:1;
      uint64_t RFS3:1;
      uint64_t RFS4:1;
      uint64_t RFS5:1;
      uint64_t RFS6:1;
      uint64_t RFS7:1;
      uint64_t RFS8:1;
      uint64_t RFS9:1;
      uint64_t RFS10:1;
      uint64_t RFS11:1;
      uint64_t RFS12:1;
      uint64_t RFS13:1;
      uint64_t RFS14:1;
      uint64_t RFS15:1;
      uint64_t RFS16:1;
      uint64_t RFS17:1;
      uint64_t RFS18:1;
      uint64_t RFS19:1;
      uint64_t RFS20:1;
      uint64_t RFS21:1;
      uint64_t RFS22:1;
      uint64_t RFS23:1;
      uint64_t RFS24:1;
      uint64_t RFS25:1;
      uint64_t RFS26:1;
      uint64_t RFS27:1;
      uint64_t RFS28:1;
      uint64_t RFS29:1;
      uint64_t RFS30:1;
      uint64_t RFS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_S3;

  uint32_t RFK;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFE0:1;
      uint64_t RFE1:1;
      uint64_t RFE2:1;
      uint64_t RFE3:1;
      uint64_t RFE4:1;
      uint64_t RFE5:1;
      uint64_t RFE6:1;
      uint64_t RFE7:1;
      uint64_t RFE8:1;
      uint64_t RFE9:1;
      uint64_t RFE10:1;
      uint64_t RFE11:1;
      uint64_t RFE12:1;
      uint64_t RFE13:1;
      uint64_t RFE14:1;
      uint64_t RFE15:1;
      uint64_t RFE16:1;
      uint64_t RFE17:1;
      uint64_t RFE18:1;
      uint64_t RFE19:1;
      uint64_t RFE20:1;
      uint64_t RFE21:1;
      uint64_t RFE22:1;
      uint64_t RFE23:1;
      uint64_t RFE24:1;
      uint64_t RFE25:1;
      uint64_t RFE26:1;
      uint64_t RFE27:1;
      uint64_t RFE28:1;
      uint64_t RFE29:1;
      uint64_t RFE30:1;
      uint64_t RFE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_E0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFE0:1;
      uint64_t RFE1:1;
      uint64_t RFE2:1;
      uint64_t RFE3:1;
      uint64_t RFE4:1;
      uint64_t RFE5:1;
      uint64_t RFE6:1;
      uint64_t RFE7:1;
      uint64_t RFE8:1;
      uint64_t RFE9:1;
      uint64_t RFE10:1;
      uint64_t RFE11:1;
      uint64_t RFE12:1;
      uint64_t RFE13:1;
      uint64_t RFE14:1;
      uint64_t RFE15:1;
      uint64_t RFE16:1;
      uint64_t RFE17:1;
      uint64_t RFE18:1;
      uint64_t RFE19:1;
      uint64_t RFE20:1;
      uint64_t RFE21:1;
      uint64_t RFE22:1;
      uint64_t RFE23:1;
      uint64_t RFE24:1;
      uint64_t RFE25:1;
      uint64_t RFE26:1;
      uint64_t RFE27:1;
      uint64_t RFE28:1;
      uint64_t RFE29:1;
      uint64_t RFE30:1;
      uint64_t RFE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_E1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFE0:1;
      uint64_t RFE1:1;
      uint64_t RFE2:1;
      uint64_t RFE3:1;
      uint64_t RFE4:1;
      uint64_t RFE5:1;
      uint64_t RFE6:1;
      uint64_t RFE7:1;
      uint64_t RFE8:1;
      uint64_t RFE9:1;
      uint64_t RFE10:1;
      uint64_t RFE11:1;
      uint64_t RFE12:1;
      uint64_t RFE13:1;
      uint64_t RFE14:1;
      uint64_t RFE15:1;
      uint64_t RFE16:1;
      uint64_t RFE17:1;
      uint64_t RFE18:1;
      uint64_t RFE19:1;
      uint64_t RFE20:1;
      uint64_t RFE21:1;
      uint64_t RFE22:1;
      uint64_t RFE23:1;
      uint64_t RFE24:1;
      uint64_t RFE25:1;
      uint64_t RFE26:1;
      uint64_t RFE27:1;
      uint64_t RFE28:1;
      uint64_t RFE29:1;
      uint64_t RFE30:1;
      uint64_t RFE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_E2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFE0:1;
      uint64_t RFE1:1;
      uint64_t RFE2:1;
      uint64_t RFE3:1;
      uint64_t RFE4:1;
      uint64_t RFE5:1;
      uint64_t RFE6:1;
      uint64_t RFE7:1;
      uint64_t RFE8:1;
      uint64_t RFE9:1;
      uint64_t RFE10:1;
      uint64_t RFE11:1;
      uint64_t RFE12:1;
      uint64_t RFE13:1;
      uint64_t RFE14:1;
      uint64_t RFE15:1;
      uint64_t RFE16:1;
      uint64_t RFE17:1;
      uint64_t RFE18:1;
      uint64_t RFE19:1;
      uint64_t RFE20:1;
      uint64_t RFE21:1;
      uint64_t RFE22:1;
      uint64_t RFE23:1;
      uint64_t RFE24:1;
      uint64_t RFE25:1;
      uint64_t RFE26:1;
      uint64_t RFE27:1;
      uint64_t RFE28:1;
      uint64_t RFE29:1;
      uint64_t RFE30:1;
      uint64_t RFE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_E3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFTOE0:1;
      uint64_t RFTOE1:1;
      uint64_t RFTOE2:1;
      uint64_t RFTOE3:1;
      uint64_t RFTOE4:1;
      uint64_t RFTOE5:1;
      uint64_t RFTOE6:1;
      uint64_t RFTOE7:1;
      uint64_t RFTOE8:1;
      uint64_t RFTOE9:1;
      uint64_t RFTOE10:1;
      uint64_t RFTOE11:1;
      uint64_t RFTOE12:1;
      uint64_t RFTOE13:1;
      uint64_t RFTOE14:1;
      uint64_t RFTOE15:1;
      uint64_t RFTOE16:1;
      uint64_t RFTOE17:1;
      uint64_t RFTOE18:1;
      uint64_t RFTOE19:1;
      uint64_t RFTOE20:1;
      uint64_t RFTOE21:1;
      uint64_t RFTOE22:1;
      uint64_t RFTOE23:1;
      uint64_t RFTOE24:1;
      uint64_t RFTOE25:1;
      uint64_t RFTOE26:1;
      uint64_t RFTOE27:1;
      uint64_t RFTOE28:1;
      uint64_t RFTOE29:1;
      uint64_t RFTOE30:1;
      uint64_t RFTOE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_TOE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFTOE0:1;
      uint64_t RFTOE1:1;
      uint64_t RFTOE2:1;
      uint64_t RFTOE3:1;
      uint64_t RFTOE4:1;
      uint64_t RFTOE5:1;
      uint64_t RFTOE6:1;
      uint64_t RFTOE7:1;
      uint64_t RFTOE8:1;
      uint64_t RFTOE9:1;
      uint64_t RFTOE10:1;
      uint64_t RFTOE11:1;
      uint64_t RFTOE12:1;
      uint64_t RFTOE13:1;
      uint64_t RFTOE14:1;
      uint64_t RFTOE15:1;
      uint64_t RFTOE16:1;
      uint64_t RFTOE17:1;
      uint64_t RFTOE18:1;
      uint64_t RFTOE19:1;
      uint64_t RFTOE20:1;
      uint64_t RFTOE21:1;
      uint64_t RFTOE22:1;
      uint64_t RFTOE23:1;
      uint64_t RFTOE24:1;
      uint64_t RFTOE25:1;
      uint64_t RFTOE26:1;
      uint64_t RFTOE27:1;
      uint64_t RFTOE28:1;
      uint64_t RFTOE29:1;
      uint64_t RFTOE30:1;
      uint64_t RFTOE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_TOE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFTOE0:1;
      uint64_t RFTOE1:1;
      uint64_t RFTOE2:1;
      uint64_t RFTOE3:1;
      uint64_t RFTOE4:1;
      uint64_t RFTOE5:1;
      uint64_t RFTOE6:1;
      uint64_t RFTOE7:1;
      uint64_t RFTOE8:1;
      uint64_t RFTOE9:1;
      uint64_t RFTOE10:1;
      uint64_t RFTOE11:1;
      uint64_t RFTOE12:1;
      uint64_t RFTOE13:1;
      uint64_t RFTOE14:1;
      uint64_t RFTOE15:1;
      uint64_t RFTOE16:1;
      uint64_t RFTOE17:1;
      uint64_t RFTOE18:1;
      uint64_t RFTOE19:1;
      uint64_t RFTOE20:1;
      uint64_t RFTOE21:1;
      uint64_t RFTOE22:1;
      uint64_t RFTOE23:1;
      uint64_t RFTOE24:1;
      uint64_t RFTOE25:1;
      uint64_t RFTOE26:1;
      uint64_t RFTOE27:1;
      uint64_t RFTOE28:1;
      uint64_t RFTOE29:1;
      uint64_t RFTOE30:1;
      uint64_t RFTOE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_TOE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFTOE0:1;
      uint64_t RFTOE1:1;
      uint64_t RFTOE2:1;
      uint64_t RFTOE3:1;
      uint64_t RFTOE4:1;
      uint64_t RFTOE5:1;
      uint64_t RFTOE6:1;
      uint64_t RFTOE7:1;
      uint64_t RFTOE8:1;
      uint64_t RFTOE9:1;
      uint64_t RFTOE10:1;
      uint64_t RFTOE11:1;
      uint64_t RFTOE12:1;
      uint64_t RFTOE13:1;
      uint64_t RFTOE14:1;
      uint64_t RFTOE15:1;
      uint64_t RFTOE16:1;
      uint64_t RFTOE17:1;
      uint64_t RFTOE18:1;
      uint64_t RFTOE19:1;
      uint64_t RFTOE20:1;
      uint64_t RFTOE21:1;
      uint64_t RFTOE22:1;
      uint64_t RFTOE23:1;
      uint64_t RFTOE24:1;
      uint64_t RFTOE25:1;
      uint64_t RFTOE26:1;
      uint64_t RFTOE27:1;
      uint64_t RFTOE28:1;
      uint64_t RFTOE29:1;
      uint64_t RFTOE30:1;
      uint64_t RFTOE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_TOE3;

  uint32_t RF_TO;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_TO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUT0:1;
      uint64_t EOUT1:1;
      uint64_t reservedSpace0:2;
      uint64_t EIN0:1;
      uint64_t EIN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EINOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:3;
      uint64_t ESTAT:1;
      uint64_t PhysicErrorPin:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NAFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) N2AF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFFS:8;
      uint64_t AF_SRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A2FF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFFS:8;
      uint64_t NF_SRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) N2FF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F2A_STATUS;

