iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRFC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_TO_STAT:1;
      uint64_t ALRM_STAT:1;
      uint64_t NMI_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_TO_IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_EN;

  uint32_t XTMR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCS0:4;
      uint64_t reservedSpace0:2;
      uint64_t FS0:1;
      uint64_t VL0:1;
      uint64_t MCS1:4;
      uint64_t reservedSpace1:2;
      uint64_t FS1:1;
      uint64_t VL1:1;
      uint64_t MCS2:4;
      uint64_t reservedSpace2:2;
      uint64_t FS2:1;
      uint64_t VL2:1;
      uint64_t MCS3:4;
      uint64_t reservedSpace3:2;
      uint64_t FS3:1;
      uint64_t VL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRANS_LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERMNTKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERMNT_LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DELTA_T_VAL:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DELTA_T;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQEN0:1;
      uint64_t IRQEN1:1;
      uint64_t IRQEN2:1;
      uint64_t IRQEN3:1;
      uint64_t IRQEN4:1;
      uint64_t IRQEN5:1;
      uint64_t IRQEN6:1;
      uint64_t IRQEN7:1;
      uint64_t IRQEN8:1;
      uint64_t IRQEN9:1;
      uint64_t IRQEN10:1;
      uint64_t IRQEN11:1;
      uint64_t IRQEN12:1;
      uint64_t IRQEN13:1;
      uint64_t IRQEN14:1;
      uint64_t IRQEN15:1;
      uint64_t IRQEN16:1;
      uint64_t IRQEN17:1;
      uint64_t IRQEN18:1;
      uint64_t IRQEN19:1;
      uint64_t IRQEN20:1;
      uint64_t IRQEN21:1;
      uint64_t IRQEN22:1;
      uint64_t IRQEN23:1;
      uint64_t IRQEN24:1;
      uint64_t IRQEN25:1;
      uint64_t IRQEN26:1;
      uint64_t IRQEN27:1;
      uint64_t IRQEN28:1;
      uint64_t IRQEN29:1;
      uint64_t IRQEN30:1;
      uint64_t IRQEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_ALARM_EN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQEN0:1;
      uint64_t IRQEN1:1;
      uint64_t IRQEN2:1;
      uint64_t IRQEN3:1;
      uint64_t IRQEN4:1;
      uint64_t IRQEN5:1;
      uint64_t IRQEN6:1;
      uint64_t IRQEN7:1;
      uint64_t IRQEN8:1;
      uint64_t IRQEN9:1;
      uint64_t IRQEN10:1;
      uint64_t IRQEN11:1;
      uint64_t IRQEN12:1;
      uint64_t IRQEN13:1;
      uint64_t IRQEN14:1;
      uint64_t IRQEN15:1;
      uint64_t IRQEN16:1;
      uint64_t IRQEN17:1;
      uint64_t IRQEN18:1;
      uint64_t IRQEN19:1;
      uint64_t IRQEN20:1;
      uint64_t IRQEN21:1;
      uint64_t IRQEN22:1;
      uint64_t IRQEN23:1;
      uint64_t IRQEN24:1;
      uint64_t IRQEN25:1;
      uint64_t IRQEN26:1;
      uint64_t IRQEN27:1;
      uint64_t IRQEN28:1;
      uint64_t IRQEN29:1;
      uint64_t IRQEN30:1;
      uint64_t IRQEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_ALARM_EN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQEN0:1;
      uint64_t IRQEN1:1;
      uint64_t IRQEN2:1;
      uint64_t IRQEN3:1;
      uint64_t IRQEN4:1;
      uint64_t IRQEN5:1;
      uint64_t IRQEN6:1;
      uint64_t IRQEN7:1;
      uint64_t IRQEN8:1;
      uint64_t IRQEN9:1;
      uint64_t IRQEN10:1;
      uint64_t IRQEN11:1;
      uint64_t IRQEN12:1;
      uint64_t IRQEN13:1;
      uint64_t IRQEN14:1;
      uint64_t IRQEN15:1;
      uint64_t IRQEN16:1;
      uint64_t IRQEN17:1;
      uint64_t IRQEN18:1;
      uint64_t IRQEN19:1;
      uint64_t IRQEN20:1;
      uint64_t IRQEN21:1;
      uint64_t IRQEN22:1;
      uint64_t IRQEN23:1;
      uint64_t IRQEN24:1;
      uint64_t IRQEN25:1;
      uint64_t IRQEN26:1;
      uint64_t IRQEN27:1;
      uint64_t IRQEN28:1;
      uint64_t IRQEN29:1;
      uint64_t IRQEN30:1;
      uint64_t IRQEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_ALARM_EN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQEN0:1;
      uint64_t IRQEN1:1;
      uint64_t IRQEN2:1;
      uint64_t IRQEN3:1;
      uint64_t IRQEN4:1;
      uint64_t IRQEN5:1;
      uint64_t IRQEN6:1;
      uint64_t IRQEN7:1;
      uint64_t IRQEN8:1;
      uint64_t IRQEN9:1;
      uint64_t IRQEN10:1;
      uint64_t IRQEN11:1;
      uint64_t IRQEN12:1;
      uint64_t IRQEN13:1;
      uint64_t IRQEN14:1;
      uint64_t IRQEN15:1;
      uint64_t IRQEN16:1;
      uint64_t IRQEN17:1;
      uint64_t IRQEN18:1;
      uint64_t IRQEN19:1;
      uint64_t IRQEN20:1;
      uint64_t IRQEN21:1;
      uint64_t IRQEN22:1;
      uint64_t IRQEN23:1;
      uint64_t IRQEN24:1;
      uint64_t IRQEN25:1;
      uint64_t IRQEN26:1;
      uint64_t IRQEN27:1;
      uint64_t IRQEN28:1;
      uint64_t IRQEN29:1;
      uint64_t IRQEN30:1;
      uint64_t IRQEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_ALARM_EN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIEN0:1;
      uint64_t NMIEN1:1;
      uint64_t NMIEN2:1;
      uint64_t NMIEN3:1;
      uint64_t NMIEN4:1;
      uint64_t NMIEN5:1;
      uint64_t NMIEN6:1;
      uint64_t NMIEN7:1;
      uint64_t NMIEN8:1;
      uint64_t NMIEN9:1;
      uint64_t NMIEN10:1;
      uint64_t NMIEN11:1;
      uint64_t NMIEN12:1;
      uint64_t NMIEN13:1;
      uint64_t NMIEN14:1;
      uint64_t NMIEN15:1;
      uint64_t NMIEN16:1;
      uint64_t NMIEN17:1;
      uint64_t NMIEN18:1;
      uint64_t NMIEN19:1;
      uint64_t NMIEN20:1;
      uint64_t NMIEN21:1;
      uint64_t NMIEN22:1;
      uint64_t NMIEN23:1;
      uint64_t NMIEN24:1;
      uint64_t NMIEN25:1;
      uint64_t NMIEN26:1;
      uint64_t NMIEN27:1;
      uint64_t NMIEN28:1;
      uint64_t NMIEN29:1;
      uint64_t NMIEN30:1;
      uint64_t NMIEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_EN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIEN0:1;
      uint64_t NMIEN1:1;
      uint64_t NMIEN2:1;
      uint64_t NMIEN3:1;
      uint64_t NMIEN4:1;
      uint64_t NMIEN5:1;
      uint64_t NMIEN6:1;
      uint64_t NMIEN7:1;
      uint64_t NMIEN8:1;
      uint64_t NMIEN9:1;
      uint64_t NMIEN10:1;
      uint64_t NMIEN11:1;
      uint64_t NMIEN12:1;
      uint64_t NMIEN13:1;
      uint64_t NMIEN14:1;
      uint64_t NMIEN15:1;
      uint64_t NMIEN16:1;
      uint64_t NMIEN17:1;
      uint64_t NMIEN18:1;
      uint64_t NMIEN19:1;
      uint64_t NMIEN20:1;
      uint64_t NMIEN21:1;
      uint64_t NMIEN22:1;
      uint64_t NMIEN23:1;
      uint64_t NMIEN24:1;
      uint64_t NMIEN25:1;
      uint64_t NMIEN26:1;
      uint64_t NMIEN27:1;
      uint64_t NMIEN28:1;
      uint64_t NMIEN29:1;
      uint64_t NMIEN30:1;
      uint64_t NMIEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_EN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIEN0:1;
      uint64_t NMIEN1:1;
      uint64_t NMIEN2:1;
      uint64_t NMIEN3:1;
      uint64_t NMIEN4:1;
      uint64_t NMIEN5:1;
      uint64_t NMIEN6:1;
      uint64_t NMIEN7:1;
      uint64_t NMIEN8:1;
      uint64_t NMIEN9:1;
      uint64_t NMIEN10:1;
      uint64_t NMIEN11:1;
      uint64_t NMIEN12:1;
      uint64_t NMIEN13:1;
      uint64_t NMIEN14:1;
      uint64_t NMIEN15:1;
      uint64_t NMIEN16:1;
      uint64_t NMIEN17:1;
      uint64_t NMIEN18:1;
      uint64_t NMIEN19:1;
      uint64_t NMIEN20:1;
      uint64_t NMIEN21:1;
      uint64_t NMIEN22:1;
      uint64_t NMIEN23:1;
      uint64_t NMIEN24:1;
      uint64_t NMIEN25:1;
      uint64_t NMIEN26:1;
      uint64_t NMIEN27:1;
      uint64_t NMIEN28:1;
      uint64_t NMIEN29:1;
      uint64_t NMIEN30:1;
      uint64_t NMIEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_EN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIEN0:1;
      uint64_t NMIEN1:1;
      uint64_t NMIEN2:1;
      uint64_t NMIEN3:1;
      uint64_t NMIEN4:1;
      uint64_t NMIEN5:1;
      uint64_t NMIEN6:1;
      uint64_t NMIEN7:1;
      uint64_t NMIEN8:1;
      uint64_t NMIEN9:1;
      uint64_t NMIEN10:1;
      uint64_t NMIEN11:1;
      uint64_t NMIEN12:1;
      uint64_t NMIEN13:1;
      uint64_t NMIEN14:1;
      uint64_t NMIEN15:1;
      uint64_t NMIEN16:1;
      uint64_t NMIEN17:1;
      uint64_t NMIEN18:1;
      uint64_t NMIEN19:1;
      uint64_t NMIEN20:1;
      uint64_t NMIEN21:1;
      uint64_t NMIEN22:1;
      uint64_t NMIEN23:1;
      uint64_t NMIEN24:1;
      uint64_t NMIEN25:1;
      uint64_t NMIEN26:1;
      uint64_t NMIEN27:1;
      uint64_t NMIEN28:1;
      uint64_t NMIEN29:1;
      uint64_t NMIEN30:1;
      uint64_t NMIEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_EN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUTEN0:1;
      uint64_t EOUTEN1:1;
      uint64_t EOUTEN2:1;
      uint64_t EOUTEN3:1;
      uint64_t EOUTEN4:1;
      uint64_t EOUTEN5:1;
      uint64_t EOUTEN6:1;
      uint64_t EOUTEN7:1;
      uint64_t EOUTEN8:1;
      uint64_t EOUTEN9:1;
      uint64_t EOUTEN10:1;
      uint64_t EOUTEN11:1;
      uint64_t EOUTEN12:1;
      uint64_t EOUTEN13:1;
      uint64_t EOUTEN14:1;
      uint64_t EOUTEN15:1;
      uint64_t EOUTEN16:1;
      uint64_t EOUTEN17:1;
      uint64_t EOUTEN18:1;
      uint64_t EOUTEN19:1;
      uint64_t EOUTEN20:1;
      uint64_t EOUTEN21:1;
      uint64_t EOUTEN22:1;
      uint64_t EOUTEN23:1;
      uint64_t EOUTEN24:1;
      uint64_t EOUTEN25:1;
      uint64_t EOUTEN26:1;
      uint64_t EOUTEN27:1;
      uint64_t EOUTEN28:1;
      uint64_t EOUTEN29:1;
      uint64_t EOUTEN30:1;
      uint64_t EOUTEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOUT_SIG_EN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUTEN0:1;
      uint64_t EOUTEN1:1;
      uint64_t EOUTEN2:1;
      uint64_t EOUTEN3:1;
      uint64_t EOUTEN4:1;
      uint64_t EOUTEN5:1;
      uint64_t EOUTEN6:1;
      uint64_t EOUTEN7:1;
      uint64_t EOUTEN8:1;
      uint64_t EOUTEN9:1;
      uint64_t EOUTEN10:1;
      uint64_t EOUTEN11:1;
      uint64_t EOUTEN12:1;
      uint64_t EOUTEN13:1;
      uint64_t EOUTEN14:1;
      uint64_t EOUTEN15:1;
      uint64_t EOUTEN16:1;
      uint64_t EOUTEN17:1;
      uint64_t EOUTEN18:1;
      uint64_t EOUTEN19:1;
      uint64_t EOUTEN20:1;
      uint64_t EOUTEN21:1;
      uint64_t EOUTEN22:1;
      uint64_t EOUTEN23:1;
      uint64_t EOUTEN24:1;
      uint64_t EOUTEN25:1;
      uint64_t EOUTEN26:1;
      uint64_t EOUTEN27:1;
      uint64_t EOUTEN28:1;
      uint64_t EOUTEN29:1;
      uint64_t EOUTEN30:1;
      uint64_t EOUTEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOUT_SIG_EN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUTEN0:1;
      uint64_t EOUTEN1:1;
      uint64_t EOUTEN2:1;
      uint64_t EOUTEN3:1;
      uint64_t EOUTEN4:1;
      uint64_t EOUTEN5:1;
      uint64_t EOUTEN6:1;
      uint64_t EOUTEN7:1;
      uint64_t EOUTEN8:1;
      uint64_t EOUTEN9:1;
      uint64_t EOUTEN10:1;
      uint64_t EOUTEN11:1;
      uint64_t EOUTEN12:1;
      uint64_t EOUTEN13:1;
      uint64_t EOUTEN14:1;
      uint64_t EOUTEN15:1;
      uint64_t EOUTEN16:1;
      uint64_t EOUTEN17:1;
      uint64_t EOUTEN18:1;
      uint64_t EOUTEN19:1;
      uint64_t EOUTEN20:1;
      uint64_t EOUTEN21:1;
      uint64_t EOUTEN22:1;
      uint64_t EOUTEN23:1;
      uint64_t EOUTEN24:1;
      uint64_t EOUTEN25:1;
      uint64_t EOUTEN26:1;
      uint64_t EOUTEN27:1;
      uint64_t EOUTEN28:1;
      uint64_t EOUTEN29:1;
      uint64_t EOUTEN30:1;
      uint64_t EOUTEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOUT_SIG_EN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUTEN0:1;
      uint64_t EOUTEN1:1;
      uint64_t EOUTEN2:1;
      uint64_t EOUTEN3:1;
      uint64_t EOUTEN4:1;
      uint64_t EOUTEN5:1;
      uint64_t EOUTEN6:1;
      uint64_t EOUTEN7:1;
      uint64_t EOUTEN8:1;
      uint64_t EOUTEN9:1;
      uint64_t EOUTEN10:1;
      uint64_t EOUTEN11:1;
      uint64_t EOUTEN12:1;
      uint64_t EOUTEN13:1;
      uint64_t EOUTEN14:1;
      uint64_t EOUTEN15:1;
      uint64_t EOUTEN16:1;
      uint64_t EOUTEN17:1;
      uint64_t EOUTEN18:1;
      uint64_t EOUTEN19:1;
      uint64_t EOUTEN20:1;
      uint64_t EOUTEN21:1;
      uint64_t EOUTEN22:1;
      uint64_t EOUTEN23:1;
      uint64_t EOUTEN24:1;
      uint64_t EOUTEN25:1;
      uint64_t EOUTEN26:1;
      uint64_t EOUTEN27:1;
      uint64_t EOUTEN28:1;
      uint64_t EOUTEN29:1;
      uint64_t EOUTEN30:1;
      uint64_t EOUTEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOUT_SIG_EN3;

