iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define FCCU (*(volatile struct FCCU_tag *) 0xfbf58000)

struct FLASH_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHV:1;
      uint64_t ESUS:1;
      uint64_t ERS:1;
      uint64_t PSUS:1;
      uint64_t PGM:1;
      uint64_t reservedSpace0:2;
      uint64_t FERS:1;
      uint64_t PECIE:1;
      uint64_t PEG:1;
      uint64_t DONE:1;
      uint64_t PEAS:1;
      uint64_t RE:1;
      uint64_t SBC:1;
      uint64_t RWE:1;
      uint64_t EER:1;
      uint64_t PES:1;
      uint64_t PEP:1;
      uint64_t LSW:1;
      uint64_t SAK:1;
      uint64_t SBC1:1;
      uint64_t reservedSpace1:3;
      uint64_t DWEE:2;
      uint64_t reservedSpace2:2;
      uint64_t EEE:1;
      uint64_t AEE:1;
      uint64_t RRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t N16KL:3;
      uint64_t N32KL:2;
      uint64_t N64KL:3;
      uint64_t N16KM:3;
      uint64_t N32KM:2;
      uint64_t N64KM:3;
      uint64_t N16KH:3;
      uint64_t N32KH:2;
      uint64_t N64KH:3;
      uint64_t N256K:5;
      uint64_t N128KL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRE;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t reservedSpace0:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1;

  uint32_t LOCK2;
  uint32_t LOCK3;
  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDSEL:16;
      uint64_t LOWSEL:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHSEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL1;

  uint32_t SEL2;
  uint32_t SEL3;
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PAR:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDR:21;
      uint64_t reservedSpace1:7;
      uint64_t SAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AID:1;
      uint64_t AIE:1;
      uint64_t AIS:1;
      uint64_t reservedSpace0:1;
      uint64_t MRV:1;
      uint64_t MRE:1;
      uint64_t AISUS:1;
      uint64_t reservedSpace1:1;
      uint64_t AIBPE:1;
      uint64_t NAIBP:1;
      uint64_t reservedSpace2:2;
      uint64_t VTD:1;
      uint64_t reservedSpace3:3;
      uint64_t CPE:1;
      uint64_t CPA:1;
      uint64_t CPR:1;
      uint64_t reservedSpace4:4;
      uint64_t SBCE1:1;
      uint64_t reservedSpace5:6;
      uint64_t SBCE:1;
      uint64_t UTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR0:1;
      uint64_t MISR1:1;
      uint64_t MISR2:1;
      uint64_t MISR3:1;
      uint64_t MISR4:1;
      uint64_t MISR5:1;
      uint64_t MISR6:1;
      uint64_t MISR7:1;
      uint64_t MISR8:1;
      uint64_t MISR9:1;
      uint64_t MISR10:1;
      uint64_t MISR11:1;
      uint64_t MISR12:1;
      uint64_t MISR13:1;
      uint64_t MISR14:1;
      uint64_t MISR15:1;
      uint64_t MISR16:1;
      uint64_t MISR17:1;
      uint64_t MISR18:1;
      uint64_t MISR19:1;
      uint64_t MISR20:1;
      uint64_t MISR21:1;
      uint64_t MISR22:1;
      uint64_t MISR23:1;
      uint64_t MISR24:1;
      uint64_t MISR25:1;
      uint64_t MISR26:1;
      uint64_t MISR27:1;
      uint64_t MISR28:1;
      uint64_t MISR29:1;
      uint64_t MISR30:1;
      uint64_t MISR31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR32:1;
      uint64_t MISR33:1;
      uint64_t MISR34:1;
      uint64_t MISR35:1;
      uint64_t MISR36:1;
      uint64_t MISR37:1;
      uint64_t MISR38:1;
      uint64_t MISR39:1;
      uint64_t MISR40:1;
      uint64_t MISR41:1;
      uint64_t MISR42:1;
      uint64_t MISR43:1;
      uint64_t MISR44:1;
      uint64_t MISR45:1;
      uint64_t MISR46:1;
      uint64_t MISR47:1;
      uint64_t MISR48:1;
      uint64_t MISR49:1;
      uint64_t MISR50:1;
      uint64_t MISR51:1;
      uint64_t MISR52:1;
      uint64_t MISR53:1;
      uint64_t MISR54:1;
      uint64_t MISR55:1;
      uint64_t MISR56:1;
      uint64_t MISR57:1;
      uint64_t MISR58:1;
      uint64_t MISR59:1;
      uint64_t MISR60:1;
      uint64_t MISR61:1;
      uint64_t MISR62:1;
      uint64_t MISR63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR64:1;
      uint64_t MISR65:1;
      uint64_t MISR66:1;
      uint64_t MISR67:1;
      uint64_t MISR68:1;
      uint64_t MISR69:1;
      uint64_t MISR70:1;
      uint64_t MISR71:1;
      uint64_t MISR72:1;
      uint64_t MISR73:1;
      uint64_t MISR74:1;
      uint64_t MISR75:1;
      uint64_t MISR76:1;
      uint64_t MISR77:1;
      uint64_t MISR78:1;
      uint64_t MISR79:1;
      uint64_t MISR80:1;
      uint64_t MISR81:1;
      uint64_t MISR82:1;
      uint64_t MISR83:1;
      uint64_t MISR84:1;
      uint64_t MISR85:1;
      uint64_t MISR86:1;
      uint64_t MISR87:1;
      uint64_t MISR88:1;
      uint64_t MISR89:1;
      uint64_t MISR90:1;
      uint64_t MISR91:1;
      uint64_t MISR92:1;
      uint64_t MISR93:1;
      uint64_t MISR94:1;
      uint64_t MISR95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR96:1;
      uint64_t MISR97:1;
      uint64_t MISR98:1;
      uint64_t MISR99:1;
      uint64_t MISR100:1;
      uint64_t MISR101:1;
      uint64_t MISR102:1;
      uint64_t MISR103:1;
      uint64_t MISR104:1;
      uint64_t MISR105:1;
      uint64_t MISR106:1;
      uint64_t MISR107:1;
      uint64_t MISR108:1;
      uint64_t MISR109:1;
      uint64_t MISR110:1;
      uint64_t MISR111:1;
      uint64_t MISR112:1;
      uint64_t MISR113:1;
      uint64_t MISR114:1;
      uint64_t MISR115:1;
      uint64_t MISR116:1;
      uint64_t MISR117:1;
      uint64_t MISR118:1;
      uint64_t MISR119:1;
      uint64_t MISR120:1;
      uint64_t MISR121:1;
      uint64_t MISR122:1;
      uint64_t MISR123:1;
      uint64_t MISR124:1;
      uint64_t MISR125:1;
      uint64_t MISR126:1;
      uint64_t MISR127:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM3;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR256:1;
      uint64_t MISR257:1;
      uint64_t MISR258:1;
      uint64_t MISR259:1;
      uint64_t MISR260:1;
      uint64_t MISR261:1;
      uint64_t MISR262:1;
      uint64_t MISR263:1;
      uint64_t MISR264:1;
      uint64_t MISR265:1;
      uint64_t MISR266:1;
      uint64_t MISR267:1;
      uint64_t MISR268:1;
      uint64_t MISR269:1;
      uint64_t MISR270:1;
      uint64_t MISR271:1;
      uint64_t MISR272:1;
      uint64_t MISR273:1;
      uint64_t MISR274:1;
      uint64_t MISR275:1;
      uint64_t MISR276:1;
      uint64_t MISR277:1;
      uint64_t MISR278:1;
      uint64_t MISR279:1;
      uint64_t MISR280:1;
      uint64_t MISR281:1;
      uint64_t MISR282:1;
      uint64_t MISR283:1;
      uint64_t MISR284:1;
      uint64_t MISR285:1;
      uint64_t MISR286:1;
      uint64_t MISR287:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR288:1;
      uint64_t MISR289:1;
      uint64_t MISR290:1;
      uint64_t MISR291:1;
      uint64_t MISR292:1;
      uint64_t MISR293:1;
      uint64_t MISR294:1;
      uint64_t MISR295:1;
      uint64_t MISR296:1;
      uint64_t MISR297:1;
      uint64_t MISR298:1;
      uint64_t MISR299:1;
      uint64_t MISR300:1;
      uint64_t MISR301:1;
      uint64_t MISR302:1;
      uint64_t MISR303:1;
      uint64_t MISR304:1;
      uint64_t MISR305:1;
      uint64_t MISR306:1;
      uint64_t MISR307:1;
      uint64_t MISR308:1;
      uint64_t MISR309:1;
      uint64_t MISR310:1;
      uint64_t MISR311:1;
      uint64_t MISR312:1;
      uint64_t MISR313:1;
      uint64_t MISR314:1;
      uint64_t MISR315:1;
      uint64_t MISR316:1;
      uint64_t MISR317:1;
      uint64_t MISR318:1;
      uint64_t MISR319:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDOPP:16;
      uint64_t LOWOPP:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHOPP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPP1;

  uint32_t OPP2;
  uint32_t OPP3;
  uint32_t TMD;
  uint8_t res5[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDELOCK:16;
      uint64_t LOWELOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELOCK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHELOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELOCK1;

