iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint32_t ELOCK2;
  uint32_t ELOCK3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDPLOCK:16;
      uint64_t LOWPLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLOCK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHPLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLOCK1;

  uint32_t PLOCK2;
  uint32_t PLOCK3;
};

#define FLASH_0 (*(volatile struct FLASH_0_tag *) 0xf7fe0000)

struct IIC_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBAD;

  uint8_t IBFD;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DMAEN:1;
      uint64_t RSTA:1;
      uint64_t NOACK:1;
      uint64_t TXRX:1;
      uint64_t MSSL:1;
      uint64_t IBIE:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXAK:1;
      uint64_t IBIF:1;
      uint64_t SRW:1;
      uint64_t reservedSpace0:1;
      uint64_t IBAL:1;
      uint64_t IBB:1;
      uint64_t IAAS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBSR;

  uint8_t IBDR;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t BYTERXIE:1;
      uint64_t BIIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBIC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IPG_DEBUG_EN:1;
      uint64_t IPG_DEBUG_HALTED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IBDBG;

};

#define IIC_0 (*(volatile struct IIC_0_tag *) 0xf7e68000)

struct IMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_LOCK:1;
      uint64_t reservedSpace0:7;
      uint64_t WRITE_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARRAY_SLCT:6;
      uint64_t reservedSpace0:10;
      uint64_t ROW_SLCT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLCT;

  uint32_t WRITE_UNLOCK;
  uint32_t READ_UNLOCK;
  uint8_t res0[20];

  uint32_t WRITE_DATA_4;
  uint32_t WRITE_DATA_3;
  uint32_t WRITE_DATA_2;
  uint32_t WRITE_DATA_1;
  uint32_t WRITE_DATA_0;
  uint8_t res1[12];

  uint32_t READ_DATA_4;
  uint32_t READ_DATA_3;
  uint32_t READ_DATA_2;
  uint32_t READ_DATA_1;
  uint32_t READ_DATA_0;
};

#define IMA (*(volatile struct IMA_tag *) 0xf7f54000)

struct INTC_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HVEN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPR0;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INTVEC:10;
      uint64_t VTBA:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IACKR0;

  uint8_t res2[12];

  uint32_t EOIR0;
  uint8_t res3[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR0_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR1_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR2_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR3_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR4_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR5_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR6_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR7_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR8_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR9_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR10_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR11_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR12_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR13_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR14_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR15_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR16_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR17_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR18_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR19_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR20_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR21_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR22_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR23_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR24_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR25_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR26_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR27_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR28_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR29_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR30_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:9;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR31_NOSWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR32_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR33_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR34_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR35_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR36_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR37_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR38_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR39_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR40_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR41_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR42_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR43_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR44_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR45_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR46_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR47_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR48_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR49_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR50_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR51_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR52_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR53_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR54_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR55_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR56_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR57_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR58_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR59_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR60_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR61_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR62_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR63_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR64_SWT;

