iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR65_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR66_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR67_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR68_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR69_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR70_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR71_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR72_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR73_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR74_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR75_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR76_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR77_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR78_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR79_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR80_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR81_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR82_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR83_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR84_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR85_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR86_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR87_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR88_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR89_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR90_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR91_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR92_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR93_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR94_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR95_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR96_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR97_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR98_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR99_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR100_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR101_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR102_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR103_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR104_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR105_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR106_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR107_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR108_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR109_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR110_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR111_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR112_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR113_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR114_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR115_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR116_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR117_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR118_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR119_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR120_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR121_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR122_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR123_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR124_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR125_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR126_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR127_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR128_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR129_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR130_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR131_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR132_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR133_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR134_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR135_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR136_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR137_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR138_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR139_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR140_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR141_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR142_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR143_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR144_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR145_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR146_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR147_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR148_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR149_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR150_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR151_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR152_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR153_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR154_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR155_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR156_SWT;

