iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR433_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR434_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR435_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR436_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR437_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR438_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR439_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR440_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR441_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR442_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR443_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR444_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR445_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR446_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR447_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR448_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR449_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR450_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR451_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR452_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR453_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR454_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR455_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR456_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR457_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR458_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR459_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR460_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR461_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR462_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR463_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR464_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR465_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR466_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR467_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR468_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR469_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR470_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR471_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR472_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR473_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR474_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR475_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR476_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR477_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR478_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR479_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR480_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR481_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR482_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR483_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR484_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR485_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR486_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR487_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR488_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR489_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR490_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR491_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR492_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR493_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR494_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR495_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR496_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR497_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR498_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR499_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR500_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR501_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR502_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR503_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR504_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR505_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR506_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR507_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR508_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR509_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR510_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR511_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR512_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR513_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR514_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR515_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR516_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR517_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR518_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR519_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR520_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR521_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR522_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR523_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR524_SWT;

