iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR709_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR710_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR711_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR712_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR713_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR714_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR715_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR716_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR717_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR718_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR719_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR720_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR721_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR722_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR723_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR724_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR725_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR726_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR727_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR728_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR729_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR730_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR731_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR732_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR733_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR734_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR735_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR736_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR737_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR738_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR739_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR740_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR741_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR742_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR743_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR744_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR745_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR746_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR747_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR748_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR749_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR750_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR751_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR752_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR753_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR754_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR755_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR756_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR757_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR758_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR759_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR760_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR761_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR762_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR763_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR764_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR765_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR766_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR767_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR768_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR769_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR770_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR771_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR772_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR773_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR774_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR775_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR776_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR777_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR778_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR779_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR780_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR781_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR782_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR783_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR784_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR785_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR786_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR787_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR788_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR789_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR790_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR791_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR792_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR793_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR794_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR795_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR796_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR797_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR798_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR799_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR800_SWT;

