iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR893_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR894_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR895_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR896_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR897_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR898_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR899_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR900_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR901_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR902_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR903_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR904_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR905_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR906_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR907_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR908_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR909_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR910_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR911_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR912_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR913_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR914_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR915_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR916_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR917_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR918_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR919_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR920_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR921_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR922_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR923_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR924_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR925_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR926_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR927_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR928_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR929_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR930_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR931_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR932_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR933_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR934_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR935_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR936_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR937_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR938_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR939_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR940_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR941_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR942_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR943_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR944_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR945_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR946_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR947_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR948_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR949_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR950_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR951_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR952_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR953_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR954_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR955_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR956_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR957_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR958_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR959_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR960_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR961_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR962_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR963_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR964_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR965_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR966_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR967_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR968_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR969_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR970_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR971_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR972_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR973_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR974_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR975_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR976_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR977_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR978_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR979_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR980_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR981_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR982_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR983_SWT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRI:6;
      uint64_t reservedSpace0:2;
      uint64_t SWT:1;
      uint64_t reservedSpace1:6;
      uint64_t PRC_SEL0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR984_SWT;

