iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STOP0_MC;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STANDBY0_MC;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t S_SIUL:1;
      uint64_t reservedSpace1:14;
      uint64_t S_PIT_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t S_DMAMUX_0:1;
      uint64_t reservedSpace1:1;
      uint64_t S_CRC_0:1;
      uint64_t reservedSpace2:23;
      uint64_t S_CCCU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t S_CANSUBSYS0_MCAN_3:1;
      uint64_t S_CANSUBSYS0_MCAN_2:1;
      uint64_t S_CANSUBSYS0_MCAN_1:1;
      uint64_t reservedSpace1:2;
      uint64_t S_CANSUBSYS0_MCAN_0:1;
      uint64_t reservedSpace2:1;
      uint64_t S_CANSUBSYS0_CAN_RAM_CTR:1;
      uint64_t reservedSpace3:12;
      uint64_t S_LINFlexD_10:1;
      uint64_t reservedSpace4:3;
      uint64_t S_LINFlexD_2:1;
      uint64_t S_LINFlexD_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t S_DSPI_2:1;
      uint64_t S_DSPI_0:1;
      uint64_t reservedSpace1:1;
      uint64_t S_IIC_0:1;
      uint64_t reservedSpace2:10;
      uint64_t S_SAR_ADC_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t S_SAR_ADC_SEQ_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t S_CRC_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t S_CANSUBSYS1_MCAN_3:1;
      uint64_t S_CANSUBSYS1_MCAN_2:1;
      uint64_t S_CANSUBSYS1_MCAN_1:1;
      uint64_t reservedSpace1:3;
      uint64_t S_CANSUBSYS1_CAN_RAM_CTR:1;
      uint64_t reservedSpace2:10;
      uint64_t S_LINFlexD_15:1;
      uint64_t reservedSpace3:3;
      uint64_t S_LINFlexD_7:1;
      uint64_t reservedSpace4:2;
      uint64_t S_LINFlexD_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t S_DSPI_3:1;
      uint64_t S_DSPI_1:1;
      uint64_t reservedSpace1:13;
      uint64_t S_EMIOS_0:1;
      uint64_t reservedSpace2:1;
      uint64_t S_BODY_CTU_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL91;

