iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL101;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL102;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL103;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL104;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL105;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL106;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL107;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL108;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL109;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL110;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL111;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL112;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL113;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL114;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL115;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL116;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL117;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL118;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL119;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL120;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL121;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL122;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL123;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL124;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL125;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL126;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL127;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL128;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL129;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL130;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL131;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL132;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL133;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL134;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL135;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL136;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL137;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL138;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL139;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL140;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL141;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL142;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL143;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL144;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL145;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL146;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL147;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL148;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL149;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL150;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL151;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL152;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL153;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL154;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL155;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL156;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL157;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL158;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL159;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL160;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL161;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL162;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL163;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL164;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL165;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL166;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL167;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL168;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL169;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL170;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL171;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL172;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL173;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL174;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL175;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL176;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL177;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL178;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL179;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL180;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL181;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL182;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL183;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL184;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL185;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL186;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL187;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL188;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL189;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL190;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL191;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL192;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL193;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL194;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL195;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL196;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL197;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL198;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL199;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL200;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL201;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL202;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL203;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL204;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL205;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL206;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL207;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL208;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL209;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL210;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL211;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL212;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL213;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL214;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL215;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL216;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL217;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL218;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL219;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL220;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL221;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL222;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL223;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL224;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL225;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL226;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL227;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL228;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL229;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL230;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL231;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL232;

