iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL233;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL234;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL235;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL236;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL237;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL238;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL239;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL240;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL241;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL242;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL243;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL244;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL245;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL246;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL247;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL248;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL249;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL250;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL251;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL252;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL253;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL254;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL255;

  uint8_t res4[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCTL0;

  uint8_t res5[26];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMC:1;
      uint64_t reservedSpace0:1;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CADDR0;

};

#define MC_ME (*(volatile struct MC_ME_tag *) 0xf7fb8000)

struct MC_PCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCONF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCONF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCONF2;

  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT;

