iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define MC_PCU (*(volatile struct MC_PCU_tag *) 0xf7fa0000)

struct MC_RGM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t F_POR:1;
      uint64_t F_PORST:1;
      uint64_t reservedSpace0:1;
      uint64_t F_SOFT_DEST:1;
      uint64_t F_FFRR:1;
      uint64_t F_SUF:1;
      uint64_t reservedSpace1:2;
      uint64_t F_EDR:1;
      uint64_t F_FIF:1;
      uint64_t F_JTAG_DEST:1;
      uint64_t reservedSpace2:3;
      uint64_t F_SSCM_DEST:1;
      uint64_t reservedSpace3:8;
      uint64_t F_TSR_DEST:1;
      uint64_t F_VOR_DEST:1;
      uint64_t F_VOR_STDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DES;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D_POR:1;
      uint64_t D_PORST:1;
      uint64_t reservedSpace0:1;
      uint64_t D_SOFT_DEST:1;
      uint64_t D_FFRR:1;
      uint64_t D_SUF:1;
      uint64_t reservedSpace1:2;
      uint64_t D_EDR:1;
      uint64_t D_FIF:1;
      uint64_t D_JTAG_DEST:1;
      uint64_t reservedSpace2:3;
      uint64_t D_SSCM_DEST:1;
      uint64_t reservedSpace3:8;
      uint64_t D_TSR_DEST:1;
      uint64_t D_VOR_DEST:1;
      uint64_t D_VOR_STDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERD;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AR_PORST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEAR;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BE_POR:1;
      uint64_t BE_PORST:1;
      uint64_t reservedSpace0:1;
      uint64_t BE_SOFT_DEST:1;
      uint64_t BE_FFRR:1;
      uint64_t BE_SUF:1;
      uint64_t reservedSpace1:2;
      uint64_t BE_EDR:1;
      uint64_t BE_FIF:1;
      uint64_t BE_JTAG_DEST:1;
      uint64_t reservedSpace2:3;
      uint64_t BE_SSCM_DEST:1;
      uint64_t reservedSpace3:8;
      uint64_t BE_TSR_DEST:1;
      uint64_t BE_VOR_DEST:1;
      uint64_t BE_VOR_STDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBRE;

  uint8_t res3[716];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t F_ESR1:1;
      uint64_t F_ST_DONE:1;
      uint64_t F_SOFT_FUNC:1;
      uint64_t reservedSpace1:1;
      uint64_t F_FCCU_HARD:1;
      uint64_t F_FCCU_SOFT:1;
      uint64_t reservedSpace2:3;
      uint64_t F_JTAG_FUNC:1;
      uint64_t reservedSpace3:12;
      uint64_t F_TSR_FUNC:1;
      uint64_t F_VOR_FUNC:1;
      uint64_t F_VOR_FUNC_STDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FES;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t D_ESR1:1;
      uint64_t D_ST_DONE:1;
      uint64_t D_SOFT_FUNC:1;
      uint64_t reservedSpace1:1;
      uint64_t D_FCCU_HARD:1;
      uint64_t reservedSpace2:4;
      uint64_t D_JTAG_FUNC:1;
      uint64_t reservedSpace3:12;
      uint64_t D_TSR_FUNC:1;
      uint64_t D_VOR_FUNC:1;
      uint64_t D_VOR_FUNC_STDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FERD;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AR_ESR1:1;
      uint64_t reservedSpace1:21;
      uint64_t AR_TSR_FUNC:1;
      uint64_t AR_VOR_FUNC:1;
      uint64_t AR_VOR_FUNC_STDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEAR;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t BE_ESR1:1;
      uint64_t BE_ST_DONE:1;
      uint64_t BE_SOFT_FUNC:1;
      uint64_t reservedSpace1:1;
      uint64_t BE_FCCU_HARD:1;
      uint64_t BE_FCCU_SOFT:1;
      uint64_t reservedSpace2:3;
      uint64_t BE_JTAG_FUNC:1;
      uint64_t reservedSpace3:12;
      uint64_t BE_TSR_FUNC:1;
      uint64_t BE_VOR_FUNC:1;
      uint64_t BE_VOR_FUNC_STDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBRE;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SS_ESR1:1;
      uint64_t SS_ST_DONE:1;
      uint64_t SS_SOFT_FUNC:1;
      uint64_t reservedSpace1:1;
      uint64_t SS_FCCU_HARD:1;
      uint64_t SS_FCCU_SOFT:1;
      uint64_t reservedSpace2:3;
      uint64_t SS_JTAG_FUNC:1;
      uint64_t reservedSpace3:12;
      uint64_t SS_TSR_FUNC:1;
      uint64_t SS_VOR_FUNC:1;
      uint64_t SS_VOR_FUNC_STDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FESS;

  uint8_t res8[704];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FRET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FRET;

  uint8_t res9[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DRET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DRET;

  uint8_t res10[7];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t SIUL_RST:1;
      uint64_t reservedSpace1:14;
      uint64_t PIT_0_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRST0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DMAMUX_0_RST:1;
      uint64_t reservedSpace1:1;
      uint64_t CRC_0_RST:1;
      uint64_t reservedSpace2:23;
      uint64_t CCCU_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRST1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t M_CAN_3_SUB_0_RST:1;
      uint64_t M_CAN_2_SUB_0_RST:1;
      uint64_t M_CAN_1_SUB_0_RST:1;
      uint64_t reservedSpace1:2;
      uint64_t M_CAN_0_SUB_0_RST:1;
      uint64_t reservedSpace2:1;
      uint64_t CAN_RAM_SUB_0_CTR_RST:1;
      uint64_t reservedSpace3:12;
      uint64_t LINFLEXD_10_RST:1;
      uint64_t reservedSpace4:3;
      uint64_t LINFLEXD_2_RST:1;
      uint64_t LINFLEXD_0_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRST2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSPI_2_RST:1;
      uint64_t DSPI_0_RST:1;
      uint64_t reservedSpace1:1;
      uint64_t IIC_0_RST:1;
      uint64_t reservedSpace2:10;
      uint64_t SAR_ADC_12BIT_B_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRST3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SAR_ADC_12BIT_B_SEQ_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRST4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t CRC_1_RST:1;
      uint64_t reservedSpace1:2;
      uint64_t FCCU_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRST5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t M_CAN_3_SUB_1_RST:1;
      uint64_t M_CAN_2_SUB_1_RST:1;
      uint64_t M_CAN_1_SUB_1_RST:1;
      uint64_t reservedSpace1:3;
      uint64_t CAN_RAM_SUB_1_CTR_RST:1;
      uint64_t reservedSpace2:10;
      uint64_t LINFLEXD_15_RST:1;
      uint64_t reservedSpace3:3;
      uint64_t LINFLEXD_7_RST:1;
      uint64_t reservedSpace4:2;
      uint64_t LINFLEXD_1_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRST6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSPI_3_RST:1;
      uint64_t DSPI_1_RST:1;
      uint64_t reservedSpace1:13;
      uint64_t EMIOS_0_RST:1;
      uint64_t reservedSpace2:1;
      uint64_t BODY_CTU_0_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRST7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t SIUL_STAT:1;
      uint64_t reservedSpace1:14;
      uint64_t PIT_0_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DMAMUX_0_STAT:1;
      uint64_t reservedSpace1:1;
      uint64_t CRC_0_STAT:1;
      uint64_t reservedSpace2:23;
      uint64_t CCCU_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t M_CAN_3_SUB_0_STAT:1;
      uint64_t M_CAN_2_SUB_0_STAT:1;
      uint64_t M_CAN_1_SUB_0_STAT:1;
      uint64_t reservedSpace1:2;
      uint64_t M_CAN_0_SUB_0_STAT:1;
      uint64_t reservedSpace2:1;
      uint64_t CAN_RAM_SUB_0_CTR_STAT:1;
      uint64_t reservedSpace3:12;
      uint64_t LINFLEXD_10_STAT:1;
      uint64_t reservedSpace4:3;
      uint64_t LINFLEXD_2_STAT:1;
      uint64_t LINFLEXD_0_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSPI_2_STAT:1;
      uint64_t DSPI_0_STAT:1;
      uint64_t reservedSpace1:1;
      uint64_t IIC_0_STAT:1;
      uint64_t reservedSpace2:10;
      uint64_t SAR_ADC_12BIT_B_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SAR_ADC_12BIT_B_SEQ_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t CRC_1_STAT:1;
      uint64_t reservedSpace1:2;
      uint64_t FCCU_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t M_CAN_3_SUB_1_STAT:1;
      uint64_t M_CAN_2_SUB_1_STAT:1;
      uint64_t M_CAN_1_SUB_1_STAT:1;
      uint64_t reservedSpace1:3;
      uint64_t CAN_RAM_SUB_1_CTR_STAT:1;
      uint64_t reservedSpace2:10;
      uint64_t LINFLEXD_15_STAT:1;
      uint64_t reservedSpace3:3;
      uint64_t LINFLEXD_7_STAT:1;
      uint64_t reservedSpace4:2;
      uint64_t LINFLEXD_1_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSPI_3_STAT:1;
      uint64_t DSPI_1_STAT:1;
      uint64_t reservedSpace1:13;
      uint64_t EMIOS_0_STAT:1;
      uint64_t reservedSpace2:1;
      uint64_t BODY_CTU_0_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT7;

