iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint32_t FLASH_CERR_ADDR4;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS5;

  uint32_t FLASH_CERR_ADDR5;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS6;

  uint32_t FLASH_CERR_ADDR6;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS7;

  uint32_t FLASH_CERR_ADDR7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS8;

  uint32_t FLASH_CERR_ADDR8;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS9;

  uint32_t FLASH_CERR_ADDR9;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS10;

  uint32_t FLASH_CERR_ADDR10;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS11;

  uint32_t FLASH_CERR_ADDR11;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS12;

  uint32_t FLASH_CERR_ADDR12;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS13;

  uint32_t FLASH_CERR_ADDR13;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS14;

  uint32_t FLASH_CERR_ADDR14;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS15;

  uint32_t FLASH_CERR_ADDR15;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS16;

  uint32_t FLASH_CERR_ADDR16;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS17;

  uint32_t FLASH_CERR_ADDR17;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS18;

  uint32_t FLASH_CERR_ADDR18;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:16;
      uint64_t reservedSpace0:15;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS19;

  uint32_t FLASH_CERR_ADDR19;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_UNCERR_STS;

  uint32_t FLASH_UNCERR_ADDR;
  uint32_t FLASH_OFLW0;
};

#define MEMU (*(volatile struct MEMU_tag *) 0xf7f50000)

struct OSC40M_DIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t I_OSC:1;
      uint64_t reservedSpace1:7;
      uint64_t M_OSC:1;
      uint64_t EOCV:8;
      uint64_t reservedSpace2:7;
      uint64_t OSCBYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

};

#define OSC40M_DIG (*(volatile struct OSC40M_DIG_tag *) 0xf7fb0080)

struct PASS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIFE:3;
      uint64_t reservedSpace0:27;
      uint64_t JUN:1;
      uint64_t CNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSEL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMST:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSTAT;

  uint8_t res2[12];

  uint32_t CIN0;
  uint32_t CIN1;
  uint32_t CIN2;
  uint32_t CIN3;
  uint32_t CIN4;
  uint32_t CIN5;
  uint32_t CIN6;
  uint32_t CIN7;
  uint8_t res3[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t reservedSpace0:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_PG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1_PG0;

  uint32_t LOCK2_PG0;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KLOCK:16;
      uint64_t RL0:1;
      uint64_t RL1:1;
      uint64_t RL2:1;
      uint64_t RL3:1;
      uint64_t RL4:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTR:4;
      uint64_t reservedSpace1:1;
      uint64_t MO:1;
      uint64_t DBL:1;
      uint64_t PGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3_PG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t reservedSpace0:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_PG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1_PG1;

  uint32_t LOCK2_PG1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KLOCK:16;
      uint64_t RL0:1;
      uint64_t RL1:1;
      uint64_t RL2:1;
      uint64_t RL3:1;
      uint64_t RL4:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTR:4;
      uint64_t reservedSpace1:1;
      uint64_t MO:1;
      uint64_t DBL:1;
      uint64_t PGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3_PG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t reservedSpace0:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_PG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1_PG2;

  uint32_t LOCK2_PG2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KLOCK:16;
      uint64_t RL0:1;
      uint64_t RL1:1;
      uint64_t RL2:1;
      uint64_t RL3:1;
      uint64_t RL4:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTR:4;
      uint64_t reservedSpace1:1;
      uint64_t MO:1;
      uint64_t DBL:1;
      uint64_t PGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3_PG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t reservedSpace0:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_PG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1_PG3;

  uint32_t LOCK2_PG3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KLOCK:16;
      uint64_t RL0:1;
      uint64_t RL1:1;
      uint64_t RL2:1;
      uint64_t RL3:1;
      uint64_t RL4:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTR:4;
      uint64_t reservedSpace1:1;
      uint64_t MO:1;
      uint64_t DBL:1;
      uint64_t PGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3_PG3;

