iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define PASS (*(volatile struct PASS_tag *) 0xf7ff4000)

struct PBRIDGE_PBRIDGE_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPROT7:4;
      uint64_t MPROT6:4;
      uint64_t MPROT5:4;
      uint64_t MPROT4:4;
      uint64_t MPROT3:4;
      uint64_t MPROT2:4;
      uint64_t MPROT1:4;
      uint64_t MPROT0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPRA;

  uint8_t res0[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACR7:4;
      uint64_t PACR6:4;
      uint64_t PACR5:4;
      uint64_t PACR4:4;
      uint64_t PACR3:4;
      uint64_t PACR2:4;
      uint64_t PACR1:4;
      uint64_t PACR0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACR15:4;
      uint64_t PACR14:4;
      uint64_t PACR13:4;
      uint64_t PACR12:4;
      uint64_t PACR11:4;
      uint64_t PACR10:4;
      uint64_t PACR9:4;
      uint64_t PACR8:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACR23:4;
      uint64_t PACR22:4;
      uint64_t PACR21:4;
      uint64_t PACR20:4;
      uint64_t PACR19:4;
      uint64_t PACR18:4;
      uint64_t PACR17:4;
      uint64_t PACR16:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACR31:4;
      uint64_t PACR30:4;
      uint64_t PACR29:4;
      uint64_t PACR28:4;
      uint64_t PACR27:4;
      uint64_t PACR26:4;
      uint64_t PACR25:4;
      uint64_t PACR24:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACR39:4;
      uint64_t PACR38:4;
      uint64_t PACR37:4;
      uint64_t PACR36:4;
      uint64_t PACR35:4;
      uint64_t PACR34:4;
      uint64_t PACR33:4;
      uint64_t PACR32:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACR47:4;
      uint64_t PACR46:4;
      uint64_t PACR45:4;
      uint64_t PACR44:4;
      uint64_t PACR43:4;
      uint64_t PACR42:4;
      uint64_t PACR41:4;
      uint64_t PACR40:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACR55:4;
      uint64_t PACR54:4;
      uint64_t PACR53:4;
      uint64_t PACR52:4;
      uint64_t PACR51:4;
      uint64_t PACR50:4;
      uint64_t PACR49:4;
      uint64_t PACR48:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACR63:4;
      uint64_t PACR62:4;
      uint64_t PACR61:4;
      uint64_t PACR60:4;
      uint64_t PACR59:4;
      uint64_t PACR58:4;
      uint64_t PACR57:4;
      uint64_t PACR56:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACRH;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR7:4;
      uint64_t OPACR6:4;
      uint64_t OPACR5:4;
      uint64_t OPACR4:4;
      uint64_t OPACR3:4;
      uint64_t OPACR2:4;
      uint64_t OPACR1:4;
      uint64_t OPACR0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR15:4;
      uint64_t OPACR14:4;
      uint64_t OPACR13:4;
      uint64_t OPACR12:4;
      uint64_t OPACR11:4;
      uint64_t OPACR10:4;
      uint64_t OPACR9:4;
      uint64_t OPACR8:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR23:4;
      uint64_t OPACR22:4;
      uint64_t OPACR21:4;
      uint64_t OPACR20:4;
      uint64_t OPACR19:4;
      uint64_t OPACR18:4;
      uint64_t OPACR17:4;
      uint64_t OPACR16:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR31:4;
      uint64_t OPACR30:4;
      uint64_t OPACR29:4;
      uint64_t OPACR28:4;
      uint64_t OPACR27:4;
      uint64_t OPACR26:4;
      uint64_t OPACR25:4;
      uint64_t OPACR24:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR39:4;
      uint64_t OPACR38:4;
      uint64_t OPACR37:4;
      uint64_t OPACR36:4;
      uint64_t OPACR35:4;
      uint64_t OPACR34:4;
      uint64_t OPACR33:4;
      uint64_t OPACR32:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR47:4;
      uint64_t OPACR46:4;
      uint64_t OPACR45:4;
      uint64_t OPACR44:4;
      uint64_t OPACR43:4;
      uint64_t OPACR42:4;
      uint64_t OPACR41:4;
      uint64_t OPACR40:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR55:4;
      uint64_t OPACR54:4;
      uint64_t OPACR53:4;
      uint64_t OPACR52:4;
      uint64_t OPACR51:4;
      uint64_t OPACR50:4;
      uint64_t OPACR49:4;
      uint64_t OPACR48:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR63:4;
      uint64_t OPACR62:4;
      uint64_t OPACR61:4;
      uint64_t OPACR60:4;
      uint64_t OPACR59:4;
      uint64_t OPACR58:4;
      uint64_t OPACR57:4;
      uint64_t OPACR56:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR71:4;
      uint64_t OPACR70:4;
      uint64_t OPACR69:4;
      uint64_t OPACR68:4;
      uint64_t OPACR67:4;
      uint64_t OPACR66:4;
      uint64_t OPACR65:4;
      uint64_t OPACR64:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR79:4;
      uint64_t OPACR78:4;
      uint64_t OPACR77:4;
      uint64_t OPACR76:4;
      uint64_t OPACR75:4;
      uint64_t OPACR74:4;
      uint64_t OPACR73:4;
      uint64_t OPACR72:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRJ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR87:4;
      uint64_t OPACR86:4;
      uint64_t OPACR85:4;
      uint64_t OPACR84:4;
      uint64_t OPACR83:4;
      uint64_t OPACR82:4;
      uint64_t OPACR81:4;
      uint64_t OPACR80:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR95:4;
      uint64_t OPACR94:4;
      uint64_t OPACR93:4;
      uint64_t OPACR92:4;
      uint64_t OPACR91:4;
      uint64_t OPACR90:4;
      uint64_t OPACR89:4;
      uint64_t OPACR88:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR103:4;
      uint64_t OPACR102:4;
      uint64_t OPACR101:4;
      uint64_t OPACR100:4;
      uint64_t OPACR99:4;
      uint64_t OPACR98:4;
      uint64_t OPACR97:4;
      uint64_t OPACR96:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR111:4;
      uint64_t OPACR110:4;
      uint64_t OPACR109:4;
      uint64_t OPACR108:4;
      uint64_t OPACR107:4;
      uint64_t OPACR106:4;
      uint64_t OPACR105:4;
      uint64_t OPACR104:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR119:4;
      uint64_t OPACR118:4;
      uint64_t OPACR117:4;
      uint64_t OPACR116:4;
      uint64_t OPACR115:4;
      uint64_t OPACR114:4;
      uint64_t OPACR113:4;
      uint64_t OPACR112:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR127:4;
      uint64_t OPACR126:4;
      uint64_t OPACR125:4;
      uint64_t OPACR124:4;
      uint64_t OPACR123:4;
      uint64_t OPACR122:4;
      uint64_t OPACR121:4;
      uint64_t OPACR120:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR135:4;
      uint64_t OPACR134:4;
      uint64_t OPACR133:4;
      uint64_t OPACR132:4;
      uint64_t OPACR131:4;
      uint64_t OPACR130:4;
      uint64_t OPACR129:4;
      uint64_t OPACR128:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR143:4;
      uint64_t OPACR142:4;
      uint64_t OPACR141:4;
      uint64_t OPACR140:4;
      uint64_t OPACR139:4;
      uint64_t OPACR138:4;
      uint64_t OPACR137:4;
      uint64_t OPACR136:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR151:4;
      uint64_t OPACR150:4;
      uint64_t OPACR149:4;
      uint64_t OPACR148:4;
      uint64_t OPACR147:4;
      uint64_t OPACR146:4;
      uint64_t OPACR145:4;
      uint64_t OPACR144:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR159:4;
      uint64_t OPACR158:4;
      uint64_t OPACR157:4;
      uint64_t OPACR156:4;
      uint64_t OPACR155:4;
      uint64_t OPACR154:4;
      uint64_t OPACR153:4;
      uint64_t OPACR152:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR167:4;
      uint64_t OPACR166:4;
      uint64_t OPACR165:4;
      uint64_t OPACR164:4;
      uint64_t OPACR163:4;
      uint64_t OPACR162:4;
      uint64_t OPACR161:4;
      uint64_t OPACR160:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR175:4;
      uint64_t OPACR174:4;
      uint64_t OPACR173:4;
      uint64_t OPACR172:4;
      uint64_t OPACR171:4;
      uint64_t OPACR170:4;
      uint64_t OPACR169:4;
      uint64_t OPACR168:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR183:4;
      uint64_t OPACR182:4;
      uint64_t OPACR181:4;
      uint64_t OPACR180:4;
      uint64_t OPACR179:4;
      uint64_t OPACR178:4;
      uint64_t OPACR177:4;
      uint64_t OPACR176:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR191:4;
      uint64_t OPACR190:4;
      uint64_t OPACR189:4;
      uint64_t OPACR188:4;
      uint64_t OPACR187:4;
      uint64_t OPACR186:4;
      uint64_t OPACR185:4;
      uint64_t OPACR184:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR199:4;
      uint64_t OPACR198:4;
      uint64_t OPACR197:4;
      uint64_t OPACR196:4;
      uint64_t OPACR195:4;
      uint64_t OPACR194:4;
      uint64_t OPACR193:4;
      uint64_t OPACR192:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR207:4;
      uint64_t OPACR206:4;
      uint64_t OPACR205:4;
      uint64_t OPACR204:4;
      uint64_t OPACR203:4;
      uint64_t OPACR202:4;
      uint64_t OPACR201:4;
      uint64_t OPACR200:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR215:4;
      uint64_t OPACR214:4;
      uint64_t OPACR213:4;
      uint64_t OPACR212:4;
      uint64_t OPACR211:4;
      uint64_t OPACR210:4;
      uint64_t OPACR209:4;
      uint64_t OPACR208:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRAA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR223:4;
      uint64_t OPACR222:4;
      uint64_t OPACR221:4;
      uint64_t OPACR220:4;
      uint64_t OPACR219:4;
      uint64_t OPACR218:4;
      uint64_t OPACR217:4;
      uint64_t OPACR216:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRAB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR231:4;
      uint64_t OPACR230:4;
      uint64_t OPACR229:4;
      uint64_t OPACR228:4;
      uint64_t OPACR227:4;
      uint64_t OPACR226:4;
      uint64_t OPACR225:4;
      uint64_t OPACR224:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR239:4;
      uint64_t OPACR238:4;
      uint64_t OPACR237:4;
      uint64_t OPACR236:4;
      uint64_t OPACR235:4;
      uint64_t OPACR234:4;
      uint64_t OPACR233:4;
      uint64_t OPACR232:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR247:4;
      uint64_t OPACR246:4;
      uint64_t OPACR245:4;
      uint64_t OPACR244:4;
      uint64_t OPACR243:4;
      uint64_t OPACR242:4;
      uint64_t OPACR241:4;
      uint64_t OPACR240:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRAE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPACR255:4;
      uint64_t OPACR254:4;
      uint64_t OPACR253:4;
      uint64_t OPACR252:4;
      uint64_t OPACR251:4;
      uint64_t OPACR250:4;
      uint64_t OPACR249:4;
      uint64_t OPACR248:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPACRAF;

