iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define PBRIDGE_PBRIDGE_2 (*(volatile struct PBRIDGE_PBRIDGE_2_tag *) 0xf4000000)

struct PCM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t BWE_DMA:1;
      uint64_t BRE_DMA:1;
      uint64_t PRE_DMA:1;
      uint64_t EN_HSIZE_MUX:1;
      uint64_t DMA_STALL_NXMC_OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM0;

};

#define PCM_0 (*(volatile struct PCM_0_tag *) 0xf4028000)

struct PFLASH_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_BFEN:1;
      uint64_t P0_PFLIM:2;
      uint64_t reservedSpace0:1;
      uint64_t P0_IPFEN:1;
      uint64_t reservedSpace1:1;
      uint64_t P0_DPFEN:1;
      uint64_t reservedSpace2:1;
      uint64_t RWSC:5;
      uint64_t APC:3;
      uint64_t P0_M0PFE:1;
      uint64_t P0_M1PFE:1;
      uint64_t P0_M2PFE:1;
      uint64_t P0_M3PFE:1;
      uint64_t P0_M4PFE:1;
      uint64_t P0_M5PFE:1;
      uint64_t P0_M6PFE:1;
      uint64_t P0_M7PFE:1;
      uint64_t P0_M8PFE:1;
      uint64_t P0_M9PFE:1;
      uint64_t P0_M10PFE:1;
      uint64_t P0_M11PFE:1;
      uint64_t P0_M12PFE:1;
      uint64_t P0_M13PFE:1;
      uint64_t P0_M14PFE:1;
      uint64_t P0_M15PFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_BFEN:1;
      uint64_t P1_PFLIM:2;
      uint64_t reservedSpace0:1;
      uint64_t P1_IPFEN:1;
      uint64_t reservedSpace1:1;
      uint64_t P1_DPFEN:1;
      uint64_t reservedSpace2:9;
      uint64_t P1_M0PFE:1;
      uint64_t P1_M1PFE:1;
      uint64_t P1_M2PFE:1;
      uint64_t P1_M3PFE:1;
      uint64_t P1_M4PFE:1;
      uint64_t P1_M5PFE:1;
      uint64_t P1_M6PFE:1;
      uint64_t P1_M7PFE:1;
      uint64_t P1_M8PFE:1;
      uint64_t P1_M9PFE:1;
      uint64_t P1_M10PFE:1;
      uint64_t P1_M11PFE:1;
      uint64_t P1_M12PFE:1;
      uint64_t P1_M13PFE:1;
      uint64_t P1_M14PFE:1;
      uint64_t P1_M15PFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t ARBM:2;
      uint64_t BAF_DIS:1;
      uint64_t reservedSpace1:11;
      uint64_t P1_WCFG:2;
      uint64_t P0_WCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15AP:2;
      uint64_t M14AP:2;
      uint64_t M13AP:2;
      uint64_t M12AP:2;
      uint64_t M11AP:2;
      uint64_t M10AP:2;
      uint64_t M9AP:2;
      uint64_t M8AP:2;
      uint64_t M7AP:2;
      uint64_t M6AP:2;
      uint64_t M5AP:2;
      uint64_t M4AP:2;
      uint64_t M3AP:2;
      uint64_t M2AP:2;
      uint64_t M1AP:2;
      uint64_t M0AP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFAPR;

};

#define PFLASH_1 (*(volatile struct PFLASH_1_tag *) 0xf4034000)

struct PIT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ:1;
      uint64_t MDIS:1;
      uint64_t MDIS_RTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[236];

  uint32_t RTI_LDVAL;
  uint32_t RTI_CVAL;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_TFLG;

  uint32_t LDVAL0;
  uint32_t CVAL0;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG0;

  uint32_t LDVAL1;
  uint32_t CVAL1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG1;

  uint32_t LDVAL2;
  uint32_t CVAL2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG2;

  uint32_t LDVAL3;
  uint32_t CVAL3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG3;

  uint32_t LDVAL4;
  uint32_t CVAL4;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG4;

  uint32_t LDVAL5;
  uint32_t CVAL5;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG5;

  uint32_t LDVAL6;
  uint32_t CVAL6;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG6;

  uint32_t LDVAL7;
  uint32_t CVAL7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG7;

