iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define PIT_0 (*(volatile struct PIT_0_tag *) 0xf7f84000)

struct PLLDIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LOLIE:1;
      uint64_t reservedSpace1:3;
      uint64_t EXPDIE:1;
      uint64_t CLKCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOCK:1;
      uint64_t LOLF:1;
      uint64_t reservedSpace1:3;
      uint64_t EXTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:7;
      uint64_t reservedSpace0:5;
      uint64_t PREDIV:3;
      uint64_t reservedSpace1:1;
      uint64_t RFDPHI:6;
      uint64_t reservedSpace2:5;
      uint64_t RFDPHI1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0DV;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LOLIE:1;
      uint64_t reservedSpace1:3;
      uint64_t EXPDIE:1;
      uint64_t CLKCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOCK:1;
      uint64_t LOLF:1;
      uint64_t reservedSpace1:3;
      uint64_t EXTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:7;
      uint64_t reservedSpace0:9;
      uint64_t RFDPHI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1DV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INCSTP:15;
      uint64_t reservedSpace0:1;
      uint64_t MODPRD:13;
      uint64_t MODSEL:1;
      uint64_t MODEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1FM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRCDIV:12;
      uint64_t reservedSpace0:4;
      uint64_t DTHDIS:2;
      uint64_t reservedSpace1:12;
      uint64_t FDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1FD;

};

#define PLLDIG (*(volatile struct PLLDIG_tag *) 0xf7fb0100)

struct PMCDIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t LVD3_C:1;
      uint64_t reservedSpace1:1;
      uint64_t LVD3_FL:1;
      uint64_t reservedSpace2:1;
      uint64_t LVD3_SB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPR_LV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t REE3_C:1;
      uint64_t reservedSpace1:1;
      uint64_t REE3_FL:1;
      uint64_t reservedSpace2:1;
      uint64_t REE3_SB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REE_LV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t RES3_C:1;
      uint64_t reservedSpace1:1;
      uint64_t RES3_FL:1;
      uint64_t reservedSpace2:1;
      uint64_t RES3_SB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES_LV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t VD3IE_C:1;
      uint64_t reservedSpace1:1;
      uint64_t VD3IE_FL:1;
      uint64_t reservedSpace2:1;
      uint64_t VD3IE_SB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE_LV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t FEE3_C:1;
      uint64_t reservedSpace1:1;
      uint64_t FEE3_FL:1;
      uint64_t reservedSpace2:1;
      uint64_t FEE3_SB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEE_LV0;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t HVD6_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPR_LV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t REE6_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REE_LV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RES6_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES_LV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t HVD6IE_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE_LV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t FEE6_C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEE_LV1;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t LVD11_C:1;
      uint64_t LVD11_FL:1;
      uint64_t reservedSpace1:3;
      uint64_t LVD11_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPR_HV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t REE11_C:1;
      uint64_t REE11_FL:1;
      uint64_t reservedSpace1:3;
      uint64_t REE11_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REE_HV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t RES11_C:1;
      uint64_t RES11_FL:1;
      uint64_t reservedSpace1:3;
      uint64_t RES11_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES_HV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t LVD11IE_C:1;
      uint64_t LVD11IE_FL:1;
      uint64_t reservedSpace1:3;
      uint64_t LVD11IE_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE_HV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t FEE11_C:1;
      uint64_t FEE11_FL:1;
      uint64_t reservedSpace1:3;
      uint64_t FEE11_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEE_HV0;

