iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t LVD14_IM:1;
      uint64_t reservedSpace1:3;
      uint64_t LVD14_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPR_HV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t REE14_IM:1;
      uint64_t reservedSpace1:3;
      uint64_t REE14_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REE_HV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t RES14_IM:1;
      uint64_t reservedSpace1:3;
      uint64_t RES14_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES_HV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t LVDIE14_IM:1;
      uint64_t reservedSpace1:3;
      uint64_t LVDIE14_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE_HV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t FEE14_IM:1;
      uint64_t reservedSpace1:3;
      uint64_t FEE14_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEE_HV1;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VD3_C:1;
      uint64_t VD3_FL:1;
      uint64_t VD3_SB:1;
      uint64_t reservedSpace0:1;
      uint64_t VD6_C:1;
      uint64_t reservedSpace1:1;
      uint64_t VD11_C:1;
      uint64_t VD11_FL:1;
      uint64_t reservedSpace2:2;
      uint64_t VD11_AS:1;
      uint64_t reservedSpace3:9;
      uint64_t VD14_IM:1;
      uint64_t reservedSpace4:2;
      uint64_t VD14_AS:1;
      uint64_t reservedSpace5:4;
      uint64_t TEMP_0:1;
      uint64_t TEMP_1:1;
      uint64_t TEMP_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GR_S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t IRQ_ST:1;
      uint64_t reservedSpace1:1;
      uint64_t VD3_C:1;
      uint64_t VD3_FL:1;
      uint64_t VD3_SB:1;
      uint64_t reservedSpace2:1;
      uint64_t VD6_C:1;
      uint64_t reservedSpace3:1;
      uint64_t VD11_C:1;
      uint64_t VD11_FL:1;
      uint64_t reservedSpace4:2;
      uint64_t VD11_AS:1;
      uint64_t reservedSpace5:6;
      uint64_t VD14_IM:1;
      uint64_t reservedSpace6:2;
      uint64_t VD14_AS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GR_P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t IRQ_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t VD3IE_C:1;
      uint64_t VD3IE_FL:1;
      uint64_t VD3IE_SB:1;
      uint64_t reservedSpace2:1;
      uint64_t VD6IE_C:1;
      uint64_t reservedSpace3:1;
      uint64_t VD11IE_C:1;
      uint64_t VD11IE_FL:1;
      uint64_t reservedSpace4:2;
      uint64_t VD11IE_AS:1;
      uint64_t reservedSpace5:6;
      uint64_t VD14IE_C:1;
      uint64_t reservedSpace6:2;
      uint64_t VD14IE_AS:1;
      uint64_t reservedSpace7:7;
      uint64_t IE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE_G;

  uint8_t res4[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t VSIO_IM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSIO;

  uint8_t res5[320];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RCOSC1M_ENB:1;
      uint64_t RCREG1M_ENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISC_CTRL_REG;

  uint8_t res6[180];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMP_0:1;
      uint64_t TEMP_1:1;
      uint64_t TEMP_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPR_TD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMP_0:1;
      uint64_t TEMP_1:1;
      uint64_t TEMP_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REE_TD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMP_0:1;
      uint64_t TEMP_1:1;
      uint64_t TEMP_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES_TD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AOUT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIM_ADJ_UNDER:4;
      uint64_t reservedSpace1:2;
      uint64_t TRIM_ADJ_OVER:4;
      uint64_t reservedSpace2:1;
      uint64_t TS0IE:1;
      uint64_t TS1IE:1;
      uint64_t TS2IE:1;
      uint64_t TRIM_ADJ_OVER1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL_TD;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEE_TS0:1;
      uint64_t FEE_TS1:1;
      uint64_t FEE_TS2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEE_TD;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESR0_CFG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR0_CFG;

  uint8_t res9[164];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAGS_P1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_FLAGS_PHASE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAGS_P2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_FLAGS_PHASE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t reservedSpace0:3;
      uint64_t STATUS:3;
      uint64_t reservedSpace1:1;
      uint64_t NCFEN:1;
      uint64_t reservedSpace2:3;
      uint64_t NCFST:1;
      uint64_t reservedSpace3:3;
      uint64_t IRQEN:1;
      uint64_t reservedSpace4:3;
      uint64_t IRQST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_0:13;
      uint64_t reservedSpace0:3;
      uint64_t TIME_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_TIME10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_2:13;
      uint64_t reservedSpace0:3;
      uint64_t TIME_3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_TIME32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_5:13;
      uint64_t reservedSpace0:3;
      uint64_t TIME_6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_TIME65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VD_MON:6;
      uint64_t reservedSpace0:11;
      uint64_t uvd140_c_mask_status:1;
      uint64_t hvd134_c_mask_status:1;
      uint64_t lvd400_as_mask_status:1;
      uint64_t lvd400_c_mask_status:1;
      uint64_t lvd290_c_mask_status:1;
      uint64_t lvd290_as_mask_status:1;
      uint64_t lvd290_fl_mask_status:1;
      uint64_t mvd270_c_mask_status:1;
      uint64_t mvd270_fl_mask_status:1;
      uint64_t lvd100_fl_mask_status:1;
      uint64_t lvd100_c_mask_status:1;
      uint64_t mvd094_c_mask_status:1;
      uint64_t mvd094_fb_mask_status:1;
      uint64_t mvd094_fa_mask_status:1;
      uint64_t lvd100_sb_mask_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_DEBUG;

