iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define PMCDIG (*(volatile struct PMCDIG_tag *) 0xf7fa0400)

struct PRAM_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FT_DIS:1;
      uint64_t reservedSpace0:5;
      uint64_t P0_BO_DIS:1;
      uint64_t P1_BO_DIS:1;
      uint64_t PRI0:1;
      uint64_t PRI1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRCR1;

};

#define PRAM_2 (*(volatile struct PRAM_2_tag *) 0xf40a8000)

struct RC1024K_DIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t S_LPRC:1;
      uint64_t reservedSpace1:3;
      uint64_t LPRCDIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

};

#define RC1024K_DIG (*(volatile struct RC1024K_DIG_tag *) 0xf7fb0040)

struct RC16M_DIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t USER_TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCTRIM:8;
      uint64_t reservedSpace0:3;
      uint64_t REG_EN:1;
      uint64_t reservedSpace1:12;
      uint64_t FT_CODE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NT;

};

#define RC16M_DIG (*(volatile struct RC16M_DIG_tag *) 0xf7fb0000)

struct RTC_API_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t SUPV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCSUPV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_EN:1;
      uint64_t reservedSpace0:9;
      uint64_t DIV32EN:1;
      uint64_t DIV512EN:1;
      uint64_t CLKSEL:2;
      uint64_t APIIE:1;
      uint64_t APIEN:1;
      uint64_t reservedSpace1:12;
      uint64_t ROVREN:1;
      uint64_t FRZEN:1;
      uint64_t RTCIE:1;
      uint64_t CNTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t ROVRF:1;
      uint64_t reservedSpace1:2;
      uint64_t APIF:1;
      uint64_t reservedSpace2:2;
      uint64_t INV_ANL:1;
      uint64_t INV_API:1;
      uint64_t INV_RTC:1;
      uint64_t reservedSpace3:10;
      uint64_t RTCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCS;

  uint32_t RTCCNT;
  uint32_t APIVAL;
  uint32_t RTCVAL;
  uint32_t ANLCMP_CNT;
};

#define RTC_API (*(volatile struct RTC_API_tag *) 0xf7f94000)

struct SAR_ADC_12bit_B0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDN:1;
      uint64_t EDCSELF:1;
      uint64_t reservedSpace0:2;
      uint64_t FRZ:1;
      uint64_t reservedSpace1:1;
      uint64_t ABORT:1;
      uint64_t ABORTCHAIN:1;
      uint64_t JTRGSEL:4;
      uint64_t reservedSpace2:3;
      uint64_t WTRIGOUT:1;
      uint64_t CTU_MODE:1;
      uint64_t CTUEN:1;
      uint64_t reservedSpace3:1;
      uint64_t JTRGSEQ:1;
      uint64_t JEDGESEL:2;
      uint64_t JTRGEN:1;
      uint64_t JSTART:1;
      uint64_t NEDGESEL:2;
      uint64_t NTRGEN:1;
      uint64_t NSTART:1;
      uint64_t reservedSpace4:1;
      uint64_t MODE:1;
      uint64_t WLSIDE:1;
      uint64_t OWREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCSTATUS:3;
      uint64_t reservedSpace0:5;
      uint64_t CHADDR:8;
      uint64_t CTUSTART:1;
      uint64_t reservedSpace1:1;
      uint64_t JABORTCHAIN:1;
      uint64_t reservedSpace2:4;
      uint64_t JSTART:1;
      uint64_t reservedSpace3:3;
      uint64_t NSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NECH:1;
      uint64_t NEOC:1;
      uint64_t JECH:1;
      uint64_t JEOC:1;
      uint64_t EOCTU:1;
      uint64_t CTUTRGERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC_CH0:1;
      uint64_t EOC_CH1:1;
      uint64_t EOC_CH2:1;
      uint64_t EOC_CH3:1;
      uint64_t EOC_CH4:1;
      uint64_t EOC_CH5:1;
      uint64_t EOC_CH6:1;
      uint64_t EOC_CH7:1;
      uint64_t EOC_CH8:1;
      uint64_t EOC_CH9:1;
      uint64_t EOC_CH10:1;
      uint64_t EOC_CH11:1;
      uint64_t EOC_CH12:1;
      uint64_t EOC_CH13:1;
      uint64_t EOC_CH14:1;
      uint64_t EOC_CH15:1;
      uint64_t EOC_CH16:1;
      uint64_t EOC_CH17:1;
      uint64_t EOC_CH18:1;
      uint64_t EOC_CH19:1;
      uint64_t EOC_CH20:1;
      uint64_t EOC_CH21:1;
      uint64_t EOC_CH22:1;
      uint64_t EOC_CH23:1;
      uint64_t EOC_CH24:1;
      uint64_t EOC_CH25:1;
      uint64_t EOC_CH26:1;
      uint64_t EOC_CH27:1;
      uint64_t EOC_CH28:1;
      uint64_t EOC_CH29:1;
      uint64_t EOC_CH30:1;
      uint64_t EOC_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC_CH32:1;
      uint64_t EOC_CH33:1;
      uint64_t EOC_CH34:1;
      uint64_t EOC_CH35:1;
      uint64_t EOC_CH36:1;
      uint64_t EOC_CH37:1;
      uint64_t EOC_CH38:1;
      uint64_t EOC_CH39:1;
      uint64_t EOC_CH40:1;
      uint64_t EOC_CH41:1;
      uint64_t EOC_CH42:1;
      uint64_t EOC_CH43:1;
      uint64_t EOC_CH44:1;
      uint64_t EOC_CH45:1;
      uint64_t EOC_CH46:1;
      uint64_t EOC_CH47:1;
      uint64_t EOC_CH48:1;
      uint64_t EOC_CH49:1;
      uint64_t EOC_CH50:1;
      uint64_t EOC_CH51:1;
      uint64_t EOC_CH52:1;
      uint64_t EOC_CH53:1;
      uint64_t EOC_CH54:1;
      uint64_t EOC_CH55:1;
      uint64_t EOC_CH56:1;
      uint64_t EOC_CH57:1;
      uint64_t EOC_CH58:1;
      uint64_t EOC_CH59:1;
      uint64_t EOC_CH60:1;
      uint64_t EOC_CH61:1;
      uint64_t EOC_CH62:1;
      uint64_t EOC_CH63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC_CH64:1;
      uint64_t EOC_CH65:1;
      uint64_t EOC_CH66:1;
      uint64_t EOC_CH67:1;
      uint64_t EOC_CH68:1;
      uint64_t EOC_CH69:1;
      uint64_t EOC_CH70:1;
      uint64_t EOC_CH71:1;
      uint64_t EOC_CH72:1;
      uint64_t EOC_CH73:1;
      uint64_t EOC_CH74:1;
      uint64_t EOC_CH75:1;
      uint64_t EOC_CH76:1;
      uint64_t EOC_CH77:1;
      uint64_t EOC_CH78:1;
      uint64_t EOC_CH79:1;
      uint64_t EOC_CH80:1;
      uint64_t EOC_CH81:1;
      uint64_t EOC_CH82:1;
      uint64_t EOC_CH83:1;
      uint64_t EOC_CH84:1;
      uint64_t EOC_CH85:1;
      uint64_t EOC_CH86:1;
      uint64_t EOC_CH87:1;
      uint64_t EOC_CH88:1;
      uint64_t EOC_CH89:1;
      uint64_t EOC_CH90:1;
      uint64_t EOC_CH91:1;
      uint64_t EOC_CH92:1;
      uint64_t EOC_CH93:1;
      uint64_t EOC_CH94:1;
      uint64_t EOC_CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSKNECH:1;
      uint64_t MSKNEOC:1;
      uint64_t MSKJECH:1;
      uint64_t MSKJEOC:1;
      uint64_t MSKEOCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM_CH0:1;
      uint64_t IM_CH1:1;
      uint64_t IM_CH2:1;
      uint64_t IM_CH3:1;
      uint64_t IM_CH4:1;
      uint64_t IM_CH5:1;
      uint64_t IM_CH6:1;
      uint64_t IM_CH7:1;
      uint64_t IM_CH8:1;
      uint64_t IM_CH9:1;
      uint64_t IM_CH10:1;
      uint64_t IM_CH11:1;
      uint64_t IM_CH12:1;
      uint64_t IM_CH13:1;
      uint64_t IM_CH14:1;
      uint64_t IM_CH15:1;
      uint64_t IM_CH16:1;
      uint64_t IM_CH17:1;
      uint64_t IM_CH18:1;
      uint64_t IM_CH19:1;
      uint64_t IM_CH20:1;
      uint64_t IM_CH21:1;
      uint64_t IM_CH22:1;
      uint64_t IM_CH23:1;
      uint64_t IM_CH24:1;
      uint64_t IM_CH25:1;
      uint64_t IM_CH26:1;
      uint64_t IM_CH27:1;
      uint64_t IM_CH28:1;
      uint64_t IM_CH29:1;
      uint64_t IM_CH30:1;
      uint64_t IM_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM_CH32:1;
      uint64_t IM_CH33:1;
      uint64_t IM_CH34:1;
      uint64_t IM_CH35:1;
      uint64_t IM_CH36:1;
      uint64_t IM_CH37:1;
      uint64_t IM_CH38:1;
      uint64_t IM_CH39:1;
      uint64_t IM_CH40:1;
      uint64_t IM_CH41:1;
      uint64_t IM_CH42:1;
      uint64_t IM_CH43:1;
      uint64_t IM_CH44:1;
      uint64_t IM_CH45:1;
      uint64_t IM_CH46:1;
      uint64_t IM_CH47:1;
      uint64_t IM_CH48:1;
      uint64_t IM_CH49:1;
      uint64_t IM_CH50:1;
      uint64_t IM_CH51:1;
      uint64_t IM_CH52:1;
      uint64_t IM_CH53:1;
      uint64_t IM_CH54:1;
      uint64_t IM_CH55:1;
      uint64_t IM_CH56:1;
      uint64_t IM_CH57:1;
      uint64_t IM_CH58:1;
      uint64_t IM_CH59:1;
      uint64_t IM_CH60:1;
      uint64_t IM_CH61:1;
      uint64_t IM_CH62:1;
      uint64_t IM_CH63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM_CH64:1;
      uint64_t IM_CH65:1;
      uint64_t IM_CH66:1;
      uint64_t IM_CH67:1;
      uint64_t IM_CH68:1;
      uint64_t IM_CH69:1;
      uint64_t IM_CH70:1;
      uint64_t IM_CH71:1;
      uint64_t IM_CH72:1;
      uint64_t IM_CH73:1;
      uint64_t IM_CH74:1;
      uint64_t IM_CH75:1;
      uint64_t IM_CH76:1;
      uint64_t IM_CH77:1;
      uint64_t IM_CH78:1;
      uint64_t IM_CH79:1;
      uint64_t IM_CH80:1;
      uint64_t IM_CH81:1;
      uint64_t IM_CH82:1;
      uint64_t IM_CH83:1;
      uint64_t IM_CH84:1;
      uint64_t IM_CH85:1;
      uint64_t IM_CH86:1;
      uint64_t IM_CH87:1;
      uint64_t IM_CH88:1;
      uint64_t IM_CH89:1;
      uint64_t IM_CH90:1;
      uint64_t IM_CH91:1;
      uint64_t IM_CH92:1;
      uint64_t IM_CH93:1;
      uint64_t IM_CH94:1;
      uint64_t IM_CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDG0L:1;
      uint64_t WDG0H:1;
      uint64_t WDG1L:1;
      uint64_t WDG1H:1;
      uint64_t WDG2L:1;
      uint64_t WDG2H:1;
      uint64_t WDG3L:1;
      uint64_t WDG3H:1;
      uint64_t WDG4L:1;
      uint64_t WDG4H:1;
      uint64_t WDG5L:1;
      uint64_t WDG5H:1;
      uint64_t WDG6L:1;
      uint64_t WDG6H:1;
      uint64_t WDG7L:1;
      uint64_t WDG7H:1;
      uint64_t WDG8L:1;
      uint64_t WDG8H:1;
      uint64_t WDG9L:1;
      uint64_t WDG9H:1;
      uint64_t WDG10L:1;
      uint64_t WDG10H:1;
      uint64_t WDG11L:1;
      uint64_t WDG11H:1;
      uint64_t WDG12L:1;
      uint64_t WDG12H:1;
      uint64_t WDG13L:1;
      uint64_t WDG13H:1;
      uint64_t WDG14L:1;
      uint64_t WDG14H:1;
      uint64_t WDG15L:1;
      uint64_t WDG15H:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSKWDG0L:1;
      uint64_t MSKWDG0H:1;
      uint64_t MSKWDG1L:1;
      uint64_t MSKWDG1H:1;
      uint64_t MSKWDG2L:1;
      uint64_t MSKWDG2H:1;
      uint64_t MSKWDG3L:1;
      uint64_t MSKWDG3H:1;
      uint64_t MSKWDG4L:1;
      uint64_t MSKWDG4H:1;
      uint64_t MSKWDG5L:1;
      uint64_t MSKWDG5H:1;
      uint64_t MSKWDG6L:1;
      uint64_t MSKWDG6H:1;
      uint64_t MSKWDG7L:1;
      uint64_t MSKWDG7H:1;
      uint64_t MSKWDG8L:1;
      uint64_t MSKWDG8H:1;
      uint64_t MSKWDG9L:1;
      uint64_t MSKWDG9H:1;
      uint64_t MSKWDG10L:1;
      uint64_t MSKWDG10H:1;
      uint64_t MSKWDG11L:1;
      uint64_t MSKWDG11H:1;
      uint64_t MSKWDG12L:1;
      uint64_t MSKWDG12H:1;
      uint64_t MSKWDG13L:1;
      uint64_t MSKWDG13H:1;
      uint64_t MSKWDG14L:1;
      uint64_t MSKWDG14H:1;
      uint64_t MSKWDG15L:1;
      uint64_t MSKWDG15H:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTIMR;

