iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t DCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS_CH0:1;
      uint64_t DS_CH1:1;
      uint64_t DS_CH2:1;
      uint64_t DS_CH3:1;
      uint64_t DS_CH4:1;
      uint64_t DS_CH5:1;
      uint64_t DS_CH6:1;
      uint64_t DS_CH7:1;
      uint64_t DS_CH8:1;
      uint64_t DS_CH9:1;
      uint64_t DS_CH10:1;
      uint64_t DS_CH11:1;
      uint64_t DS_CH12:1;
      uint64_t DS_CH13:1;
      uint64_t DS_CH14:1;
      uint64_t DS_CH15:1;
      uint64_t DS_CH16:1;
      uint64_t DS_CH17:1;
      uint64_t DS_CH18:1;
      uint64_t DS_CH19:1;
      uint64_t DS_CH20:1;
      uint64_t DS_CH21:1;
      uint64_t DS_CH22:1;
      uint64_t DS_CH23:1;
      uint64_t DS_CH24:1;
      uint64_t DS_CH25:1;
      uint64_t DS_CH26:1;
      uint64_t DS_CH27:1;
      uint64_t DS_CH28:1;
      uint64_t DS_CH29:1;
      uint64_t DS_CH30:1;
      uint64_t DS_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS_CH32:1;
      uint64_t DS_CH33:1;
      uint64_t DS_CH34:1;
      uint64_t DS_CH35:1;
      uint64_t DS_CH36:1;
      uint64_t DS_CH37:1;
      uint64_t DS_CH38:1;
      uint64_t DS_CH39:1;
      uint64_t DS_CH40:1;
      uint64_t DS_CH41:1;
      uint64_t DS_CH42:1;
      uint64_t DS_CH43:1;
      uint64_t DS_CH44:1;
      uint64_t DS_CH45:1;
      uint64_t DS_CH46:1;
      uint64_t DS_CH47:1;
      uint64_t DS_CH48:1;
      uint64_t DS_CH49:1;
      uint64_t DS_CH50:1;
      uint64_t DS_CH51:1;
      uint64_t DS_CH52:1;
      uint64_t DS_CH53:1;
      uint64_t DS_CH54:1;
      uint64_t DS_CH55:1;
      uint64_t DS_CH56:1;
      uint64_t DS_CH57:1;
      uint64_t DS_CH58:1;
      uint64_t DS_CH59:1;
      uint64_t DS_CH60:1;
      uint64_t DS_CH61:1;
      uint64_t DS_CH62:1;
      uint64_t DS_CH63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS_CH64:1;
      uint64_t DS_CH65:1;
      uint64_t DS_CH66:1;
      uint64_t DS_CH67:1;
      uint64_t DS_CH68:1;
      uint64_t DS_CH69:1;
      uint64_t DS_CH70:1;
      uint64_t DS_CH71:1;
      uint64_t DS_CH72:1;
      uint64_t DS_CH73:1;
      uint64_t DS_CH74:1;
      uint64_t DS_CH75:1;
      uint64_t DS_CH76:1;
      uint64_t DS_CH77:1;
      uint64_t DS_CH78:1;
      uint64_t DS_CH79:1;
      uint64_t DS_CH80:1;
      uint64_t DS_CH81:1;
      uint64_t DS_CH82:1;
      uint64_t DS_CH83:1;
      uint64_t DS_CH84:1;
      uint64_t DS_CH85:1;
      uint64_t DS_CH86:1;
      uint64_t DS_CH87:1;
      uint64_t DS_CH88:1;
      uint64_t DS_CH89:1;
      uint64_t DS_CH90:1;
      uint64_t DS_CH91:1;
      uint64_t DS_CH92:1;
      uint64_t DS_CH93:1;
      uint64_t DS_CH94:1;
      uint64_t DS_CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDSR2;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR3;

  uint8_t res3[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
      uint64_t PRECHG:4;
      uint64_t reservedSpace0:19;
      uint64_t CRES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
      uint64_t PRECHG:4;
      uint64_t reservedSpace0:19;
      uint64_t CRES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
      uint64_t PRECHG:4;
      uint64_t reservedSpace0:19;
      uint64_t CRES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
      uint64_t PRECHG:4;
      uint64_t reservedSpace0:19;
      uint64_t CRES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCE_CH0:1;
      uint64_t NCE_CH1:1;
      uint64_t NCE_CH2:1;
      uint64_t NCE_CH3:1;
      uint64_t NCE_CH4:1;
      uint64_t NCE_CH5:1;
      uint64_t NCE_CH6:1;
      uint64_t NCE_CH7:1;
      uint64_t NCE_CH8:1;
      uint64_t NCE_CH9:1;
      uint64_t NCE_CH10:1;
      uint64_t NCE_CH11:1;
      uint64_t NCE_CH12:1;
      uint64_t NCE_CH13:1;
      uint64_t NCE_CH14:1;
      uint64_t NCE_CH15:1;
      uint64_t NCE_CH16:1;
      uint64_t NCE_CH17:1;
      uint64_t NCE_CH18:1;
      uint64_t NCE_CH19:1;
      uint64_t NCE_CH20:1;
      uint64_t NCE_CH21:1;
      uint64_t NCE_CH22:1;
      uint64_t NCE_CH23:1;
      uint64_t NCE_CH24:1;
      uint64_t NCE_CH25:1;
      uint64_t NCE_CH26:1;
      uint64_t NCE_CH27:1;
      uint64_t NCE_CH28:1;
      uint64_t NCE_CH29:1;
      uint64_t NCE_CH30:1;
      uint64_t NCE_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICNCMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCE_CH32:1;
      uint64_t NCE_CH33:1;
      uint64_t NCE_CH34:1;
      uint64_t NCE_CH35:1;
      uint64_t NCE_CH36:1;
      uint64_t NCE_CH37:1;
      uint64_t NCE_CH38:1;
      uint64_t NCE_CH39:1;
      uint64_t NCE_CH40:1;
      uint64_t NCE_CH41:1;
      uint64_t NCE_CH42:1;
      uint64_t NCE_CH43:1;
      uint64_t NCE_CH44:1;
      uint64_t NCE_CH45:1;
      uint64_t NCE_CH46:1;
      uint64_t NCE_CH47:1;
      uint64_t NCE_CH48:1;
      uint64_t NCE_CH49:1;
      uint64_t NCE_CH50:1;
      uint64_t NCE_CH51:1;
      uint64_t NCE_CH52:1;
      uint64_t NCE_CH53:1;
      uint64_t NCE_CH54:1;
      uint64_t NCE_CH55:1;
      uint64_t NCE_CH56:1;
      uint64_t NCE_CH57:1;
      uint64_t NCE_CH58:1;
      uint64_t NCE_CH59:1;
      uint64_t NCE_CH60:1;
      uint64_t NCE_CH61:1;
      uint64_t NCE_CH62:1;
      uint64_t NCE_CH63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICNCMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCE_CH64:1;
      uint64_t NCE_CH65:1;
      uint64_t NCE_CH66:1;
      uint64_t NCE_CH67:1;
      uint64_t NCE_CH68:1;
      uint64_t NCE_CH69:1;
      uint64_t NCE_CH70:1;
      uint64_t NCE_CH71:1;
      uint64_t NCE_CH72:1;
      uint64_t NCE_CH73:1;
      uint64_t NCE_CH74:1;
      uint64_t NCE_CH75:1;
      uint64_t NCE_CH76:1;
      uint64_t NCE_CH77:1;
      uint64_t NCE_CH78:1;
      uint64_t NCE_CH79:1;
      uint64_t NCE_CH80:1;
      uint64_t NCE_CH81:1;
      uint64_t NCE_CH82:1;
      uint64_t NCE_CH83:1;
      uint64_t NCE_CH84:1;
      uint64_t NCE_CH85:1;
      uint64_t NCE_CH86:1;
      uint64_t NCE_CH87:1;
      uint64_t NCE_CH88:1;
      uint64_t NCE_CH89:1;
      uint64_t NCE_CH90:1;
      uint64_t NCE_CH91:1;
      uint64_t NCE_CH92:1;
      uint64_t NCE_CH93:1;
      uint64_t NCE_CH94:1;
      uint64_t NCE_CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICNCMR2;

