iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCE_CH0:1;
      uint64_t JCE_CH1:1;
      uint64_t JCE_CH2:1;
      uint64_t JCE_CH3:1;
      uint64_t JCE_CH4:1;
      uint64_t JCE_CH5:1;
      uint64_t JCE_CH6:1;
      uint64_t JCE_CH7:1;
      uint64_t JCE_CH8:1;
      uint64_t JCE_CH9:1;
      uint64_t JCE_CH10:1;
      uint64_t JCE_CH11:1;
      uint64_t JCE_CH12:1;
      uint64_t JCE_CH13:1;
      uint64_t JCE_CH14:1;
      uint64_t JCE_CH15:1;
      uint64_t JCE_CH16:1;
      uint64_t JCE_CH17:1;
      uint64_t JCE_CH18:1;
      uint64_t JCE_CH19:1;
      uint64_t JCE_CH20:1;
      uint64_t JCE_CH21:1;
      uint64_t JCE_CH22:1;
      uint64_t JCE_CH23:1;
      uint64_t JCE_CH24:1;
      uint64_t JCE_CH25:1;
      uint64_t JCE_CH26:1;
      uint64_t JCE_CH27:1;
      uint64_t JCE_CH28:1;
      uint64_t JCE_CH29:1;
      uint64_t JCE_CH30:1;
      uint64_t JCE_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICJCMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCE_CH32:1;
      uint64_t JCE_CH33:1;
      uint64_t JCE_CH34:1;
      uint64_t JCE_CH35:1;
      uint64_t JCE_CH36:1;
      uint64_t JCE_CH37:1;
      uint64_t JCE_CH38:1;
      uint64_t JCE_CH39:1;
      uint64_t JCE_CH40:1;
      uint64_t JCE_CH41:1;
      uint64_t JCE_CH42:1;
      uint64_t JCE_CH43:1;
      uint64_t JCE_CH44:1;
      uint64_t JCE_CH45:1;
      uint64_t JCE_CH46:1;
      uint64_t JCE_CH47:1;
      uint64_t JCE_CH48:1;
      uint64_t JCE_CH49:1;
      uint64_t JCE_CH50:1;
      uint64_t JCE_CH51:1;
      uint64_t JCE_CH52:1;
      uint64_t JCE_CH53:1;
      uint64_t JCE_CH54:1;
      uint64_t JCE_CH55:1;
      uint64_t JCE_CH56:1;
      uint64_t JCE_CH57:1;
      uint64_t JCE_CH58:1;
      uint64_t JCE_CH59:1;
      uint64_t JCE_CH60:1;
      uint64_t JCE_CH61:1;
      uint64_t JCE_CH62:1;
      uint64_t JCE_CH63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICJCMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCE_CH64:1;
      uint64_t JCE_CH65:1;
      uint64_t JCE_CH66:1;
      uint64_t JCE_CH67:1;
      uint64_t JCE_CH68:1;
      uint64_t JCE_CH69:1;
      uint64_t JCE_CH70:1;
      uint64_t JCE_CH71:1;
      uint64_t JCE_CH72:1;
      uint64_t JCE_CH73:1;
      uint64_t JCE_CH74:1;
      uint64_t JCE_CH75:1;
      uint64_t JCE_CH76:1;
      uint64_t JCE_CH77:1;
      uint64_t JCE_CH78:1;
      uint64_t JCE_CH79:1;
      uint64_t JCE_CH80:1;
      uint64_t JCE_CH81:1;
      uint64_t JCE_CH82:1;
      uint64_t JCE_CH83:1;
      uint64_t JCE_CH84:1;
      uint64_t JCE_CH85:1;
      uint64_t JCE_CH86:1;
      uint64_t JCE_CH87:1;
      uint64_t JCE_CH88:1;
      uint64_t JCE_CH89:1;
      uint64_t JCE_CH90:1;
      uint64_t JCE_CH91:1;
      uint64_t JCE_CH92:1;
      uint64_t JCE_CH93:1;
      uint64_t JCE_CH94:1;
      uint64_t JCE_CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICJCMR2;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDEDR;

  uint8_t res6[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR62;

