iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDR95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHRHLR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH0:4;
      uint64_t WSEL_CH1:4;
      uint64_t WSEL_CH2:4;
      uint64_t WSEL_CH3:4;
      uint64_t WSEL_CH4:4;
      uint64_t WSEL_CH5:4;
      uint64_t WSEL_CH6:4;
      uint64_t WSEL_CH7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH8:4;
      uint64_t WSEL_CH9:4;
      uint64_t WSEL_CH10:4;
      uint64_t WSEL_CH11:4;
      uint64_t WSEL_CH12:4;
      uint64_t WSEL_CH13:4;
      uint64_t WSEL_CH14:4;
      uint64_t WSEL_CH15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH16:4;
      uint64_t WSEL_CH17:4;
      uint64_t WSEL_CH18:4;
      uint64_t WSEL_CH19:4;
      uint64_t WSEL_CH20:4;
      uint64_t WSEL_CH21:4;
      uint64_t WSEL_CH22:4;
      uint64_t WSEL_CH23:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH24:4;
      uint64_t WSEL_CH25:4;
      uint64_t WSEL_CH26:4;
      uint64_t WSEL_CH27:4;
      uint64_t WSEL_CH28:4;
      uint64_t WSEL_CH29:4;
      uint64_t WSEL_CH30:4;
      uint64_t WSEL_CH31:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH32:4;
      uint64_t WSEL_CH33:4;
      uint64_t WSEL_CH34:4;
      uint64_t WSEL_CH35:4;
      uint64_t WSEL_CH36:4;
      uint64_t WSEL_CH37:4;
      uint64_t WSEL_CH38:4;
      uint64_t WSEL_CH39:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH40:4;
      uint64_t WSEL_CH41:4;
      uint64_t WSEL_CH42:4;
      uint64_t WSEL_CH43:4;
      uint64_t WSEL_CH44:4;
      uint64_t WSEL_CH45:4;
      uint64_t WSEL_CH46:4;
      uint64_t WSEL_CH47:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH48:4;
      uint64_t WSEL_CH49:4;
      uint64_t WSEL_CH50:4;
      uint64_t WSEL_CH51:4;
      uint64_t WSEL_CH52:4;
      uint64_t WSEL_CH53:4;
      uint64_t WSEL_CH54:4;
      uint64_t WSEL_CH55:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH56:4;
      uint64_t WSEL_CH57:4;
      uint64_t WSEL_CH58:4;
      uint64_t WSEL_CH59:4;
      uint64_t WSEL_CH60:4;
      uint64_t WSEL_CH61:4;
      uint64_t WSEL_CH62:4;
      uint64_t WSEL_CH63:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH64:4;
      uint64_t WSEL_CH65:4;
      uint64_t WSEL_CH66:4;
      uint64_t WSEL_CH67:4;
      uint64_t WSEL_CH68:4;
      uint64_t WSEL_CH69:4;
      uint64_t WSEL_CH70:4;
      uint64_t WSEL_CH71:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH72:4;
      uint64_t WSEL_CH73:4;
      uint64_t WSEL_CH74:4;
      uint64_t WSEL_CH75:4;
      uint64_t WSEL_CH76:4;
      uint64_t WSEL_CH77:4;
      uint64_t WSEL_CH78:4;
      uint64_t WSEL_CH79:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH80:4;
      uint64_t WSEL_CH81:4;
      uint64_t WSEL_CH82:4;
      uint64_t WSEL_CH83:4;
      uint64_t WSEL_CH84:4;
      uint64_t WSEL_CH85:4;
      uint64_t WSEL_CH86:4;
      uint64_t WSEL_CH87:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH88:4;
      uint64_t WSEL_CH89:4;
      uint64_t WSEL_CH90:4;
      uint64_t WSEL_CH91:4;
      uint64_t WSEL_CH92:4;
      uint64_t WSEL_CH93:4;
      uint64_t WSEL_CH94:4;
      uint64_t WSEL_CH95:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWSELR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN_CH0:1;
      uint64_t WEN_CH1:1;
      uint64_t WEN_CH2:1;
      uint64_t WEN_CH3:1;
      uint64_t WEN_CH4:1;
      uint64_t WEN_CH5:1;
      uint64_t WEN_CH6:1;
      uint64_t WEN_CH7:1;
      uint64_t WEN_CH8:1;
      uint64_t WEN_CH9:1;
      uint64_t WEN_CH10:1;
      uint64_t WEN_CH11:1;
      uint64_t WEN_CH12:1;
      uint64_t WEN_CH13:1;
      uint64_t WEN_CH14:1;
      uint64_t WEN_CH15:1;
      uint64_t WEN_CH16:1;
      uint64_t WEN_CH17:1;
      uint64_t WEN_CH18:1;
      uint64_t WEN_CH19:1;
      uint64_t WEN_CH20:1;
      uint64_t WEN_CH21:1;
      uint64_t WEN_CH22:1;
      uint64_t WEN_CH23:1;
      uint64_t WEN_CH24:1;
      uint64_t WEN_CH25:1;
      uint64_t WEN_CH26:1;
      uint64_t WEN_CH27:1;
      uint64_t WEN_CH28:1;
      uint64_t WEN_CH29:1;
      uint64_t WEN_CH30:1;
      uint64_t WEN_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWENR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN_CH32:1;
      uint64_t WEN_CH33:1;
      uint64_t WEN_CH34:1;
      uint64_t WEN_CH35:1;
      uint64_t WEN_CH36:1;
      uint64_t WEN_CH37:1;
      uint64_t WEN_CH38:1;
      uint64_t WEN_CH39:1;
      uint64_t WEN_CH40:1;
      uint64_t WEN_CH41:1;
      uint64_t WEN_CH42:1;
      uint64_t WEN_CH43:1;
      uint64_t WEN_CH44:1;
      uint64_t WEN_CH45:1;
      uint64_t WEN_CH46:1;
      uint64_t WEN_CH47:1;
      uint64_t WEN_CH48:1;
      uint64_t WEN_CH49:1;
      uint64_t WEN_CH50:1;
      uint64_t WEN_CH51:1;
      uint64_t WEN_CH52:1;
      uint64_t WEN_CH53:1;
      uint64_t WEN_CH54:1;
      uint64_t WEN_CH55:1;
      uint64_t WEN_CH56:1;
      uint64_t WEN_CH57:1;
      uint64_t WEN_CH58:1;
      uint64_t WEN_CH59:1;
      uint64_t WEN_CH60:1;
      uint64_t WEN_CH61:1;
      uint64_t WEN_CH62:1;
      uint64_t WEN_CH63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN_CH64:1;
      uint64_t WEN_CH65:1;
      uint64_t WEN_CH66:1;
      uint64_t WEN_CH67:1;
      uint64_t WEN_CH68:1;
      uint64_t WEN_CH69:1;
      uint64_t WEN_CH70:1;
      uint64_t WEN_CH71:1;
      uint64_t WEN_CH72:1;
      uint64_t WEN_CH73:1;
      uint64_t WEN_CH74:1;
      uint64_t WEN_CH75:1;
      uint64_t WEN_CH76:1;
      uint64_t WEN_CH77:1;
      uint64_t WEN_CH78:1;
      uint64_t WEN_CH79:1;
      uint64_t WEN_CH80:1;
      uint64_t WEN_CH81:1;
      uint64_t WEN_CH82:1;
      uint64_t WEN_CH83:1;
      uint64_t WEN_CH84:1;
      uint64_t WEN_CH85:1;
      uint64_t WEN_CH86:1;
      uint64_t WEN_CH87:1;
      uint64_t WEN_CH88:1;
      uint64_t WEN_CH89:1;
      uint64_t WEN_CH90:1;
      uint64_t WEN_CH91:1;
      uint64_t WEN_CH92:1;
      uint64_t WEN_CH93:1;
      uint64_t WEN_CH94:1;
      uint64_t WEN_CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICWENR2;

