iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH0:1;
      uint64_t AWOR_CH1:1;
      uint64_t AWOR_CH2:1;
      uint64_t AWOR_CH3:1;
      uint64_t AWOR_CH4:1;
      uint64_t AWOR_CH5:1;
      uint64_t AWOR_CH6:1;
      uint64_t AWOR_CH7:1;
      uint64_t AWOR_CH8:1;
      uint64_t AWOR_CH9:1;
      uint64_t AWOR_CH10:1;
      uint64_t AWOR_CH11:1;
      uint64_t AWOR_CH12:1;
      uint64_t AWOR_CH13:1;
      uint64_t AWOR_CH14:1;
      uint64_t AWOR_CH15:1;
      uint64_t AWOR_CH16:1;
      uint64_t AWOR_CH17:1;
      uint64_t AWOR_CH18:1;
      uint64_t AWOR_CH19:1;
      uint64_t AWOR_CH20:1;
      uint64_t AWOR_CH21:1;
      uint64_t AWOR_CH22:1;
      uint64_t AWOR_CH23:1;
      uint64_t AWOR_CH24:1;
      uint64_t AWOR_CH25:1;
      uint64_t AWOR_CH26:1;
      uint64_t AWOR_CH27:1;
      uint64_t AWOR_CH28:1;
      uint64_t AWOR_CH29:1;
      uint64_t AWOR_CH30:1;
      uint64_t AWOR_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICAWORR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH32:1;
      uint64_t AWOR_CH33:1;
      uint64_t AWOR_CH34:1;
      uint64_t AWOR_CH35:1;
      uint64_t AWOR_CH36:1;
      uint64_t AWOR_CH37:1;
      uint64_t AWOR_CH38:1;
      uint64_t AWOR_CH39:1;
      uint64_t AWOR_CH40:1;
      uint64_t AWOR_CH41:1;
      uint64_t AWOR_CH42:1;
      uint64_t AWOR_CH43:1;
      uint64_t AWOR_CH44:1;
      uint64_t AWOR_CH45:1;
      uint64_t AWOR_CH46:1;
      uint64_t AWOR_CH47:1;
      uint64_t AWOR_CH48:1;
      uint64_t AWOR_CH49:1;
      uint64_t AWOR_CH50:1;
      uint64_t AWOR_CH51:1;
      uint64_t AWOR_CH52:1;
      uint64_t AWOR_CH53:1;
      uint64_t AWOR_CH54:1;
      uint64_t AWOR_CH55:1;
      uint64_t AWOR_CH56:1;
      uint64_t AWOR_CH57:1;
      uint64_t AWOR_CH58:1;
      uint64_t AWOR_CH59:1;
      uint64_t AWOR_CH60:1;
      uint64_t AWOR_CH61:1;
      uint64_t AWOR_CH62:1;
      uint64_t AWOR_CH63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICAWORR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH64:1;
      uint64_t AWOR_CH65:1;
      uint64_t AWOR_CH66:1;
      uint64_t AWOR_CH67:1;
      uint64_t AWOR_CH68:1;
      uint64_t AWOR_CH69:1;
      uint64_t AWOR_CH70:1;
      uint64_t AWOR_CH71:1;
      uint64_t AWOR_CH72:1;
      uint64_t AWOR_CH73:1;
      uint64_t AWOR_CH74:1;
      uint64_t AWOR_CH75:1;
      uint64_t AWOR_CH76:1;
      uint64_t AWOR_CH77:1;
      uint64_t AWOR_CH78:1;
      uint64_t AWOR_CH79:1;
      uint64_t AWOR_CH80:1;
      uint64_t AWOR_CH81:1;
      uint64_t AWOR_CH82:1;
      uint64_t AWOR_CH83:1;
      uint64_t AWOR_CH84:1;
      uint64_t AWOR_CH85:1;
      uint64_t AWOR_CH86:1;
      uint64_t AWOR_CH87:1;
      uint64_t AWOR_CH88:1;
      uint64_t AWOR_CH89:1;
      uint64_t AWOR_CH90:1;
      uint64_t AWOR_CH91:1;
      uint64_t AWOR_CH92:1;
      uint64_t AWOR_CH93:1;
      uint64_t AWOR_CH94:1;
      uint64_t AWOR_CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICAWORR2;

  uint8_t res8[260];

  uint32_t TCIPR;
  uint32_t TCIMR;
  uint32_t TCDSR;
  uint32_t TCNCMR;
  uint32_t TCJCMR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH96:4;
      uint64_t WSEL_CH97:4;
      uint64_t WSEL_CH98:4;
      uint64_t WSEL_CH99:4;
      uint64_t WSEL_CH100:4;
      uint64_t WSEL_CH101:4;
      uint64_t WSEL_CH102:4;
      uint64_t WSEL_CH103:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCWSELR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH104:4;
      uint64_t WSEL_CH105:4;
      uint64_t WSEL_CH106:4;
      uint64_t WSEL_CH107:4;
      uint64_t WSEL_CH108:4;
      uint64_t WSEL_CH109:4;
      uint64_t WSEL_CH110:4;
      uint64_t WSEL_CH111:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCWSELR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH112:4;
      uint64_t WSEL_CH113:4;
      uint64_t WSEL_CH114:4;
      uint64_t WSEL_CH115:4;
      uint64_t WSEL_CH116:4;
      uint64_t WSEL_CH117:4;
      uint64_t WSEL_CH118:4;
      uint64_t WSEL_CH119:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCWSELR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH120:4;
      uint64_t WSEL_CH121:4;
      uint64_t WSEL_CH122:4;
      uint64_t WSEL_CH123:4;
      uint64_t WSEL_CH124:4;
      uint64_t WSEL_CH125:4;
      uint64_t WSEL_CH126:4;
      uint64_t WSEL_CH127:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCWSELR3;

  uint32_t TCWENR;
  uint32_t TCAWORR;
  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_TCH0:7;
      uint64_t ESIC_TCH0:1;
      uint64_t ICSEL_TCH1:7;
      uint64_t ESIC_TCH1:1;
      uint64_t ICSEL_TCH2:7;
      uint64_t ESIC_TCH2:1;
      uint64_t ICSEL_TCH3:7;
      uint64_t ESIC_TCH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCAPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_TCH4:7;
      uint64_t ESIC_TCH4:1;
      uint64_t ICSEL_TCH5:7;
      uint64_t ESIC_TCH5:1;
      uint64_t ICSEL_TCH6:7;
      uint64_t ESIC_TCH6:1;
      uint64_t ICSEL_TCH7:7;
      uint64_t ESIC_TCH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCAPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_TCH8:7;
      uint64_t ESIC_TCH8:1;
      uint64_t ICSEL_TCH9:7;
      uint64_t ESIC_TCH9:1;
      uint64_t ICSEL_TCH10:7;
      uint64_t ESIC_TCH10:1;
      uint64_t ICSEL_TCH11:7;
      uint64_t ESIC_TCH11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCAPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_TCH12:7;
      uint64_t ESIC_TCH12:1;
      uint64_t ICSEL_TCH13:7;
      uint64_t ESIC_TCH13:1;
      uint64_t ICSEL_TCH14:7;
      uint64_t ESIC_TCH14:1;
      uint64_t ICSEL_TCH15:7;
      uint64_t ESIC_TCH15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCAPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_TCH16:7;
      uint64_t ESIC_TCH16:1;
      uint64_t ICSEL_TCH17:7;
      uint64_t ESIC_TCH17:1;
      uint64_t ICSEL_TCH18:7;
      uint64_t ESIC_TCH18:1;
      uint64_t ICSEL_TCH19:7;
      uint64_t ESIC_TCH19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCAPR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_TCH20:7;
      uint64_t ESIC_TCH20:1;
      uint64_t ICSEL_TCH21:7;
      uint64_t ESIC_TCH21:1;
      uint64_t ICSEL_TCH22:7;
      uint64_t ESIC_TCH22:1;
      uint64_t ICSEL_TCH23:7;
      uint64_t ESIC_TCH23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCAPR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_TCH24:7;
      uint64_t ESIC_TCH24:1;
      uint64_t ICSEL_TCH25:7;
      uint64_t ESIC_TCH25:1;
      uint64_t ICSEL_TCH26:7;
      uint64_t ESIC_TCH26:1;
      uint64_t ICSEL_TCH27:7;
      uint64_t ESIC_TCH27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCAPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_TCH28:7;
      uint64_t ESIC_TCH28:1;
      uint64_t ICSEL_TCH29:7;
      uint64_t ESIC_TCH29:1;
      uint64_t ICSEL_TCH30:7;
      uint64_t ESIC_TCH30:1;
      uint64_t ICSEL_TCH31:7;
      uint64_t ESIC_TCH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCAPR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCDR127;

  uint8_t res10[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDSDR;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC_CH128:1;
      uint64_t EOC_CH129:1;
      uint64_t EOC_CH130:1;
      uint64_t EOC_CH131:1;
      uint64_t EOC_CH132:1;
      uint64_t EOC_CH133:1;
      uint64_t EOC_CH134:1;
      uint64_t EOC_CH135:1;
      uint64_t EOC_CH136:1;
      uint64_t EOC_CH137:1;
      uint64_t EOC_CH138:1;
      uint64_t EOC_CH139:1;
      uint64_t EOC_CH140:1;
      uint64_t EOC_CH141:1;
      uint64_t EOC_CH142:1;
      uint64_t EOC_CH143:1;
      uint64_t EOC_CH144:1;
      uint64_t EOC_CH145:1;
      uint64_t EOC_CH146:1;
      uint64_t EOC_CH147:1;
      uint64_t EOC_CH148:1;
      uint64_t EOC_CH149:1;
      uint64_t EOC_CH150:1;
      uint64_t EOC_CH151:1;
      uint64_t EOC_CH152:1;
      uint64_t EOC_CH153:1;
      uint64_t EOC_CH154:1;
      uint64_t EOC_CH155:1;
      uint64_t EOC_CH156:1;
      uint64_t EOC_CH157:1;
      uint64_t EOC_CH158:1;
      uint64_t EOC_CH159:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECIPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC_CH160:1;
      uint64_t EOC_CH161:1;
      uint64_t EOC_CH162:1;
      uint64_t EOC_CH163:1;
      uint64_t EOC_CH164:1;
      uint64_t EOC_CH165:1;
      uint64_t EOC_CH166:1;
      uint64_t EOC_CH167:1;
      uint64_t EOC_CH168:1;
      uint64_t EOC_CH169:1;
      uint64_t EOC_CH170:1;
      uint64_t EOC_CH171:1;
      uint64_t EOC_CH172:1;
      uint64_t EOC_CH173:1;
      uint64_t EOC_CH174:1;
      uint64_t EOC_CH175:1;
      uint64_t EOC_CH176:1;
      uint64_t EOC_CH177:1;
      uint64_t EOC_CH178:1;
      uint64_t EOC_CH179:1;
      uint64_t EOC_CH180:1;
      uint64_t EOC_CH181:1;
      uint64_t EOC_CH182:1;
      uint64_t EOC_CH183:1;
      uint64_t EOC_CH184:1;
      uint64_t EOC_CH185:1;
      uint64_t EOC_CH186:1;
      uint64_t EOC_CH187:1;
      uint64_t EOC_CH188:1;
      uint64_t EOC_CH189:1;
      uint64_t EOC_CH190:1;
      uint64_t EOC_CH191:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECIPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC_CH192:1;
      uint64_t EOC_CH193:1;
      uint64_t EOC_CH194:1;
      uint64_t EOC_CH195:1;
      uint64_t EOC_CH196:1;
      uint64_t EOC_CH197:1;
      uint64_t EOC_CH198:1;
      uint64_t EOC_CH199:1;
      uint64_t EOC_CH200:1;
      uint64_t EOC_CH201:1;
      uint64_t EOC_CH202:1;
      uint64_t EOC_CH203:1;
      uint64_t EOC_CH204:1;
      uint64_t EOC_CH205:1;
      uint64_t EOC_CH206:1;
      uint64_t EOC_CH207:1;
      uint64_t EOC_CH208:1;
      uint64_t EOC_CH209:1;
      uint64_t EOC_CH210:1;
      uint64_t EOC_CH211:1;
      uint64_t EOC_CH212:1;
      uint64_t EOC_CH213:1;
      uint64_t EOC_CH214:1;
      uint64_t EOC_CH215:1;
      uint64_t EOC_CH216:1;
      uint64_t EOC_CH217:1;
      uint64_t EOC_CH218:1;
      uint64_t EOC_CH219:1;
      uint64_t EOC_CH220:1;
      uint64_t EOC_CH221:1;
      uint64_t EOC_CH222:1;
      uint64_t EOC_CH223:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECIPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC_CH224:1;
      uint64_t EOC_CH225:1;
      uint64_t EOC_CH226:1;
      uint64_t EOC_CH227:1;
      uint64_t EOC_CH228:1;
      uint64_t EOC_CH229:1;
      uint64_t EOC_CH230:1;
      uint64_t EOC_CH231:1;
      uint64_t EOC_CH232:1;
      uint64_t EOC_CH233:1;
      uint64_t EOC_CH234:1;
      uint64_t EOC_CH235:1;
      uint64_t EOC_CH236:1;
      uint64_t EOC_CH237:1;
      uint64_t EOC_CH238:1;
      uint64_t EOC_CH239:1;
      uint64_t EOC_CH240:1;
      uint64_t EOC_CH241:1;
      uint64_t EOC_CH242:1;
      uint64_t EOC_CH243:1;
      uint64_t EOC_CH244:1;
      uint64_t EOC_CH245:1;
      uint64_t EOC_CH246:1;
      uint64_t EOC_CH247:1;
      uint64_t EOC_CH248:1;
      uint64_t EOC_CH249:1;
      uint64_t EOC_CH250:1;
      uint64_t EOC_CH251:1;
      uint64_t EOC_CH252:1;
      uint64_t EOC_CH253:1;
      uint64_t EOC_CH254:1;
      uint64_t EOC_CH255:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECIPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM_CH128:1;
      uint64_t IM_CH129:1;
      uint64_t IM_CH130:1;
      uint64_t IM_CH131:1;
      uint64_t IM_CH132:1;
      uint64_t IM_CH133:1;
      uint64_t IM_CH134:1;
      uint64_t IM_CH135:1;
      uint64_t IM_CH136:1;
      uint64_t IM_CH137:1;
      uint64_t IM_CH138:1;
      uint64_t IM_CH139:1;
      uint64_t IM_CH140:1;
      uint64_t IM_CH141:1;
      uint64_t IM_CH142:1;
      uint64_t IM_CH143:1;
      uint64_t IM_CH144:1;
      uint64_t IM_CH145:1;
      uint64_t IM_CH146:1;
      uint64_t IM_CH147:1;
      uint64_t IM_CH148:1;
      uint64_t IM_CH149:1;
      uint64_t IM_CH150:1;
      uint64_t IM_CH151:1;
      uint64_t IM_CH152:1;
      uint64_t IM_CH153:1;
      uint64_t IM_CH154:1;
      uint64_t IM_CH155:1;
      uint64_t IM_CH156:1;
      uint64_t IM_CH157:1;
      uint64_t IM_CH158:1;
      uint64_t IM_CH159:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECIMR0;

