iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM_CH160:1;
      uint64_t IM_CH161:1;
      uint64_t IM_CH162:1;
      uint64_t IM_CH163:1;
      uint64_t IM_CH164:1;
      uint64_t IM_CH165:1;
      uint64_t IM_CH166:1;
      uint64_t IM_CH167:1;
      uint64_t IM_CH168:1;
      uint64_t IM_CH169:1;
      uint64_t IM_CH170:1;
      uint64_t IM_CH171:1;
      uint64_t IM_CH172:1;
      uint64_t IM_CH173:1;
      uint64_t IM_CH174:1;
      uint64_t IM_CH175:1;
      uint64_t IM_CH176:1;
      uint64_t IM_CH177:1;
      uint64_t IM_CH178:1;
      uint64_t IM_CH179:1;
      uint64_t IM_CH180:1;
      uint64_t IM_CH181:1;
      uint64_t IM_CH182:1;
      uint64_t IM_CH183:1;
      uint64_t IM_CH184:1;
      uint64_t IM_CH185:1;
      uint64_t IM_CH186:1;
      uint64_t IM_CH187:1;
      uint64_t IM_CH188:1;
      uint64_t IM_CH189:1;
      uint64_t IM_CH190:1;
      uint64_t IM_CH191:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECIMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM_CH192:1;
      uint64_t IM_CH193:1;
      uint64_t IM_CH194:1;
      uint64_t IM_CH195:1;
      uint64_t IM_CH196:1;
      uint64_t IM_CH197:1;
      uint64_t IM_CH198:1;
      uint64_t IM_CH199:1;
      uint64_t IM_CH200:1;
      uint64_t IM_CH201:1;
      uint64_t IM_CH202:1;
      uint64_t IM_CH203:1;
      uint64_t IM_CH204:1;
      uint64_t IM_CH205:1;
      uint64_t IM_CH206:1;
      uint64_t IM_CH207:1;
      uint64_t IM_CH208:1;
      uint64_t IM_CH209:1;
      uint64_t IM_CH210:1;
      uint64_t IM_CH211:1;
      uint64_t IM_CH212:1;
      uint64_t IM_CH213:1;
      uint64_t IM_CH214:1;
      uint64_t IM_CH215:1;
      uint64_t IM_CH216:1;
      uint64_t IM_CH217:1;
      uint64_t IM_CH218:1;
      uint64_t IM_CH219:1;
      uint64_t IM_CH220:1;
      uint64_t IM_CH221:1;
      uint64_t IM_CH222:1;
      uint64_t IM_CH223:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECIMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM_CH224:1;
      uint64_t IM_CH225:1;
      uint64_t IM_CH226:1;
      uint64_t IM_CH227:1;
      uint64_t IM_CH228:1;
      uint64_t IM_CH229:1;
      uint64_t IM_CH230:1;
      uint64_t IM_CH231:1;
      uint64_t IM_CH232:1;
      uint64_t IM_CH233:1;
      uint64_t IM_CH234:1;
      uint64_t IM_CH235:1;
      uint64_t IM_CH236:1;
      uint64_t IM_CH237:1;
      uint64_t IM_CH238:1;
      uint64_t IM_CH239:1;
      uint64_t IM_CH240:1;
      uint64_t IM_CH241:1;
      uint64_t IM_CH242:1;
      uint64_t IM_CH243:1;
      uint64_t IM_CH244:1;
      uint64_t IM_CH245:1;
      uint64_t IM_CH246:1;
      uint64_t IM_CH247:1;
      uint64_t IM_CH248:1;
      uint64_t IM_CH249:1;
      uint64_t IM_CH250:1;
      uint64_t IM_CH251:1;
      uint64_t IM_CH252:1;
      uint64_t IM_CH253:1;
      uint64_t IM_CH254:1;
      uint64_t IM_CH255:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECIMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS_CH128:1;
      uint64_t DS_CH129:1;
      uint64_t DS_CH130:1;
      uint64_t DS_CH131:1;
      uint64_t DS_CH132:1;
      uint64_t DS_CH133:1;
      uint64_t DS_CH134:1;
      uint64_t DS_CH135:1;
      uint64_t DS_CH136:1;
      uint64_t DS_CH137:1;
      uint64_t DS_CH138:1;
      uint64_t DS_CH139:1;
      uint64_t DS_CH140:1;
      uint64_t DS_CH141:1;
      uint64_t DS_CH142:1;
      uint64_t DS_CH143:1;
      uint64_t DS_CH144:1;
      uint64_t DS_CH145:1;
      uint64_t DS_CH146:1;
      uint64_t DS_CH147:1;
      uint64_t DS_CH148:1;
      uint64_t DS_CH149:1;
      uint64_t DS_CH150:1;
      uint64_t DS_CH151:1;
      uint64_t DS_CH152:1;
      uint64_t DS_CH153:1;
      uint64_t DS_CH154:1;
      uint64_t DS_CH155:1;
      uint64_t DS_CH156:1;
      uint64_t DS_CH157:1;
      uint64_t DS_CH158:1;
      uint64_t DS_CH159:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS_CH160:1;
      uint64_t DS_CH161:1;
      uint64_t DS_CH162:1;
      uint64_t DS_CH163:1;
      uint64_t DS_CH164:1;
      uint64_t DS_CH165:1;
      uint64_t DS_CH166:1;
      uint64_t DS_CH167:1;
      uint64_t DS_CH168:1;
      uint64_t DS_CH169:1;
      uint64_t DS_CH170:1;
      uint64_t DS_CH171:1;
      uint64_t DS_CH172:1;
      uint64_t DS_CH173:1;
      uint64_t DS_CH174:1;
      uint64_t DS_CH175:1;
      uint64_t DS_CH176:1;
      uint64_t DS_CH177:1;
      uint64_t DS_CH178:1;
      uint64_t DS_CH179:1;
      uint64_t DS_CH180:1;
      uint64_t DS_CH181:1;
      uint64_t DS_CH182:1;
      uint64_t DS_CH183:1;
      uint64_t DS_CH184:1;
      uint64_t DS_CH185:1;
      uint64_t DS_CH186:1;
      uint64_t DS_CH187:1;
      uint64_t DS_CH188:1;
      uint64_t DS_CH189:1;
      uint64_t DS_CH190:1;
      uint64_t DS_CH191:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS_CH192:1;
      uint64_t DS_CH193:1;
      uint64_t DS_CH194:1;
      uint64_t DS_CH195:1;
      uint64_t DS_CH196:1;
      uint64_t DS_CH197:1;
      uint64_t DS_CH198:1;
      uint64_t DS_CH199:1;
      uint64_t DS_CH200:1;
      uint64_t DS_CH201:1;
      uint64_t DS_CH202:1;
      uint64_t DS_CH203:1;
      uint64_t DS_CH204:1;
      uint64_t DS_CH205:1;
      uint64_t DS_CH206:1;
      uint64_t DS_CH207:1;
      uint64_t DS_CH208:1;
      uint64_t DS_CH209:1;
      uint64_t DS_CH210:1;
      uint64_t DS_CH211:1;
      uint64_t DS_CH212:1;
      uint64_t DS_CH213:1;
      uint64_t DS_CH214:1;
      uint64_t DS_CH215:1;
      uint64_t DS_CH216:1;
      uint64_t DS_CH217:1;
      uint64_t DS_CH218:1;
      uint64_t DS_CH219:1;
      uint64_t DS_CH220:1;
      uint64_t DS_CH221:1;
      uint64_t DS_CH222:1;
      uint64_t DS_CH223:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS_CH224:1;
      uint64_t DS_CH225:1;
      uint64_t DS_CH226:1;
      uint64_t DS_CH227:1;
      uint64_t DS_CH228:1;
      uint64_t DS_CH229:1;
      uint64_t DS_CH230:1;
      uint64_t DS_CH231:1;
      uint64_t DS_CH232:1;
      uint64_t DS_CH233:1;
      uint64_t DS_CH234:1;
      uint64_t DS_CH235:1;
      uint64_t DS_CH236:1;
      uint64_t DS_CH237:1;
      uint64_t DS_CH238:1;
      uint64_t DS_CH239:1;
      uint64_t DS_CH240:1;
      uint64_t DS_CH241:1;
      uint64_t DS_CH242:1;
      uint64_t DS_CH243:1;
      uint64_t DS_CH244:1;
      uint64_t DS_CH245:1;
      uint64_t DS_CH246:1;
      uint64_t DS_CH247:1;
      uint64_t DS_CH248:1;
      uint64_t DS_CH249:1;
      uint64_t DS_CH250:1;
      uint64_t DS_CH251:1;
      uint64_t DS_CH252:1;
      uint64_t DS_CH253:1;
      uint64_t DS_CH254:1;
      uint64_t DS_CH255:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCE_CH128:1;
      uint64_t NCE_CH129:1;
      uint64_t NCE_CH130:1;
      uint64_t NCE_CH131:1;
      uint64_t NCE_CH132:1;
      uint64_t NCE_CH133:1;
      uint64_t NCE_CH134:1;
      uint64_t NCE_CH135:1;
      uint64_t NCE_CH136:1;
      uint64_t NCE_CH137:1;
      uint64_t NCE_CH138:1;
      uint64_t NCE_CH139:1;
      uint64_t NCE_CH140:1;
      uint64_t NCE_CH141:1;
      uint64_t NCE_CH142:1;
      uint64_t NCE_CH143:1;
      uint64_t NCE_CH144:1;
      uint64_t NCE_CH145:1;
      uint64_t NCE_CH146:1;
      uint64_t NCE_CH147:1;
      uint64_t NCE_CH148:1;
      uint64_t NCE_CH149:1;
      uint64_t NCE_CH150:1;
      uint64_t NCE_CH151:1;
      uint64_t NCE_CH152:1;
      uint64_t NCE_CH153:1;
      uint64_t NCE_CH154:1;
      uint64_t NCE_CH155:1;
      uint64_t NCE_CH156:1;
      uint64_t NCE_CH157:1;
      uint64_t NCE_CH158:1;
      uint64_t NCE_CH159:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECNCMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCE_CH160:1;
      uint64_t NCE_CH161:1;
      uint64_t NCE_CH162:1;
      uint64_t NCE_CH163:1;
      uint64_t NCE_CH164:1;
      uint64_t NCE_CH165:1;
      uint64_t NCE_CH166:1;
      uint64_t NCE_CH167:1;
      uint64_t NCE_CH168:1;
      uint64_t NCE_CH169:1;
      uint64_t NCE_CH170:1;
      uint64_t NCE_CH171:1;
      uint64_t NCE_CH172:1;
      uint64_t NCE_CH173:1;
      uint64_t NCE_CH174:1;
      uint64_t NCE_CH175:1;
      uint64_t NCE_CH176:1;
      uint64_t NCE_CH177:1;
      uint64_t NCE_CH178:1;
      uint64_t NCE_CH179:1;
      uint64_t NCE_CH180:1;
      uint64_t NCE_CH181:1;
      uint64_t NCE_CH182:1;
      uint64_t NCE_CH183:1;
      uint64_t NCE_CH184:1;
      uint64_t NCE_CH185:1;
      uint64_t NCE_CH186:1;
      uint64_t NCE_CH187:1;
      uint64_t NCE_CH188:1;
      uint64_t NCE_CH189:1;
      uint64_t NCE_CH190:1;
      uint64_t NCE_CH191:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECNCMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCE_CH192:1;
      uint64_t NCE_CH193:1;
      uint64_t NCE_CH194:1;
      uint64_t NCE_CH195:1;
      uint64_t NCE_CH196:1;
      uint64_t NCE_CH197:1;
      uint64_t NCE_CH198:1;
      uint64_t NCE_CH199:1;
      uint64_t NCE_CH200:1;
      uint64_t NCE_CH201:1;
      uint64_t NCE_CH202:1;
      uint64_t NCE_CH203:1;
      uint64_t NCE_CH204:1;
      uint64_t NCE_CH205:1;
      uint64_t NCE_CH206:1;
      uint64_t NCE_CH207:1;
      uint64_t NCE_CH208:1;
      uint64_t NCE_CH209:1;
      uint64_t NCE_CH210:1;
      uint64_t NCE_CH211:1;
      uint64_t NCE_CH212:1;
      uint64_t NCE_CH213:1;
      uint64_t NCE_CH214:1;
      uint64_t NCE_CH215:1;
      uint64_t NCE_CH216:1;
      uint64_t NCE_CH217:1;
      uint64_t NCE_CH218:1;
      uint64_t NCE_CH219:1;
      uint64_t NCE_CH220:1;
      uint64_t NCE_CH221:1;
      uint64_t NCE_CH222:1;
      uint64_t NCE_CH223:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECNCMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCE_CH224:1;
      uint64_t NCE_CH225:1;
      uint64_t NCE_CH226:1;
      uint64_t NCE_CH227:1;
      uint64_t NCE_CH228:1;
      uint64_t NCE_CH229:1;
      uint64_t NCE_CH230:1;
      uint64_t NCE_CH231:1;
      uint64_t NCE_CH232:1;
      uint64_t NCE_CH233:1;
      uint64_t NCE_CH234:1;
      uint64_t NCE_CH235:1;
      uint64_t NCE_CH236:1;
      uint64_t NCE_CH237:1;
      uint64_t NCE_CH238:1;
      uint64_t NCE_CH239:1;
      uint64_t NCE_CH240:1;
      uint64_t NCE_CH241:1;
      uint64_t NCE_CH242:1;
      uint64_t NCE_CH243:1;
      uint64_t NCE_CH244:1;
      uint64_t NCE_CH245:1;
      uint64_t NCE_CH246:1;
      uint64_t NCE_CH247:1;
      uint64_t NCE_CH248:1;
      uint64_t NCE_CH249:1;
      uint64_t NCE_CH250:1;
      uint64_t NCE_CH251:1;
      uint64_t NCE_CH252:1;
      uint64_t NCE_CH253:1;
      uint64_t NCE_CH254:1;
      uint64_t NCE_CH255:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECNCMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCE_CH128:1;
      uint64_t JCE_CH129:1;
      uint64_t JCE_CH130:1;
      uint64_t JCE_CH131:1;
      uint64_t JCE_CH132:1;
      uint64_t JCE_CH133:1;
      uint64_t JCE_CH134:1;
      uint64_t JCE_CH135:1;
      uint64_t JCE_CH136:1;
      uint64_t JCE_CH137:1;
      uint64_t JCE_CH138:1;
      uint64_t JCE_CH139:1;
      uint64_t JCE_CH140:1;
      uint64_t JCE_CH141:1;
      uint64_t JCE_CH142:1;
      uint64_t JCE_CH143:1;
      uint64_t JCE_CH144:1;
      uint64_t JCE_CH145:1;
      uint64_t JCE_CH146:1;
      uint64_t JCE_CH147:1;
      uint64_t JCE_CH148:1;
      uint64_t JCE_CH149:1;
      uint64_t JCE_CH150:1;
      uint64_t JCE_CH151:1;
      uint64_t JCE_CH152:1;
      uint64_t JCE_CH153:1;
      uint64_t JCE_CH154:1;
      uint64_t JCE_CH155:1;
      uint64_t JCE_CH156:1;
      uint64_t JCE_CH157:1;
      uint64_t JCE_CH158:1;
      uint64_t JCE_CH159:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECJCMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCE_CH160:1;
      uint64_t JCE_CH161:1;
      uint64_t JCE_CH162:1;
      uint64_t JCE_CH163:1;
      uint64_t JCE_CH164:1;
      uint64_t JCE_CH165:1;
      uint64_t JCE_CH166:1;
      uint64_t JCE_CH167:1;
      uint64_t JCE_CH168:1;
      uint64_t JCE_CH169:1;
      uint64_t JCE_CH170:1;
      uint64_t JCE_CH171:1;
      uint64_t JCE_CH172:1;
      uint64_t JCE_CH173:1;
      uint64_t JCE_CH174:1;
      uint64_t JCE_CH175:1;
      uint64_t JCE_CH176:1;
      uint64_t JCE_CH177:1;
      uint64_t JCE_CH178:1;
      uint64_t JCE_CH179:1;
      uint64_t JCE_CH180:1;
      uint64_t JCE_CH181:1;
      uint64_t JCE_CH182:1;
      uint64_t JCE_CH183:1;
      uint64_t JCE_CH184:1;
      uint64_t JCE_CH185:1;
      uint64_t JCE_CH186:1;
      uint64_t JCE_CH187:1;
      uint64_t JCE_CH188:1;
      uint64_t JCE_CH189:1;
      uint64_t JCE_CH190:1;
      uint64_t JCE_CH191:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECJCMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCE_CH192:1;
      uint64_t JCE_CH193:1;
      uint64_t JCE_CH194:1;
      uint64_t JCE_CH195:1;
      uint64_t JCE_CH196:1;
      uint64_t JCE_CH197:1;
      uint64_t JCE_CH198:1;
      uint64_t JCE_CH199:1;
      uint64_t JCE_CH200:1;
      uint64_t JCE_CH201:1;
      uint64_t JCE_CH202:1;
      uint64_t JCE_CH203:1;
      uint64_t JCE_CH204:1;
      uint64_t JCE_CH205:1;
      uint64_t JCE_CH206:1;
      uint64_t JCE_CH207:1;
      uint64_t JCE_CH208:1;
      uint64_t JCE_CH209:1;
      uint64_t JCE_CH210:1;
      uint64_t JCE_CH211:1;
      uint64_t JCE_CH212:1;
      uint64_t JCE_CH213:1;
      uint64_t JCE_CH214:1;
      uint64_t JCE_CH215:1;
      uint64_t JCE_CH216:1;
      uint64_t JCE_CH217:1;
      uint64_t JCE_CH218:1;
      uint64_t JCE_CH219:1;
      uint64_t JCE_CH220:1;
      uint64_t JCE_CH221:1;
      uint64_t JCE_CH222:1;
      uint64_t JCE_CH223:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECJCMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCE_CH224:1;
      uint64_t JCE_CH225:1;
      uint64_t JCE_CH226:1;
      uint64_t JCE_CH227:1;
      uint64_t JCE_CH228:1;
      uint64_t JCE_CH229:1;
      uint64_t JCE_CH230:1;
      uint64_t JCE_CH231:1;
      uint64_t JCE_CH232:1;
      uint64_t JCE_CH233:1;
      uint64_t JCE_CH234:1;
      uint64_t JCE_CH235:1;
      uint64_t JCE_CH236:1;
      uint64_t JCE_CH237:1;
      uint64_t JCE_CH238:1;
      uint64_t JCE_CH239:1;
      uint64_t JCE_CH240:1;
      uint64_t JCE_CH241:1;
      uint64_t JCE_CH242:1;
      uint64_t JCE_CH243:1;
      uint64_t JCE_CH244:1;
      uint64_t JCE_CH245:1;
      uint64_t JCE_CH246:1;
      uint64_t JCE_CH247:1;
      uint64_t JCE_CH248:1;
      uint64_t JCE_CH249:1;
      uint64_t JCE_CH250:1;
      uint64_t JCE_CH251:1;
      uint64_t JCE_CH252:1;
      uint64_t JCE_CH253:1;
      uint64_t JCE_CH254:1;
      uint64_t JCE_CH255:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECJCMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH128:4;
      uint64_t WSEL_CH129:4;
      uint64_t WSEL_CH130:4;
      uint64_t WSEL_CH131:4;
      uint64_t WSEL_CH132:4;
      uint64_t WSEL_CH133:4;
      uint64_t WSEL_CH134:4;
      uint64_t WSEL_CH135:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH136:4;
      uint64_t WSEL_CH137:4;
      uint64_t WSEL_CH138:4;
      uint64_t WSEL_CH139:4;
      uint64_t WSEL_CH140:4;
      uint64_t WSEL_CH141:4;
      uint64_t WSEL_CH142:4;
      uint64_t WSEL_CH143:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH144:4;
      uint64_t WSEL_CH145:4;
      uint64_t WSEL_CH146:4;
      uint64_t WSEL_CH147:4;
      uint64_t WSEL_CH148:4;
      uint64_t WSEL_CH149:4;
      uint64_t WSEL_CH150:4;
      uint64_t WSEL_CH151:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH152:4;
      uint64_t WSEL_CH153:4;
      uint64_t WSEL_CH154:4;
      uint64_t WSEL_CH155:4;
      uint64_t WSEL_CH156:4;
      uint64_t WSEL_CH157:4;
      uint64_t WSEL_CH158:4;
      uint64_t WSEL_CH159:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH160:4;
      uint64_t WSEL_CH161:4;
      uint64_t WSEL_CH162:4;
      uint64_t WSEL_CH163:4;
      uint64_t WSEL_CH164:4;
      uint64_t WSEL_CH165:4;
      uint64_t WSEL_CH166:4;
      uint64_t WSEL_CH167:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH168:4;
      uint64_t WSEL_CH169:4;
      uint64_t WSEL_CH170:4;
      uint64_t WSEL_CH171:4;
      uint64_t WSEL_CH172:4;
      uint64_t WSEL_CH173:4;
      uint64_t WSEL_CH174:4;
      uint64_t WSEL_CH175:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH176:4;
      uint64_t WSEL_CH177:4;
      uint64_t WSEL_CH178:4;
      uint64_t WSEL_CH179:4;
      uint64_t WSEL_CH180:4;
      uint64_t WSEL_CH181:4;
      uint64_t WSEL_CH182:4;
      uint64_t WSEL_CH183:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH184:4;
      uint64_t WSEL_CH185:4;
      uint64_t WSEL_CH186:4;
      uint64_t WSEL_CH187:4;
      uint64_t WSEL_CH188:4;
      uint64_t WSEL_CH189:4;
      uint64_t WSEL_CH190:4;
      uint64_t WSEL_CH191:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH192:4;
      uint64_t WSEL_CH193:4;
      uint64_t WSEL_CH194:4;
      uint64_t WSEL_CH195:4;
      uint64_t WSEL_CH196:4;
      uint64_t WSEL_CH197:4;
      uint64_t WSEL_CH198:4;
      uint64_t WSEL_CH199:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH200:4;
      uint64_t WSEL_CH201:4;
      uint64_t WSEL_CH202:4;
      uint64_t WSEL_CH203:4;
      uint64_t WSEL_CH204:4;
      uint64_t WSEL_CH205:4;
      uint64_t WSEL_CH206:4;
      uint64_t WSEL_CH207:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH208:4;
      uint64_t WSEL_CH209:4;
      uint64_t WSEL_CH210:4;
      uint64_t WSEL_CH211:4;
      uint64_t WSEL_CH212:4;
      uint64_t WSEL_CH213:4;
      uint64_t WSEL_CH214:4;
      uint64_t WSEL_CH215:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH216:4;
      uint64_t WSEL_CH217:4;
      uint64_t WSEL_CH218:4;
      uint64_t WSEL_CH219:4;
      uint64_t WSEL_CH220:4;
      uint64_t WSEL_CH221:4;
      uint64_t WSEL_CH222:4;
      uint64_t WSEL_CH223:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH224:4;
      uint64_t WSEL_CH225:4;
      uint64_t WSEL_CH226:4;
      uint64_t WSEL_CH227:4;
      uint64_t WSEL_CH228:4;
      uint64_t WSEL_CH229:4;
      uint64_t WSEL_CH230:4;
      uint64_t WSEL_CH231:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH232:4;
      uint64_t WSEL_CH233:4;
      uint64_t WSEL_CH234:4;
      uint64_t WSEL_CH235:4;
      uint64_t WSEL_CH236:4;
      uint64_t WSEL_CH237:4;
      uint64_t WSEL_CH238:4;
      uint64_t WSEL_CH239:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH240:4;
      uint64_t WSEL_CH241:4;
      uint64_t WSEL_CH242:4;
      uint64_t WSEL_CH243:4;
      uint64_t WSEL_CH244:4;
      uint64_t WSEL_CH245:4;
      uint64_t WSEL_CH246:4;
      uint64_t WSEL_CH247:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH248:4;
      uint64_t WSEL_CH249:4;
      uint64_t WSEL_CH250:4;
      uint64_t WSEL_CH251:4;
      uint64_t WSEL_CH252:4;
      uint64_t WSEL_CH253:4;
      uint64_t WSEL_CH254:4;
      uint64_t WSEL_CH255:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWSELR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN_CH128:1;
      uint64_t WEN_CH129:1;
      uint64_t WEN_CH130:1;
      uint64_t WEN_CH131:1;
      uint64_t WEN_CH132:1;
      uint64_t WEN_CH133:1;
      uint64_t WEN_CH134:1;
      uint64_t WEN_CH135:1;
      uint64_t WEN_CH136:1;
      uint64_t WEN_CH137:1;
      uint64_t WEN_CH138:1;
      uint64_t WEN_CH139:1;
      uint64_t WEN_CH140:1;
      uint64_t WEN_CH141:1;
      uint64_t WEN_CH142:1;
      uint64_t WEN_CH143:1;
      uint64_t WEN_CH144:1;
      uint64_t WEN_CH145:1;
      uint64_t WEN_CH146:1;
      uint64_t WEN_CH147:1;
      uint64_t WEN_CH148:1;
      uint64_t WEN_CH149:1;
      uint64_t WEN_CH150:1;
      uint64_t WEN_CH151:1;
      uint64_t WEN_CH152:1;
      uint64_t WEN_CH153:1;
      uint64_t WEN_CH154:1;
      uint64_t WEN_CH155:1;
      uint64_t WEN_CH156:1;
      uint64_t WEN_CH157:1;
      uint64_t WEN_CH158:1;
      uint64_t WEN_CH159:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWENR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN_CH160:1;
      uint64_t WEN_CH161:1;
      uint64_t WEN_CH162:1;
      uint64_t WEN_CH163:1;
      uint64_t WEN_CH164:1;
      uint64_t WEN_CH165:1;
      uint64_t WEN_CH166:1;
      uint64_t WEN_CH167:1;
      uint64_t WEN_CH168:1;
      uint64_t WEN_CH169:1;
      uint64_t WEN_CH170:1;
      uint64_t WEN_CH171:1;
      uint64_t WEN_CH172:1;
      uint64_t WEN_CH173:1;
      uint64_t WEN_CH174:1;
      uint64_t WEN_CH175:1;
      uint64_t WEN_CH176:1;
      uint64_t WEN_CH177:1;
      uint64_t WEN_CH178:1;
      uint64_t WEN_CH179:1;
      uint64_t WEN_CH180:1;
      uint64_t WEN_CH181:1;
      uint64_t WEN_CH182:1;
      uint64_t WEN_CH183:1;
      uint64_t WEN_CH184:1;
      uint64_t WEN_CH185:1;
      uint64_t WEN_CH186:1;
      uint64_t WEN_CH187:1;
      uint64_t WEN_CH188:1;
      uint64_t WEN_CH189:1;
      uint64_t WEN_CH190:1;
      uint64_t WEN_CH191:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN_CH192:1;
      uint64_t WEN_CH193:1;
      uint64_t WEN_CH194:1;
      uint64_t WEN_CH195:1;
      uint64_t WEN_CH196:1;
      uint64_t WEN_CH197:1;
      uint64_t WEN_CH198:1;
      uint64_t WEN_CH199:1;
      uint64_t WEN_CH200:1;
      uint64_t WEN_CH201:1;
      uint64_t WEN_CH202:1;
      uint64_t WEN_CH203:1;
      uint64_t WEN_CH204:1;
      uint64_t WEN_CH205:1;
      uint64_t WEN_CH206:1;
      uint64_t WEN_CH207:1;
      uint64_t WEN_CH208:1;
      uint64_t WEN_CH209:1;
      uint64_t WEN_CH210:1;
      uint64_t WEN_CH211:1;
      uint64_t WEN_CH212:1;
      uint64_t WEN_CH213:1;
      uint64_t WEN_CH214:1;
      uint64_t WEN_CH215:1;
      uint64_t WEN_CH216:1;
      uint64_t WEN_CH217:1;
      uint64_t WEN_CH218:1;
      uint64_t WEN_CH219:1;
      uint64_t WEN_CH220:1;
      uint64_t WEN_CH221:1;
      uint64_t WEN_CH222:1;
      uint64_t WEN_CH223:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWENR2;

