iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN_CH224:1;
      uint64_t WEN_CH225:1;
      uint64_t WEN_CH226:1;
      uint64_t WEN_CH227:1;
      uint64_t WEN_CH228:1;
      uint64_t WEN_CH229:1;
      uint64_t WEN_CH230:1;
      uint64_t WEN_CH231:1;
      uint64_t WEN_CH232:1;
      uint64_t WEN_CH233:1;
      uint64_t WEN_CH234:1;
      uint64_t WEN_CH235:1;
      uint64_t WEN_CH236:1;
      uint64_t WEN_CH237:1;
      uint64_t WEN_CH238:1;
      uint64_t WEN_CH239:1;
      uint64_t WEN_CH240:1;
      uint64_t WEN_CH241:1;
      uint64_t WEN_CH242:1;
      uint64_t WEN_CH243:1;
      uint64_t WEN_CH244:1;
      uint64_t WEN_CH245:1;
      uint64_t WEN_CH246:1;
      uint64_t WEN_CH247:1;
      uint64_t WEN_CH248:1;
      uint64_t WEN_CH249:1;
      uint64_t WEN_CH250:1;
      uint64_t WEN_CH251:1;
      uint64_t WEN_CH252:1;
      uint64_t WEN_CH253:1;
      uint64_t WEN_CH254:1;
      uint64_t WEN_CH255:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECWENR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH128:1;
      uint64_t AWOR_CH129:1;
      uint64_t AWOR_CH130:1;
      uint64_t AWOR_CH131:1;
      uint64_t AWOR_CH132:1;
      uint64_t AWOR_CH133:1;
      uint64_t AWOR_CH134:1;
      uint64_t AWOR_CH135:1;
      uint64_t AWOR_CH136:1;
      uint64_t AWOR_CH137:1;
      uint64_t AWOR_CH138:1;
      uint64_t AWOR_CH139:1;
      uint64_t AWOR_CH140:1;
      uint64_t AWOR_CH141:1;
      uint64_t AWOR_CH142:1;
      uint64_t AWOR_CH143:1;
      uint64_t AWOR_CH144:1;
      uint64_t AWOR_CH145:1;
      uint64_t AWOR_CH146:1;
      uint64_t AWOR_CH147:1;
      uint64_t AWOR_CH148:1;
      uint64_t AWOR_CH149:1;
      uint64_t AWOR_CH150:1;
      uint64_t AWOR_CH151:1;
      uint64_t AWOR_CH152:1;
      uint64_t AWOR_CH153:1;
      uint64_t AWOR_CH154:1;
      uint64_t AWOR_CH155:1;
      uint64_t AWOR_CH156:1;
      uint64_t AWOR_CH157:1;
      uint64_t AWOR_CH158:1;
      uint64_t AWOR_CH159:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECAWORR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH160:1;
      uint64_t AWOR_CH161:1;
      uint64_t AWOR_CH162:1;
      uint64_t AWOR_CH163:1;
      uint64_t AWOR_CH164:1;
      uint64_t AWOR_CH165:1;
      uint64_t AWOR_CH166:1;
      uint64_t AWOR_CH167:1;
      uint64_t AWOR_CH168:1;
      uint64_t AWOR_CH169:1;
      uint64_t AWOR_CH170:1;
      uint64_t AWOR_CH171:1;
      uint64_t AWOR_CH172:1;
      uint64_t AWOR_CH173:1;
      uint64_t AWOR_CH174:1;
      uint64_t AWOR_CH175:1;
      uint64_t AWOR_CH176:1;
      uint64_t AWOR_CH177:1;
      uint64_t AWOR_CH178:1;
      uint64_t AWOR_CH179:1;
      uint64_t AWOR_CH180:1;
      uint64_t AWOR_CH181:1;
      uint64_t AWOR_CH182:1;
      uint64_t AWOR_CH183:1;
      uint64_t AWOR_CH184:1;
      uint64_t AWOR_CH185:1;
      uint64_t AWOR_CH186:1;
      uint64_t AWOR_CH187:1;
      uint64_t AWOR_CH188:1;
      uint64_t AWOR_CH189:1;
      uint64_t AWOR_CH190:1;
      uint64_t AWOR_CH191:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECAWORR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH192:1;
      uint64_t AWOR_CH193:1;
      uint64_t AWOR_CH194:1;
      uint64_t AWOR_CH195:1;
      uint64_t AWOR_CH196:1;
      uint64_t AWOR_CH197:1;
      uint64_t AWOR_CH198:1;
      uint64_t AWOR_CH199:1;
      uint64_t AWOR_CH200:1;
      uint64_t AWOR_CH201:1;
      uint64_t AWOR_CH202:1;
      uint64_t AWOR_CH203:1;
      uint64_t AWOR_CH204:1;
      uint64_t AWOR_CH205:1;
      uint64_t AWOR_CH206:1;
      uint64_t AWOR_CH207:1;
      uint64_t AWOR_CH208:1;
      uint64_t AWOR_CH209:1;
      uint64_t AWOR_CH210:1;
      uint64_t AWOR_CH211:1;
      uint64_t AWOR_CH212:1;
      uint64_t AWOR_CH213:1;
      uint64_t AWOR_CH214:1;
      uint64_t AWOR_CH215:1;
      uint64_t AWOR_CH216:1;
      uint64_t AWOR_CH217:1;
      uint64_t AWOR_CH218:1;
      uint64_t AWOR_CH219:1;
      uint64_t AWOR_CH220:1;
      uint64_t AWOR_CH221:1;
      uint64_t AWOR_CH222:1;
      uint64_t AWOR_CH223:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECAWORR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH224:1;
      uint64_t AWOR_CH225:1;
      uint64_t AWOR_CH226:1;
      uint64_t AWOR_CH227:1;
      uint64_t AWOR_CH228:1;
      uint64_t AWOR_CH229:1;
      uint64_t AWOR_CH230:1;
      uint64_t AWOR_CH231:1;
      uint64_t AWOR_CH232:1;
      uint64_t AWOR_CH233:1;
      uint64_t AWOR_CH234:1;
      uint64_t AWOR_CH235:1;
      uint64_t AWOR_CH236:1;
      uint64_t AWOR_CH237:1;
      uint64_t AWOR_CH238:1;
      uint64_t AWOR_CH239:1;
      uint64_t AWOR_CH240:1;
      uint64_t AWOR_CH241:1;
      uint64_t AWOR_CH242:1;
      uint64_t AWOR_CH243:1;
      uint64_t AWOR_CH244:1;
      uint64_t AWOR_CH245:1;
      uint64_t AWOR_CH246:1;
      uint64_t AWOR_CH247:1;
      uint64_t AWOR_CH248:1;
      uint64_t AWOR_CH249:1;
      uint64_t AWOR_CH250:1;
      uint64_t AWOR_CH251:1;
      uint64_t AWOR_CH252:1;
      uint64_t AWOR_CH253:1;
      uint64_t AWOR_CH254:1;
      uint64_t AWOR_CH255:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECAWORR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_ECH135_128:7;
      uint64_t reservedSpace0:1;
      uint64_t ICSEL_ECH143_136:7;
      uint64_t reservedSpace1:1;
      uint64_t ICSEL_ECH151_144:7;
      uint64_t reservedSpace2:1;
      uint64_t ICSEL_ECH159_152:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECMICR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_ECH167_160:7;
      uint64_t reservedSpace0:1;
      uint64_t ICSEL_ECH175_168:7;
      uint64_t reservedSpace1:1;
      uint64_t ICSEL_ECH183_176:7;
      uint64_t reservedSpace2:1;
      uint64_t ICSEL_ECH191_184:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECMICR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_ECH199_192:7;
      uint64_t reservedSpace0:1;
      uint64_t ICSEL_ECH207_200:7;
      uint64_t reservedSpace1:1;
      uint64_t ICSEL_ECH215_208:7;
      uint64_t reservedSpace2:1;
      uint64_t ICSEL_ECH223_216:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECMICR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICSEL_ECH231_224:7;
      uint64_t reservedSpace0:1;
      uint64_t ICSEL_ECH239_232:7;
      uint64_t reservedSpace1:1;
      uint64_t ICSEL_ECH247_240:7;
      uint64_t reservedSpace2:1;
      uint64_t ICSEL_ECH255_248:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECMICR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR129;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR130;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR132;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR133;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR134;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR135;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR136;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR137;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR138;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR139;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR140;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR141;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR142;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR144;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR145;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR146;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR148;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR149;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR150;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR151;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR152;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR153;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR154;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR155;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR156;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR157;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR158;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR159;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR160;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR161;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR162;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR163;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR164;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR165;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR166;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR167;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR168;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR169;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR170;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR171;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR172;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR173;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR174;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR175;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR177;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR178;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR179;

