iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR180;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR181;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR182;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR183;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR184;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR185;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR186;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR188;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR189;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR190;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR193;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR194;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR195;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR196;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR197;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR198;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR199;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR200;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR201;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR202;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR203;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR204;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR205;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR206;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR207;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR208;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR209;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR210;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR212;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR213;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR214;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR215;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR216;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR217;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR218;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR219;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR220;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR221;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR222;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR232;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR233;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR251;

