iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
      uint64_t reservedSpace0:4;
      uint64_t CTSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR255;

};

#define SAR_ADC_12bit_B0 (*(volatile struct SAR_ADC_12bit_B0_tag *) 0xf7e3c000)

struct SIUL2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR_MASK:4;
      uint64_t MAJOR_MASK:4;
      uint64_t reservedSpace0:1;
      uint64_t BALL_CONF:1;
      uint64_t PKG:5;
      uint64_t reservedSpace1:1;
      uint64_t PARTNUM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FAMILYNUM:8;
      uint64_t reservedSpace1:7;
      uint64_t FLASH_SIZE_2:4;
      uint64_t FLASH_SIZE_1:4;
      uint64_t SF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF0:1;
      uint64_t EIF1:1;
      uint64_t EIF2:1;
      uint64_t EIF3:1;
      uint64_t EIF4:1;
      uint64_t EIF5:1;
      uint64_t EIF6:1;
      uint64_t EIF7:1;
      uint64_t EIF8:1;
      uint64_t EIF9:1;
      uint64_t EIF10:1;
      uint64_t EIF11:1;
      uint64_t EIF12:1;
      uint64_t EIF13:1;
      uint64_t EIF14:1;
      uint64_t EIF15:1;
      uint64_t EIF16:1;
      uint64_t EIF17:1;
      uint64_t EIF18:1;
      uint64_t EIF19:1;
      uint64_t EIF20:1;
      uint64_t EIF21:1;
      uint64_t EIF22:1;
      uint64_t EIF23:1;
      uint64_t EIF24:1;
      uint64_t EIF25:1;
      uint64_t EIF26:1;
      uint64_t EIF27:1;
      uint64_t EIF28:1;
      uint64_t EIF29:1;
      uint64_t EIF30:1;
      uint64_t EIF31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DISR0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRE0:1;
      uint64_t EIRE1:1;
      uint64_t EIRE2:1;
      uint64_t EIRE3:1;
      uint64_t EIRE4:1;
      uint64_t EIRE5:1;
      uint64_t EIRE6:1;
      uint64_t EIRE7:1;
      uint64_t EIRE8:1;
      uint64_t EIRE9:1;
      uint64_t EIRE10:1;
      uint64_t EIRE11:1;
      uint64_t EIRE12:1;
      uint64_t EIRE13:1;
      uint64_t EIRE14:1;
      uint64_t EIRE15:1;
      uint64_t EIRE16:1;
      uint64_t EIRE17:1;
      uint64_t EIRE18:1;
      uint64_t EIRE19:1;
      uint64_t EIRE20:1;
      uint64_t EIRE21:1;
      uint64_t EIRE22:1;
      uint64_t EIRE23:1;
      uint64_t EIRE24:1;
      uint64_t EIRE25:1;
      uint64_t EIRE26:1;
      uint64_t EIRE27:1;
      uint64_t EIRE28:1;
      uint64_t EIRE29:1;
      uint64_t EIRE30:1;
      uint64_t EIRE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRER0;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRS0:1;
      uint64_t DIRS1:1;
      uint64_t DIRS2:1;
      uint64_t DIRS3:1;
      uint64_t DIRS4:1;
      uint64_t DIRS5:1;
      uint64_t DIRS6:1;
      uint64_t DIRS7:1;
      uint64_t DIRS8:1;
      uint64_t DIRS9:1;
      uint64_t DIRS10:1;
      uint64_t DIRS11:1;
      uint64_t DIRS12:1;
      uint64_t DIRS13:1;
      uint64_t DIRS14:1;
      uint64_t DIRS15:1;
      uint64_t DIRS16:1;
      uint64_t DIRS17:1;
      uint64_t DIRS18:1;
      uint64_t DIRS19:1;
      uint64_t DIRS20:1;
      uint64_t DIRS21:1;
      uint64_t DIRS22:1;
      uint64_t DIRS23:1;
      uint64_t DIRS24:1;
      uint64_t DIRS25:1;
      uint64_t DIRS26:1;
      uint64_t DIRS27:1;
      uint64_t DIRS28:1;
      uint64_t DIRS29:1;
      uint64_t DIRS30:1;
      uint64_t DIRS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSR0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE0:1;
      uint64_t IREE1:1;
      uint64_t IREE2:1;
      uint64_t IREE3:1;
      uint64_t IREE4:1;
      uint64_t IREE5:1;
      uint64_t IREE6:1;
      uint64_t IREE7:1;
      uint64_t IREE8:1;
      uint64_t IREE9:1;
      uint64_t IREE10:1;
      uint64_t IREE11:1;
      uint64_t IREE12:1;
      uint64_t IREE13:1;
      uint64_t IREE14:1;
      uint64_t IREE15:1;
      uint64_t IREE16:1;
      uint64_t IREE17:1;
      uint64_t IREE18:1;
      uint64_t IREE19:1;
      uint64_t IREE20:1;
      uint64_t IREE21:1;
      uint64_t IREE22:1;
      uint64_t IREE23:1;
      uint64_t IREE24:1;
      uint64_t IREE25:1;
      uint64_t IREE26:1;
      uint64_t IREE27:1;
      uint64_t IREE28:1;
      uint64_t IREE29:1;
      uint64_t IREE30:1;
      uint64_t IREE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IREER0;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEE0:1;
      uint64_t IFEE1:1;
      uint64_t IFEE2:1;
      uint64_t IFEE3:1;
      uint64_t IFEE4:1;
      uint64_t IFEE5:1;
      uint64_t IFEE6:1;
      uint64_t IFEE7:1;
      uint64_t IFEE8:1;
      uint64_t IFEE9:1;
      uint64_t IFEE10:1;
      uint64_t IFEE11:1;
      uint64_t IFEE12:1;
      uint64_t IFEE13:1;
      uint64_t IFEE14:1;
      uint64_t IFEE15:1;
      uint64_t IFEE16:1;
      uint64_t IFEE17:1;
      uint64_t IFEE18:1;
      uint64_t IFEE19:1;
      uint64_t IFEE20:1;
      uint64_t IFEE21:1;
      uint64_t IFEE22:1;
      uint64_t IFEE23:1;
      uint64_t IFEE24:1;
      uint64_t IFEE25:1;
      uint64_t IFEE26:1;
      uint64_t IFEE27:1;
      uint64_t IFEE28:1;
      uint64_t IFEE29:1;
      uint64_t IFEE30:1;
      uint64_t IFEE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFEER0;

