iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO89;

