iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO142;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO144;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO145;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO146;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO148;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO149;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO150;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO151;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO152;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO153;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO154;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO155;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO156;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO157;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO158;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO159;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO160;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO161;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO162;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO163;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO164;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO165;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO166;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO167;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO168;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO169;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO170;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO171;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO172;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO173;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO174;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO175;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO177;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO178;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO179;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO180;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO181;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO182;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO183;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO184;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO185;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO186;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO188;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO189;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO190;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO193;

