iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO256;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO257;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO258;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO259;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO260;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO261;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO262;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO263;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO264;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO265;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO266;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO267;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO268;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO269;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO270;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO271;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO272;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO273;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO274;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO275;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO276;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO277;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO278;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO279;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO280;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO281;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO282;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO283;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO284;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO285;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO286;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO287;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO288;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO289;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO290;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO291;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO292;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO293;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO294;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO295;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO296;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO297;

