iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO350;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO351;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO352;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO353;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO354;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO355;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO356;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO357;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO358;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO359;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO360;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO361;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO362;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO363;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO364;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO365;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO366;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO367;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO368;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO369;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO370;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO371;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO372;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO373;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO374;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO375;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO376;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO377;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO378;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO379;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO380;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO381;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO382;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO383;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO384;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO385;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO386;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO387;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO388;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO389;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO390;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO391;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO392;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO393;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO394;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO395;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO396;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO397;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO398;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO399;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO400;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO401;

