iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO454;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO455;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO456;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO457;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO458;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO459;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO460;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO461;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO462;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO463;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO464;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO465;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO466;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO467;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO468;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO469;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO470;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO471;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO472;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO473;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO474;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO475;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO476;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO477;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO478;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO479;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO480;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO481;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO482;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO483;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO484;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO485;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO486;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO487;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO488;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO489;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO490;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO491;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO492;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO493;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO494;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO495;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO496;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO497;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO498;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO499;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO500;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO501;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO502;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO503;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO504;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO505;

