iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO506;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO507;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO508;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO509;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO510;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t reservedSpace1:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t reservedSpace2:1;
      uint64_t SMC:1;
      uint64_t ODC:3;
      uint64_t reservedSpace3:1;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_IO511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX512;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX513;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX514;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX515;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX516;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX517;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX518;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX519;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX520;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX521;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX522;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX523;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX524;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX525;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX526;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX527;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX528;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX529;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX530;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX531;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX532;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX533;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX534;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX535;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX536;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX537;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX538;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX539;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX540;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX541;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX542;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX543;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX544;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX545;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX546;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX547;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX548;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX549;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX550;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX551;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX552;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX553;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX554;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX555;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX556;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX557;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX558;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX559;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX560;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX561;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX562;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX563;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX564;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX565;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX566;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX567;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX568;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX569;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX570;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX571;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX572;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX573;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX574;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX575;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX576;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX577;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX578;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX579;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX580;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX581;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX582;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX583;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX584;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX585;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX586;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX587;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX588;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX589;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX590;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX591;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX592;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX593;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX594;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX595;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX596;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX597;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX598;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX599;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX600;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX601;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX602;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX603;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX604;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX605;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX606;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX607;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX608;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX609;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX610;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX611;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX612;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX613;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX614;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX615;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX616;

