iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX617;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX618;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX619;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX620;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX621;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX622;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX623;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX624;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX625;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX626;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX627;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX628;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX629;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX630;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX631;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX632;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX633;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX634;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX635;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX636;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX637;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX638;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX639;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX640;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX641;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX642;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX643;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX644;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX645;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX646;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX647;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX648;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX649;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX650;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX651;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX652;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX653;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX654;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX655;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX656;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX657;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX658;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX659;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX660;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX661;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX662;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX663;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX664;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX665;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX666;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX667;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX668;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX669;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX670;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX671;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX672;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX673;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX674;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX675;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX676;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX677;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX678;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX679;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX680;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX681;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX682;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX683;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX684;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX685;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX686;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX687;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX688;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX689;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX690;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX691;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX692;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX693;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX694;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX695;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX696;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX697;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX698;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX699;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX700;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX701;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX702;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX703;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX704;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX705;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX706;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX707;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX708;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX709;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX710;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX711;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX712;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX713;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX714;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX715;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX716;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX717;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX718;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX719;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX720;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX721;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX722;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX723;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX724;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX725;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX726;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX727;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX728;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX729;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX730;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX731;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX732;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX733;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX734;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX735;

