iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX736;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX737;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX738;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX739;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX740;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX741;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX742;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX743;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX744;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX745;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX746;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX747;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX748;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX749;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX750;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX751;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX752;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX753;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX754;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX755;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX756;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX757;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX758;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX759;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX760;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX761;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX762;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX763;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX764;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX765;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX766;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX767;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX768;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX769;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX770;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX771;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX772;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX773;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX774;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX775;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX776;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX777;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX778;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX779;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX780;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX781;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX782;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX783;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX784;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX785;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX786;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX787;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX788;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX789;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX790;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX791;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX792;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX793;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX794;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX795;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX796;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX797;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX798;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX799;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX800;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX801;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX802;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX803;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX804;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX805;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX806;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX807;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX808;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX809;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX810;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX811;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX812;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX813;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX814;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX815;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX816;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX817;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX818;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX819;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX820;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX821;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX822;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX823;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX824;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX825;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX826;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX827;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX828;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX829;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX830;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX831;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX832;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX833;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX834;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX835;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX836;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX837;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX838;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX839;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX840;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX841;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX842;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX843;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX844;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX845;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX846;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX847;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX848;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX849;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX850;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX851;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX852;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX853;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX854;

