iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX855;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX856;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX857;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX858;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX859;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX860;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX861;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX862;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX863;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX864;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX865;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX866;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX867;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX868;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX869;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX870;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX871;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX872;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX873;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX874;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX875;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX876;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX877;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX878;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX879;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX880;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX881;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX882;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX883;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX884;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX885;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX886;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX887;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX888;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX889;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX890;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX891;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX892;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX893;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX894;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX895;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX896;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX897;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX898;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX899;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX900;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX901;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX902;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX903;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX904;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX905;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX906;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX907;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX908;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX909;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX910;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX911;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX912;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX913;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX914;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX915;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX916;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX917;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX918;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX919;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX920;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX921;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX922;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX923;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX924;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX925;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX926;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX927;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX928;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX929;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX930;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX931;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX932;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX933;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX934;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX935;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX936;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX937;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX938;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX939;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX940;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX941;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX942;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX943;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX944;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX945;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX946;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX947;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX948;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX949;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX950;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX951;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX952;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX953;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX954;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX955;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX956;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX957;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX958;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX959;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX960;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX961;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX962;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX963;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX964;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX965;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX966;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX967;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX968;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX969;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX970;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX971;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX972;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:7;
      uint64_t INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR_MUX973;

