iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO101;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO102;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO103;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO104;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO105;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO106;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO107;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO108;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO109;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO110;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO111;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO112;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO113;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO114;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO115;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO116;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO117;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO118;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO119;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO120;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO121;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO122;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO123;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO124;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO125;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO126;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO127;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO128;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO129;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO130;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO131;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO132;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO133;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO134;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO135;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO136;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO137;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO138;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO139;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO140;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO141;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO142;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO143;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO144;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO145;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO146;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO147;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO148;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO149;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO150;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO151;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO152;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO153;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO154;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO155;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO156;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO157;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO158;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO159;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO160;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO161;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO162;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO163;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO164;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO165;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO166;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO167;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO168;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO169;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO170;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO171;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO172;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO173;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO174;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO175;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO176;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO177;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO178;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO179;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO180;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO181;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO182;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO183;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO184;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO185;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO186;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO187;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO188;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO189;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO190;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO191;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO192;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO193;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO194;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO195;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO196;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO197;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO198;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO199;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO200;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO201;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO202;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO203;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO204;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO205;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO206;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO207;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO208;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO209;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO210;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO211;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO212;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO213;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO214;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO215;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO216;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO217;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO218;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO219;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO220;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO221;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO222;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO223;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO224;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO225;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO226;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO227;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO228;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO229;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO230;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO231;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO232;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO233;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO234;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO235;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO236;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO237;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO238;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO239;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO240;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO241;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO242;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO243;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO244;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO245;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO246;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO247;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO248;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO249;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO250;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO251;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO252;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO253;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO254;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO255;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO256;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO257;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO258;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO259;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO260;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO261;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO262;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO263;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO264;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO265;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO266;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO267;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO268;

