iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO269;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO270;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO271;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO272;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO273;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO274;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO275;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO276;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO277;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO278;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO279;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO280;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO281;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO282;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO283;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO284;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO285;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO286;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO287;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO288;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO289;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO290;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO291;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO292;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO293;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO294;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO295;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO296;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO297;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO298;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO299;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO300;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO301;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO302;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO303;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO304;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO305;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO306;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO307;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO308;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO309;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO310;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO311;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO312;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO313;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO314;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO315;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO316;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO317;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO318;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO319;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO320;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO321;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO322;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO323;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO324;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO325;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO326;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO327;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO328;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO329;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO330;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO331;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO332;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO333;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO334;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO335;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO336;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO337;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO338;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO339;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO340;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO341;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO342;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO343;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO344;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO345;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO346;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO347;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO348;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO349;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO350;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO351;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO352;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO353;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO354;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO355;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO356;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO357;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO358;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO359;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO360;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO361;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO362;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO363;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO364;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO365;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO366;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO367;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO368;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO369;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO370;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO371;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO372;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO373;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO374;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO375;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO376;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO377;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO378;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO379;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO380;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO381;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO382;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO383;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO384;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO385;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO386;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO387;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO388;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO389;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO390;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO391;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO392;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO393;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO394;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO395;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO396;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO397;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO398;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO399;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO400;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO401;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO402;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO403;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO404;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO405;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO406;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO407;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO408;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO409;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO410;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO411;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO412;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO413;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO414;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO415;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO416;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO417;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO418;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO419;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO420;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO421;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO422;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO423;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO424;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO425;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO426;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO427;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO428;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO429;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO430;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO431;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO432;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO433;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO434;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO435;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO436;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO437;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO438;

