iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO439;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO440;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO441;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO442;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO443;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO444;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO445;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO446;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO447;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO448;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO449;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO450;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO451;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO452;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO453;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO454;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO455;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO456;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO457;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO458;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO459;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO460;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO461;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO462;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO463;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO464;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO465;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO466;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO467;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO468;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO469;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO470;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO471;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO472;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO473;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO474;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO475;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO476;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO477;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO478;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO479;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO480;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO481;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO482;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO483;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO484;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO485;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO486;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO487;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO488;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO489;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO490;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO491;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO492;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO493;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO494;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO495;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO496;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO497;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO498;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO499;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO500;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO501;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO502;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO503;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO504;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO505;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO506;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO507;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO508;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO509;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO510;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO511;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI96;

