iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI267;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI268;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI269;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI270;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI271;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI272;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI273;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI274;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI275;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI276;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI277;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI278;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI279;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI280;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI281;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI282;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI283;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI284;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI285;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI286;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI287;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI288;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI289;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI290;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI291;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI292;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI293;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI294;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI295;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI296;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI297;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI298;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI299;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI300;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI301;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI302;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI303;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI304;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI305;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI306;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI307;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI308;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI309;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI310;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI311;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI312;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI313;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI314;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI315;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI316;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI317;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI318;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI319;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI320;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI321;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI322;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI323;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI324;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI325;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI326;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI327;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI328;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI329;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI330;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI331;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI332;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI333;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI334;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI335;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI336;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI337;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI338;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI339;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI340;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI341;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI342;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI343;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI344;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI345;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI346;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI347;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI348;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI349;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI350;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI351;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI352;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI353;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI354;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI355;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI356;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI357;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI358;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI359;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI360;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI361;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI362;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI363;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI364;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI365;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI366;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI367;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI368;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI369;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI370;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI371;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI372;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI373;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI374;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI375;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI376;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI377;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI378;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI379;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI380;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI381;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI382;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI383;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI384;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI385;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI386;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI387;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI388;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI389;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI390;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI391;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI392;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI393;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI394;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI395;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI396;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI397;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI398;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI399;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI400;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI401;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI402;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI403;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI404;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI405;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI406;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI407;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI408;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI409;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI410;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI411;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI412;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI413;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI414;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI415;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI416;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI417;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI418;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI419;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI420;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI421;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI422;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI423;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI424;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI425;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI426;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI427;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI428;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI429;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI430;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI431;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI432;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI433;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI434;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI435;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI436;

