iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI437;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI438;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI439;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI440;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI441;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI442;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI443;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI444;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI445;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI446;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI447;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI448;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI449;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI450;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI451;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI452;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI453;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI454;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI455;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI456;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI457;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI458;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI459;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI460;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI461;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI462;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI463;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI464;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI465;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI466;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI467;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI468;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI469;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI470;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI471;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI472;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI473;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI474;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI475;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI476;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI477;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI478;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI479;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI480;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI481;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI482;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI483;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI484;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI485;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI486;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI487;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI488;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI489;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI490;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI491;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI492;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI493;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI494;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI495;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI496;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI497;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI498;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI499;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI500;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI501;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI502;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI503;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI504;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI505;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI506;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI507;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI508;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI509;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI510;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI511;

  uint16_t PGPDO0;
  uint16_t PGPDO1;
  uint16_t PGPDO2;
  uint16_t PGPDO3;
  uint16_t PGPDO4;
  uint16_t PGPDO5;
  uint16_t PGPDO6;
  uint16_t PGPDO7;
  uint16_t PGPDO8;
  uint16_t PGPDO9;
  uint16_t PGPDO10;
  uint16_t PGPDO11;
  uint16_t PGPDO12;
  uint8_t res10[38];

  uint16_t PGPDI0;
  uint16_t PGPDI1;
  uint16_t PGPDI2;
  uint16_t PGPDI3;
  uint16_t PGPDI4;
  uint16_t PGPDI5;
  uint16_t PGPDI6;
  uint16_t PGPDI7;
  uint16_t PGPDI8;
  uint16_t PGPDI9;
  uint16_t PGPDI10;
  uint16_t PGPDI11;
  uint16_t PGPDI12;
  uint8_t res11[38];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO12;

