iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define SIUL2 (*(volatile struct SIUL2_tag *) 0xf7fc0004)

struct SMPU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GVLD:1;
      uint64_t HRL:3;
      uint64_t reservedSpace0:12;
      uint64_t MERR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CESR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NRGD:4;
      uint64_t reservedSpace0:12;
      uint64_t MEOVR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CESR1;

  uint8_t res0[248];

  uint32_t EAR0;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR0;

  uint32_t EAR1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR1;

  uint32_t EAR2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR2;

  uint32_t EAR3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR3;

  uint32_t EAR4;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR4;

  uint32_t EAR5;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR5;

  uint32_t EAR6;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR6;

  uint32_t EAR7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR7;

  uint32_t EAR8;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR8;

  uint32_t EAR9;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR9;

  uint32_t EAR10;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR10;

  uint32_t EAR11;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR11;

  uint32_t EAR12;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR12;

  uint32_t EAR13;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR13;

  uint32_t EAR14;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR14;

  uint32_t EAR15;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR15;

  uint8_t res1[640];

  uint32_t RGD0_WORD0;
  uint32_t RGD0_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD0_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD0_WORD3;

  uint32_t RGD1_WORD0;
  uint32_t RGD1_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD1_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD1_WORD3;

  uint32_t RGD2_WORD0;
  uint32_t RGD2_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD2_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD2_WORD3;

