iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint32_t RGD3_WORD0;
  uint32_t RGD3_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD3_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD3_WORD3;

  uint32_t RGD4_WORD0;
  uint32_t RGD4_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD4_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD4_WORD3;

  uint32_t RGD5_WORD0;
  uint32_t RGD5_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD5_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD5_WORD3;

  uint32_t RGD6_WORD0;
  uint32_t RGD6_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD6_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD6_WORD3;

  uint32_t RGD7_WORD0;
  uint32_t RGD7_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD7_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD7_WORD3;

  uint32_t RGD8_WORD0;
  uint32_t RGD8_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD8_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD8_WORD3;

  uint32_t RGD9_WORD0;
  uint32_t RGD9_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD9_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD9_WORD3;

  uint32_t RGD10_WORD0;
  uint32_t RGD10_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD10_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD10_WORD3;

  uint32_t RGD11_WORD0;
  uint32_t RGD11_WORD1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD11_WORD2_FMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
      uint64_t FMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD11_WORD3;

