iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define SMPU_1 (*(volatile struct SMPU_1_tag *) 0xf4014000)

struct STCU2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t reservedSpace0:8;
      uint64_t MBPLLEN:1;
      uint64_t BYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUNSW:1;
      uint64_t reservedSpace0:8;
      uint64_t MBSWPLLEN:1;
      uint64_t reservedSpace1:1;
      uint64_t MBIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUNSW;

  uint32_t SKC;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_CFG:3;
      uint64_t MBU:1;
      uint64_t PMOSEN:1;
      uint64_t CRCEN:1;
      uint64_t reservedSpace0:2;
      uint64_t WRP:1;
      uint64_t reservedSpace1:15;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLLDF:7;
      uint64_t reservedSpace0:9;
      uint64_t PLLIDF:3;
      uint64_t reservedSpace1:5;
      uint64_t PLLODF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CFG;

  uint32_t WDG;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MBIFLG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_FLG;

  uint32_t CRCE;
  uint32_t CRCR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVP:1;
      uint64_t ENGE:1;
      uint64_t CRCS:1;
      uint64_t WDTO:1;
      uint64_t LOCKE:1;
      uint64_t reservedSpace0:3;
      uint64_t RFSF:1;
      uint64_t UFSF:1;
      uint64_t reservedSpace1:6;
      uint64_t INVPSW:1;
      uint64_t ENGESW:1;
      uint64_t CRCSSW:1;
      uint64_t WDTOSW:1;
      uint64_t LOCKESW:1;
      uint64_t reservedSpace2:4;
      uint64_t ABORTHW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVPUFM:1;
      uint64_t ENGEUFM:1;
      uint64_t CRCSUFM:1;
      uint64_t WDTOUFM:1;
      uint64_t LOCKEUFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_FM;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBS0:1;
      uint64_t MBS1:1;
      uint64_t MBS2:1;
      uint64_t MBS3:1;
      uint64_t MBS4:1;
      uint64_t MBS5:1;
      uint64_t MBS6:1;
      uint64_t MBS7:1;
      uint64_t MBS8:1;
      uint64_t MBS9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBS1;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBE0:1;
      uint64_t MBE1:1;
      uint64_t MBE2:1;
      uint64_t MBE3:1;
      uint64_t MBE4:1;
      uint64_t MBE5:1;
      uint64_t MBE6:1;
      uint64_t MBE7:1;
      uint64_t MBE8:1;
      uint64_t MBE9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBE1;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBSSW0:1;
      uint64_t MBSSW1:1;
      uint64_t MBSSW2:1;
      uint64_t MBSSW3:1;
      uint64_t MBSSW4:1;
      uint64_t MBSSW5:1;
      uint64_t MBSSW6:1;
      uint64_t MBSSW7:1;
      uint64_t MBSSW8:1;
      uint64_t MBSSW9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBS1SW;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBESW0:1;
      uint64_t MBESW1:1;
      uint64_t MBESW2:1;
      uint64_t MBESW3:1;
      uint64_t MBESW4:1;
      uint64_t MBESW5:1;
      uint64_t MBESW6:1;
      uint64_t MBESW7:1;
      uint64_t MBESW8:1;
      uint64_t MBESW9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBE1SW;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBUFM0:1;
      uint64_t MBUFM1:1;
      uint64_t MBUFM2:1;
      uint64_t MBUFM3:1;
      uint64_t MBUFM4:1;
      uint64_t MBUFM5:1;
      uint64_t MBUFM6:1;
      uint64_t MBUFM7:1;
      uint64_t MBUFM8:1;
      uint64_t MBUFM9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBUFM1;

  uint8_t res5[1400];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t CSM:1;
      uint64_t PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL9;

