iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
};

#define STCU2 (*(volatile struct STCU2_tag *) 0xf7f44000)

struct STM_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FRZ:1;
      uint64_t reservedSpace0:6;
      uint64_t CPS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  uint32_t CNT;
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR0;

  uint32_t CMP0;
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR1;

  uint32_t CMP1;
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR2;

  uint32_t CMP2;
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR3;

  uint32_t CMP3;
};

#define STM_2 (*(volatile struct STM_2_tag *) 0xf4070000)

struct SWT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN:1;
      uint64_t FRZ:1;
      uint64_t STP:1;
      uint64_t reservedSpace0:1;
      uint64_t SLK:1;
      uint64_t HLK:1;
      uint64_t ITR:1;
      uint64_t WND:1;
      uint64_t RIA:1;
      uint64_t SMD:2;
      uint64_t reservedSpace1:13;
      uint64_t MAP7:1;
      uint64_t MAP6:1;
      uint64_t MAP5:1;
      uint64_t MAP4:1;
      uint64_t MAP3:1;
      uint64_t MAP2:1;
      uint64_t MAP1:1;
      uint64_t MAP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  uint32_t TO;
  uint32_t WN;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint32_t CO;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SK;

};

#define SWT_2 (*(volatile struct SWT_2_tag *) 0xf4058000)

struct TDM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRSR0:1;
      uint64_t TDRSR1:1;
      uint64_t TDRSR2:1;
      uint64_t TDRSR3:1;
      uint64_t TDRSR4:1;
      uint64_t TDRSR5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDRSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFPAR:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFPAR;

  uint32_t DBA;
  uint8_t res0[4];

  uint32_t STO_KEY0;
  uint32_t STO_KEY1;
  uint32_t STO_KEY2;
  uint32_t STO_KEY3;
  uint32_t STO_KEY4;
  uint32_t STO_KEY5;
};

#define TDM_0 (*(volatile struct TDM_0_tag *) 0xf40e4000)

struct WKPU_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t ROVF:1;
      uint64_t RIF:1;
      uint64_t reservedSpace1:6;
      uint64_t NOVF2:1;
      uint64_t NIF2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFE:1;
      uint64_t RFEE:1;
      uint64_t RREE:1;
      uint64_t reservedSpace0:1;
      uint64_t RWRE:1;
      uint64_t RDSS:2;
      uint64_t RLOCK:1;
      uint64_t NFE2:1;
      uint64_t NFEE2:1;
      uint64_t NREE2:1;
      uint64_t reservedSpace1:1;
      uint64_t NWRE2:1;
      uint64_t NDSS2:2;
      uint64_t NLOCK2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF0:1;
      uint64_t EIF1:1;
      uint64_t EIF2:1;
      uint64_t EIF3:1;
      uint64_t EIF4:1;
      uint64_t EIF5:1;
      uint64_t EIF6:1;
      uint64_t EIF7:1;
      uint64_t EIF8:1;
      uint64_t EIF9:1;
      uint64_t EIF10:1;
      uint64_t EIF11:1;
      uint64_t EIF12:1;
      uint64_t EIF13:1;
      uint64_t EIF14:1;
      uint64_t EIF15:1;
      uint64_t EIF16:1;
      uint64_t EIF17:1;
      uint64_t EIF18:1;
      uint64_t EIF19:1;
      uint64_t EIF20:1;
      uint64_t EIF21:1;
      uint64_t EIF22:1;
      uint64_t EIF23:1;
      uint64_t EIF24:1;
      uint64_t EIF25:1;
      uint64_t EIF26:1;
      uint64_t EIF27:1;
      uint64_t EIF28:1;
      uint64_t EIF29:1;
      uint64_t EIF30:1;
      uint64_t EIF31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRE0:1;
      uint64_t EIRE1:1;
      uint64_t EIRE2:1;
      uint64_t EIRE3:1;
      uint64_t EIRE4:1;
      uint64_t EIRE5:1;
      uint64_t EIRE6:1;
      uint64_t EIRE7:1;
      uint64_t EIRE8:1;
      uint64_t EIRE9:1;
      uint64_t EIRE10:1;
      uint64_t EIRE11:1;
      uint64_t EIRE12:1;
      uint64_t EIRE13:1;
      uint64_t EIRE14:1;
      uint64_t EIRE15:1;
      uint64_t EIRE16:1;
      uint64_t EIRE17:1;
      uint64_t EIRE18:1;
      uint64_t EIRE19:1;
      uint64_t EIRE20:1;
      uint64_t EIRE21:1;
      uint64_t EIRE22:1;
      uint64_t EIRE23:1;
      uint64_t EIRE24:1;
      uint64_t EIRE25:1;
      uint64_t EIRE26:1;
      uint64_t EIRE27:1;
      uint64_t EIRE28:1;
      uint64_t EIRE29:1;
      uint64_t EIRE30:1;
      uint64_t EIRE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRE0:1;
      uint64_t WRE1:1;
      uint64_t WRE2:1;
      uint64_t WRE3:1;
      uint64_t WRE4:1;
      uint64_t WRE5:1;
      uint64_t WRE6:1;
      uint64_t WRE7:1;
      uint64_t WRE8:1;
      uint64_t WRE9:1;
      uint64_t WRE10:1;
      uint64_t WRE11:1;
      uint64_t WRE12:1;
      uint64_t WRE13:1;
      uint64_t WRE14:1;
      uint64_t WRE15:1;
      uint64_t WRE16:1;
      uint64_t WRE17:1;
      uint64_t WRE18:1;
      uint64_t WRE19:1;
      uint64_t WRE20:1;
      uint64_t WRE21:1;
      uint64_t WRE22:1;
      uint64_t WRE23:1;
      uint64_t WRE24:1;
      uint64_t WRE25:1;
      uint64_t WRE26:1;
      uint64_t WRE27:1;
      uint64_t WRE28:1;
      uint64_t WRE29:1;
      uint64_t WRE30:1;
      uint64_t WRE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRER;

