iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE0:1;
      uint64_t IREE1:1;
      uint64_t IREE2:1;
      uint64_t IREE3:1;
      uint64_t IREE4:1;
      uint64_t IREE5:1;
      uint64_t IREE6:1;
      uint64_t IREE7:1;
      uint64_t IREE8:1;
      uint64_t IREE9:1;
      uint64_t IREE10:1;
      uint64_t IREE11:1;
      uint64_t IREE12:1;
      uint64_t IREE13:1;
      uint64_t IREE14:1;
      uint64_t IREE15:1;
      uint64_t IREE16:1;
      uint64_t IREE17:1;
      uint64_t IREE18:1;
      uint64_t IREE19:1;
      uint64_t IREE20:1;
      uint64_t IREE21:1;
      uint64_t IREE22:1;
      uint64_t IREE23:1;
      uint64_t IREE24:1;
      uint64_t IREE25:1;
      uint64_t IREE26:1;
      uint64_t IREE27:1;
      uint64_t IREE28:1;
      uint64_t IREE29:1;
      uint64_t IREE30:1;
      uint64_t IREE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIREER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEE0:1;
      uint64_t IFEE1:1;
      uint64_t IFEE2:1;
      uint64_t IFEE3:1;
      uint64_t IFEE4:1;
      uint64_t IFEE5:1;
      uint64_t IFEE6:1;
      uint64_t IFEE7:1;
      uint64_t IFEE8:1;
      uint64_t IFEE9:1;
      uint64_t IFEE10:1;
      uint64_t IFEE11:1;
      uint64_t IFEE12:1;
      uint64_t IFEE13:1;
      uint64_t IFEE14:1;
      uint64_t IFEE15:1;
      uint64_t IFEE16:1;
      uint64_t IFEE17:1;
      uint64_t IFEE18:1;
      uint64_t IFEE19:1;
      uint64_t IFEE20:1;
      uint64_t IFEE21:1;
      uint64_t IFEE22:1;
      uint64_t IFEE23:1;
      uint64_t IFEE24:1;
      uint64_t IFEE25:1;
      uint64_t IFEE26:1;
      uint64_t IFEE27:1;
      uint64_t IFEE28:1;
      uint64_t IFEE29:1;
      uint64_t IFEE30:1;
      uint64_t IFEE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFEER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFE0:1;
      uint64_t IFE1:1;
      uint64_t IFE2:1;
      uint64_t IFE3:1;
      uint64_t IFE4:1;
      uint64_t IFE5:1;
      uint64_t IFE6:1;
      uint64_t IFE7:1;
      uint64_t IFE8:1;
      uint64_t IFE9:1;
      uint64_t IFE10:1;
      uint64_t IFE11:1;
      uint64_t IFE12:1;
      uint64_t IFE13:1;
      uint64_t IFE14:1;
      uint64_t IFE15:1;
      uint64_t IFE16:1;
      uint64_t IFE17:1;
      uint64_t IFE18:1;
      uint64_t IFE19:1;
      uint64_t IFE20:1;
      uint64_t IFE21:1;
      uint64_t IFE22:1;
      uint64_t IFE23:1;
      uint64_t IFE24:1;
      uint64_t IFE25:1;
      uint64_t IFE26:1;
      uint64_t IFE27:1;
      uint64_t IFE28:1;
      uint64_t IFE29:1;
      uint64_t IFE30:1;
      uint64_t IFE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPUE0:1;
      uint64_t IPUE1:1;
      uint64_t IPUE2:1;
      uint64_t IPUE3:1;
      uint64_t IPUE4:1;
      uint64_t IPUE5:1;
      uint64_t IPUE6:1;
      uint64_t IPUE7:1;
      uint64_t IPUE8:1;
      uint64_t IPUE9:1;
      uint64_t IPUE10:1;
      uint64_t IPUE11:1;
      uint64_t IPUE12:1;
      uint64_t IPUE13:1;
      uint64_t IPUE14:1;
      uint64_t IPUE15:1;
      uint64_t IPUE16:1;
      uint64_t IPUE17:1;
      uint64_t IPUE18:1;
      uint64_t IPUE19:1;
      uint64_t IPUE20:1;
      uint64_t IPUE21:1;
      uint64_t IPUE22:1;
      uint64_t IPUE23:1;
      uint64_t IPUE24:1;
      uint64_t IPUE25:1;
      uint64_t IPUE26:1;
      uint64_t IPUE27:1;
      uint64_t IPUE28:1;
      uint64_t IPUE29:1;
      uint64_t IPUE30:1;
      uint64_t IPUE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIPUER;

};

#define WKPU_2 (*(volatile struct WKPU_2_tag *) 0xf7f98000)

struct XBAR_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
      uint64_t reservedSpace6:1;
      uint64_t M7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS0;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t HPE7:1;
      uint64_t reservedSpace3:6;
      uint64_t HRP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS0;

  uint8_t res1[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
      uint64_t reservedSpace6:1;
      uint64_t M7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS1;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t HPE7:1;
      uint64_t reservedSpace3:6;
      uint64_t HRP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS1;

  uint8_t res3[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
      uint64_t reservedSpace6:1;
      uint64_t M7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS2;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t HPE7:1;
      uint64_t reservedSpace3:6;
      uint64_t HRP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS2;

  uint8_t res5[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
      uint64_t reservedSpace6:1;
      uint64_t M7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS3;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t HPE7:1;
      uint64_t reservedSpace3:6;
      uint64_t HRP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS3;

  uint8_t res7[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
      uint64_t reservedSpace6:1;
      uint64_t M7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS4;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t HPE7:1;
      uint64_t reservedSpace3:6;
      uint64_t HRP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS4;

  uint8_t res9[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
      uint64_t reservedSpace6:1;
      uint64_t M7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS5;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t HPE7:1;
      uint64_t reservedSpace3:6;
      uint64_t HRP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS5;

  uint8_t res11[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
      uint64_t reservedSpace6:1;
      uint64_t M7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS6;

