iSYSTEMLabs/winIDEAExampleWorkspaces/ST/SPC582B60/emptyTargetInit/spc582b60_sfr.h
  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t HPE7:1;
      uint64_t reservedSpace3:6;
      uint64_t HRP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS6;

  uint8_t res13[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
      uint64_t reservedSpace6:1;
      uint64_t M7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS7;

  uint8_t res14[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t HPE7:1;
      uint64_t reservedSpace3:6;
      uint64_t HRP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS7;

  uint8_t res15[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR0;

  uint8_t res16[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR1;

  uint8_t res17[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR2;

  uint8_t res18[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR3;

  uint8_t res19[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR4;

  uint8_t res20[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR5;

  uint8_t res21[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR6;

  uint8_t res22[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR7;

};

#define XBAR_1_1 (*(volatile struct XBAR_1_1_tag *) 0xf4008000)

struct XBIC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ME7:1;
      uint64_t ME6:1;
      uint64_t ME5:1;
      uint64_t ME4:1;
      uint64_t ME3:1;
      uint64_t ME2:1;
      uint64_t ME1:1;
      uint64_t ME0:1;
      uint64_t SE7:1;
      uint64_t SE6:1;
      uint64_t SE5:1;
      uint64_t SE4:1;
      uint64_t SE3:1;
      uint64_t SE2:1;
      uint64_t SE1:1;
      uint64_t SE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t reservedSpace0:16;
      uint64_t EIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t reservedSpace0:5;
      uint64_t DPME2:1;
      uint64_t DPME1:1;
      uint64_t DPME0:1;
      uint64_t reservedSpace1:3;
      uint64_t DPSE4:1;
      uint64_t DPSE3:1;
      uint64_t DPSE2:1;
      uint64_t DPSE1:1;
      uint64_t DPSE0:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  uint32_t EAR;
};

#define XBIC_1 (*(volatile struct XBIC_1_tag *) 0xf401c000)

